{"talks": [{"area_id": "12", "room_id": "3", "hour": "12", "candidate": "244", "title": "Razorback - Detectando ameaças quase em tempo real.", "date": "2011-06-30", "abstract": "Atualmente as ameaças client-side tem crescido muito e os metodos de detecção tem falhado visto a complexidade das técnicas e em especial o tempo e recursos necessários para conseguir analisar isso em tempo real  pela grande quantidade de tráfego existente nas redes atuais. O projeto Razorback foi criado pelos mesmos desenvolvedores do Snort para tentar mitigar esse problemas fazendo verificação de varias ataques clientes side em paralelo ao trafego em tempo real.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "20", "room_id": "1", "hour": "13", "candidate": "903", "title": "Reservado Organização", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "17", "room_id": "3", "hour": "09", "candidate": "93", "title": "Cloud AWS multiservidores. Para Problemas Complexos, Soluções Simples", "date": "2011-07-02", "abstract": "Cuando se busca otimização de custos e beneficios em ambientes de multiplos servidores com Software Livre, cada vez mais sobressai a opção Cloud Computer. Um exemplo muito funcional e utilizado hoje em dia é a solução cloud de Amazon. \r\nO Autor busca apresentar exemplos com casos reales de implementações simples e eficientes para solucionar problemas complexos no uso de múltiplos servidores en cloud computing utilizando AWS, Shell Script e PHP. ", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "18", "room_id": "714", "hour": "16", "candidate": "680", "title": "Encontro Comunitário GNOME Brasil", "date": "2011-06-30", "abstract": "A comunidade GNOME brasileira tem atuado nos mais diversos projetos e iniciativas da GNOME Foundation. Atualmente trabalhamos com desenvolvimento, tradução, documentação, infra, marketing e mobilização. Este evento comunitário tem por objetivo reunir os colaboradores e entusiastas do Projeto GNOME, apresentando nossos projetos e iniciativas com o intuito de recrutar mais colaboradores para o projeto nacional e internacional.", "level": "", "minute": "00", "zone_id": "7"}, {"area_id": "1", "room_id": "5", "hour": "16", "candidate": "231", "title": "Manipulação de Arquivos com Apache POI", "date": "2011-07-02", "abstract": "Apache POI é um projeto da Fundação Apache que fornece um conjunto de bibliotecas Java para manipulação de arquivos em diversos formatos. Podemos dizer que a grande missão do projeto é manter uma API para manipular vários formatos de arquivos com base nas normas Office Open XML (OOXML) da Microsoft e Compound Document Format (OLE2).", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "4", "room_id": "3", "hour": "13", "candidate": "229", "title": "Refactoring: Comece agora! (ou como não perder o sono ao olhar o código amanha) ", "date": "2011-07-01", "abstract": "Você não mexe no código, com medo de quebra-lo? Diz \"quando tiver\r\ntempo eu melhoro\"? Se você acha que tem que melhorar seu código mas\r\nse contenta dizendo que \"em time que está ganhando não se mexe\", você\r\nprecisa rever seu conceito de vitória. Em uma palavra, você precisa\r\nREFATORAR. Mas o que é isso? É na\r\nessência, melhorar o design depois do código escrito.\r\nSe você quer manter seu código limpo e se sentir sempre seguro para muda-lo, é com refactoring que você vai conseguir!", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "11", "room_id": "3", "hour": "13", "candidate": "267", "title": "Gestão e monitoramento de redes e dispositivos com Zabbix", "date": "2011-06-29", "abstract": "Essa palestra demonstra, em passos simples, como monitorar uma infraestrutura de TI de uma organização, independente do seu tipo ou tamanho.\r\nInforma como é possível monitorar praticamente tudo com o Zabbix.\r\nExemplifica como facilitar a gestão dos ativos, com base nos dados coletados com o Zabbix.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "10", "room_id": "4", "hour": "09", "candidate": "261", "title": "Hardware para Linux embarcado: tudo que você precisa saber!", "date": "2011-07-01", "abstract": "Suporte a hardware! Isto é um dos pontos fortes do Linux em sistemas embarcados, atualmente o Linux possui suporte a diversas arquiteturas e periféricos para esta classe de dispostos, porém, esta é a primeira barreira aos novos desenvolvedores Linux para sistemas embarcados.Esta apresentação e tem como objetivo apresentar plataformas de hadrware comumente utilizadas no desenvolvimento de sistemas embarcados, como o Linux opera nestas plataformas.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "4", "hour": "14", "candidate": "583", "title": "Automatizando tarefas shell ao máximo com o Expect", "date": "2011-07-02", "abstract": "Este é um tema recorrente para administradores de sistema, programadores, estudantes, enfim, todos os que precisaram, em alguma situação automatizar tarefas de linha de comando.\r\n\r\nExpect é uma poderosa e robusta ferramenta de automação de tarefas através de uma sintaxe simplificada mas ao mesmo tempo poderosa. Com ele é possível simular interação com um usuário através de scripts que resolvem os mais diversos tipos de problema do ambiente de linha de comando.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "18", "room_id": "714", "hour": "09", "candidate": "948", "title": "Encontro dos Grupos de Usuários", "date": "2011-07-02", "abstract": ".", "level": "", "minute": "00", "zone_id": "7"}, {"area_id": "4", "room_id": "1", "hour": "17", "candidate": "935", "title": "Building Open Clip Art Library and Open Font Library with Aiki Framework", "date": "2011-07-02", "abstract": "\r\nBuilding websites that allow for a community to not only participate\r\nby uploading clip art, fonts, favoriting and making comments requires\r\na new breed of technology that allows for varying levels of online\r\naccess and development. Aiki Framework is a web software that solves\r\nweb-based collaboration with the implementation of the simple\r\nprinciples of being agile, secure, fast and free.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "10", "room_id": "8", "hour": "13", "candidate": "900", "title": "Qi Hardware Introduces: The Milkymist One Video Synthesizer", "date": "2011-07-02", "abstract": "Meet the Milkymist, a project to develop a comprehensive open source\r\nsolution for the live synthesis of interactive visual effects for VJs\r\n(video performance artists). \r\n\r\nIn addition to demonstrating a real Milkymist One unit at FISL, the\r\npresentation will conclude with an update on the Qi Hardware project,\r\nand how making copyleft hardware in Brazil is a smart business\r\ndecision.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "7", "room_id": "4", "hour": "15", "candidate": "255", "title": "Photoshop X Gimp por ELAS", "date": "2011-07-02", "abstract": "Sem firulas, eu irei apresentar sobre Photoshop e a Ana Rauber sobre o Gimp, fazendo um comparativo entre os dois e demonstrando um pouco do que são estes softwares para edição/criação de imagens e usá-los com foco na correção/ melhoria/alteração de fotos, maquiagem digital, cutout, transforar magrelas em gostosas, ajuste de cor/iluminação... Palestra com colaboração de Luiz Rauber, para apaziguar caso der briga na disputa.\r\n", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "6", "room_id": "1", "hour": "09", "candidate": "737", "title": "The Magic of Hot Streaming Replication", "date": "2011-07-02", "abstract": "This talk explores the much-anticipated Postgres 9.0 features of hot standby and streaming replication. It explains how these features work, how to configure them, and their current limitations. It includes a hands-on demonstration that can be done either by the instructor or by students.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "18", "room_id": "714", "hour": "09", "candidate": "526", "title": "Deu pulga no meu tutorial e a liberdade de software saiu pulando", "date": "2011-06-30", "abstract": "Você já precisou de ajuda para usar softare livre? Encontrou? Apesar da importância crucial de uma boa documentação para o software livre, em geral não sobra muito tempo pra isso. Anda dando pulga nos nossos tutoriais e a liberdade sai pulando... Pra longe! O IV Encontro Texto Livre e Underlinux de Documentação em SL conta com a FSF e o SLEducacional pra trazer suas poções mágicas pro banho do nosso software de estimação. Algumas pulgas podem não ser banidas: quem sabe fazemos um circo?", "level": "advanced", "minute": "00", "zone_id": "7"}, {"area_id": "9", "room_id": "1", "hour": "11", "candidate": "323", "title": "Técnicas forense para a recuperação de arquivos", "date": "2011-07-02", "abstract": "Quem nunca perdeu um arquivo após uma deleção errada na máquina fotográfica, computador ou celular? Ou ainda, quem nunca formatou um pendrive ou partição de disco sem querer? Esta palestra mostrará como utilizar técnicas de forense computacional para recuperar arquivos apagados. Também ocorrerão recuperações a partir de dados ainda existentes na memória RAM. Haverá demonstrações ao vivo, onde as recuperações serão feitas, após deleção e formatação, com dd, programas especializados etc.", "level": "advanced", "minute": "00", "zone_id": "3"}, {"area_id": "18", "room_id": "714", "hour": "11", "candidate": "677", "title": "Evento Comunitario: Grupos productivos latinoamericanos de Software Libre", "date": "2011-07-02", "abstract": "Este encuentro presentado por Solar, propone un taller 'conversatorio' entre diferentes grupos productivos de distintos países latinoamericanos como Argentina, Brasil y Paraguay; para compartir experiencias y generar espacios de cooperación entre los diferentes grupos y comunidades. La programación constará de la apertura de parte de Solar, una presentación de los diferentes grupos productivos, y el debate sobre la problemática de la producción del SL en Latinoamérica con los presentes. ", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "17", "room_id": "5", "hour": "15", "candidate": "80", "title": "Energia Livre e a Revolução Energética", "date": "2011-07-02", "abstract": "A Revolução Energética ocorre há muitas décadas, no mínimo desde Nikola Tesla em 1890. Muitas tecnologias tem sido suprimidas por diversos artifícios pois se fossem tornadas públicas trariam muitos benefícios para as populações e muito prejuízo para as empresas que controlam o acesso a recursos como égua, transportes, energia elétrica, transmissão de energia, etc... A Revolução Energética reconstrói o contexto descentralizando a geração e uso da energia.", "level": "", "minute": "00", "zone_id": "6"}, {"area_id": "1", "room_id": "1", "hour": "10", "candidate": "146", "title": "Beyond Java SE 7", "date": "2011-07-02", "abstract": "Under Oracle's leadership Java SE 7 will release in July of this year and provide an incremental update to the Java Platform. The Java SE 8 release will finalize the major planned changes to the Java Platform with changes in the area of productivity, performance, and modularity. This talk will focus on those major changes.\r\n", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "8", "hour": "09", "candidate": "911", "title": "A New OSI For A New Decade", "date": "2011-06-29", "abstract": "Hear about how, after 12 years of 'open source', the Open Source Initiative are opening the doors to community governance at OSI", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "1", "hour": "16", "candidate": "881", "title": "Non-free advertisement - presented by your government", "date": "2011-07-01", "abstract": " What would you think about a sign on the highway saying “You need a\r\n Volkswagen to drive on this road. Contact your Volkswagen dealer for a\r\n gratis test drive – Your Government”? When it comes to software that\r\n opens PDF files, many public sector organisations do this every day.\r\n\r\n With the pdfreaders.org campaign FSFE has turned the spotlight on\r\n government organisations who behave in this way, exposing how frequent\r\n such advertisements for non-free software are.  With the help of\r\n activists across Europe, FSFE contacted these organisations and\r\n explained them how to improve their websites so that they respect our\r\n freedom.\r\n\r\n Why did FSFE choose this topic? How was the campaign organised? How\r\n successful was the campaign? What do you need to start this campaign\r\n in Latin America?", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "18", "room_id": "714", "hour": "13", "candidate": "534", "title": "ENEC - Executiva Nacional dos Estudantes de Computação", "date": "2011-06-29", "abstract": "Apresentação da ENEC: história, atribuições, finalidades e estrutura organizacional.\r\nDiscussão com os participantes sobre os projetos da ENEC principalmente aqueles relacionados ao uso e desenvolvimento de software livre nas Universidades especialmente pelos estudantes de computação.\r\nDiscussão sobre a reestruturação da ENEC e a participação em futuros eventos de software livre. \r\nDivulgação do ENECOMP 2011 - Congresso Nacional dos Estudantes de Computação que acontecerá em julho em Natal - RN", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "14", "room_id": "3", "hour": "15", "candidate": "888", "title": "Alta Disponibilidade de Servidores WEB utilizando as facilidades da Nuvem", "date": "2011-07-02", "abstract": "Melhores práticas na construção de sistemas Web de alta-disponibilidade em Linux usando sistemas Cloud Computing disponíveis. Serão visitadas técnicas de load balance, técnicas de reverse-proxy e técnicas de geo-balanceamento. Casos com exemplos reais para eCommerce e leilões online hospedados no Cloud TECLA serão discutidos.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "18", "room_id": "714", "hour": "13", "candidate": "676", "title": "II Encontro de Educação Popular e Filosofia Software Livre", "date": "2011-07-02", "abstract": "Aprofundamento do diálogo sobre Educação Popular feito no Encontro comunitário no fisl 11 a partir da publicação e distribuição de um livreto com esse texto publicado na página da comunidade: culturadigitalsul.blogspot.com\r\n\r\nDocumentação colaborativa da continuação do diálogo e formação e fortalecimento da rede de educadores e projetos de educação popular buscando a conexão entre os movimentos livres da cultura digital.\r\n\r\nDiálogo com Micro palestras sobre Educação Popular e cultura livre.", "level": "intermediate", "minute": "00", "zone_id": "7"}, {"area_id": "18", "room_id": "714", "hour": "10", "candidate": "853", "title": "Software Libre para Bibliotecas y Repositorios de Conocimiento", "date": "2011-07-02", "abstract": "Este  encuentro busca integrar diferentes visiones sobre la problemática de  la gestión y difusión del conocimiento académico en las instituciones  educativas y formativas de Mercosur. El punto de vista elegido es el uso  de Software Libre desarrollado para Bibliotecas.\r\nPara  esto se privilegiará la modalidad taller, con breves presentaciones  institucionales seguidas de intercambios sobre los proyectos de Bireme y  de la Facultad de Filosofía y Letras de la UBA. Finalmente se debatirá  con el público asistente.", "level": "", "minute": "00", "zone_id": "7"}, {"area_id": "18", "room_id": "714", "hour": "17", "candidate": "596", "title": "1º Encontro Comunitário do TcheLinux", "date": "2011-06-29", "abstract": "O 1º Encontro Comunitário do Tchelinux é uma reunião formal do nosso grupo de usuários para discutir o calendário de atividades e eventos no período 2011/2012 ligadas ao grupo, além de outras questões pertinentes, relativas pontos de presença do grupo, divulgação de projetos de software livre desenvolvidos por membros do grupo, projetos sociais e a estrutura atual do grupo.", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "15", "room_id": "8", "hour": "17", "candidate": "752", "title": "Happy Birthday, Linux!", "date": "2011-07-02", "abstract": "This year marks the twentieth anniversary of the Linux kernel.\r\nJust as a child's conception can be marked by several dates including\r\nthe actual birthday, so can the beginning of the Linux kernel be marked\r\nby several dates.  And just as a child passes through various stages of\r\ndevelopment, so has the Linux kernel.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "18", "room_id": "714", "hour": "09", "candidate": "672", "title": "Encontro de comunitário: Computação embarcada livre", "date": "2011-07-01", "abstract": "Encontro de comunidades: união de todas comunidades (atualmente não tão grandes) relacionadas a projetos de software livre para dispositivos embarcados.\r\nNesse encontro serão apresentadas os projetos relativos a sistemas embarcados abertos para que um maior o público conheça as iniciativas de software livre nessa área, além de serem apresentados projetos desenvolvidos por essas comunidades.\r\nEstão inclusos nesse grupo Arduino, eLua, tinyOS e outros.", "level": "intermediate", "minute": "00", "zone_id": "7"}, {"area_id": "17", "room_id": "1", "hour": "13", "candidate": "777", "title": "If you want something done, ask a busy person", "date": "2011-07-01", "abstract": "Most of us get involved with open source as a way to solve the\r\nproblems we face on a day-to-day basis. But technology in general, and\r\nopen source software in particular, also provides the key to solving\r\nthe more catastrophic problems that people face around the world\r\ntoday.", "level": "", "minute": "00", "zone_id": "6"}, {"area_id": "4", "room_id": "1", "hour": "13", "candidate": "149", "title": "From concepts to production at Google", "date": "2011-07-02", "abstract": "How often have we seen websites “down for maintenance”, sometimes for days on end? How often has planned server downtime taken much longer because of an unexpected problem? I'll talk about some of the processes and methods we use to reduce downtime and increase stability across our fleet of corporate virtual machines at Google.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "18", "room_id": "714", "hour": "10", "candidate": "529", "title": "Encontro Comunitário da Área SL da Campus Party", "date": "2011-07-01", "abstract": "Começando com a Campus Party Brasil 2010, a organização da área SL passou a ter um caráter comunitário. Esse é o encontro da comunidade que faz a Área SL da Campus Party acontecer para decidir os rumos da área e as atividades para a próxima Campus Party Brasil.", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "8", "room_id": "1", "hour": "12", "candidate": "933", "title": "...and now we have Apache OpenOffice", "date": "2011-07-02", "abstract": "O OpenOffice foi doado pela Oracle para a\r\nfundação Apache, e teremos em breve um Apache OpenOffice. Membros do grupo que vai desenvolver este projeto dentro da Apache (http://wiki.apache.org/incubator/OpenOfficeProposal)\r\nvão esclarecer sobre o projeto para a comunidade SL, explicar como as\r\ncoisas funcionam por lá e tirar dúvidas em geral, além de convidar\r\ninteressados para participar. ", "level": "", "minute": "00", "zone_id": "4"}, {"area_id": "18", "room_id": "714", "hour": "15", "candidate": "103", "title": "Encontro da Comunidade openSUSE", "date": "2011-07-02", "abstract": "O objetivo do Evento Comunitário é promover o encontro de usuários, desenvolvedores e curiosos do maravilhoso sistema operacional openSUSE.\r\nConhecer também um pouco mais dos sub-projetos openSUSE como Edu-Li-f-e, Build Service, Tumbleweed, SUSE Studio, e muitas outras novidades.", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "14", "room_id": "714", "hour": "17", "candidate": "945", "title": "Gestão Publica e Cidades Digitais", "date": "2011-07-02", "abstract": "Da concepção do projeto a sua aplicação. Do desenvolvimento e da sustentação técnica.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "1", "hour": "14", "candidate": "370", "title": "Nós Somos Piratas! O Capitalismo é Selvagem!", "date": "2011-07-02", "abstract": "Esta palesta é uma continuação da palestra Sim, eu sou um pirata, e você? disponível em http://bit.ly/eusoupirata e nela irei explicar porque somos piratas e que por maior que seja o desejo e combate da indústria do copyright, a pirataria irá continuar sempre, pois ela mesma é culpada pela sua existência. É um ciclo vicioso, que se retroalimentará, até que algo mude. Também mostrarei alguns detalhes desconhecidos do passado da indústria do copyright, e algumas novas reflexões a esse respeito.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "6", "hour": "15", "candidate": "891", "title": "Plataforma de SMS Cobra Tecnologia", "date": "2011-07-02", "abstract": "Denominada “Plataforma de SMS Cobra”, a solução combina tecnologias de padrões abertos de gateway e mensageria. A plataforma instalada no Data Center Cobra, com infraestrutura de software livre, faz o recebimento e roteamento  das  mensagens  junto  às  operadoras de celulares, que posteriormente entregam ao cliente final. Dentre as funcionalidades do sistema destacam-se envio e recebimento de mensagens SMS, gestão de status de cada mensagem trafegada, gestão de bilhetagem e cobrança, segurança.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "18", "room_id": "714", "hour": "10", "candidate": "448", "title": "Encontro comunitário Alfresco", "date": "2011-06-29", "abstract": "Nosso encontro visará a compreensão do cenário documental brasileiro a partir da experiência dos participantes do projeto, além da inserção do gerenciador eletrônico de documentos Alfresco dentro desse contexto e a articulaçao comunitária para o desenvolvimento do software no Brasil.", "level": "intermediate", "minute": "00", "zone_id": "7"}, {"area_id": "18", "room_id": "714", "hour": "12", "candidate": "532", "title": "Encontro de Hackers GNU+Linux-libre: desafios estratégicos para o Software Livre", "date": "2011-06-29", "abstract": "Encontros de Hackers GNU (GNU Hackers' Meetings) são encontros informais para mantenedores, desenvolvedores e voluntários ativos do Projeto GNU, além do público interessado, realizados ao redor do mundo. Em sua primeira edição no Brasil e na América Latina, a comunidade GNU se junta à comunidade Linux-libre com o propósito de expor e discutir questões estratégicas para o movimento Software Livre, como projetos prioritários e as ameaças causadas pela distribuição de firmware e software não-livre.", "level": "intermediate", "minute": "00", "zone_id": "7"}, {"area_id": "12", "room_id": "8", "hour": "12", "candidate": "934", "title": "Security in the field of digital whistleblowing", "date": "2011-07-02", "abstract": ".", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "17", "room_id": "714", "hour": "12", "candidate": "262", "title": "Profissionais: Com computação nas nuvens, infraestrutura será commodity?", "date": "2011-07-01", "abstract": "A palestra aborda o que pode acontecer com o mercado de profissionais de TI caso o uso efetivo de computação nas nuvens vire uma tendência real de mercado. O autor considera estratégias que o profissional pode usar e para que direção os esforços podem ser direcionados.\r\n", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "18", "room_id": "714", "hour": "09", "candidate": "946", "title": "Matéria Pública", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "7"}, {"area_id": "14", "room_id": "1", "hour": "12", "candidate": "749", "title": "Building a Business on Open Source Software", "date": "2011-06-30", "abstract": "For many years, free and open source software was exclusively associated\r\nwith the research community, in contrast to the closed source products\r\ndeveloped by commercial software vendors.  Over the past decade, there\r\nhas been a vast increase in the availability of open source software,\r\ngrowing from such projects as Linux and Apache. Open source software\r\nis being widely adopted in industry, which has led to numerous\r\nbusiness opportunities for entrepreneurs and vendors.  This activity\r\nis having a d", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "18", "room_id": "714", "hour": "13", "candidate": "681", "title": "I Encontro Comunitário LibreOffice", "date": "2011-07-01", "abstract": "O encontro visa reunir pessoas para informá-las e/ou clarificá-las sobre a criação da TDF (The Document Foundation), nova associação mantenedora da suíte de escritório livre, que foi batizada de LibreOffice.Fomentar o uso do ODF (Open Document Format) e seus benefícios.\r\n\r\nApresentaremos aos interessados como participar e colaborar com a comunidade LibreOffice, através de documentação, tradução, palestras, treinamento, desenvolvimento, QA (Quality Assurance) e relatos de bugs.", "level": "", "minute": "00", "zone_id": "7"}, {"area_id": "4", "room_id": "8", "hour": "15", "candidate": "940", "title": "CompatibleOne R&D Project: The Freedom of interoperability above the  > clouds", "date": "2011-07-02", "abstract": ".", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "1", "room_id": "8", "hour": "13", "candidate": "148", "title": "OpenJDK – When and How to Contribute to the Java SE Reference Implementation", "date": "2011-07-01", "abstract": "In this session you'll learn about Oracle’s strategy for and inner workings of OpenJDK. We'll dive into community participation in OpenJDK and you'll learn what it takes to contribute code to OpenJDK effectively and become a regular committer. Finally, we'll take a look at participating in OpenJDK as a community tester and how to go about providing feedback to the development teams.\r\n\r\n", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "12", "room_id": "8", "hour": "12", "candidate": "926", "title": "Kerckhoffs' Legacy: Security and Open Source", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "10", "room_id": "6", "hour": "10", "candidate": "543", "title": "Rede Mesh como Infraestrutura de Comunicação em Linhas de Transmissão de Energia", "date": "2011-07-02", "abstract": "O projeto ReMoTE, desenvolvido pelo Laboratório MídiaCom em parceria com a TBE (Transmissores Brasileiros de Energia), desenvolveu uma solução para infraestrutura de comunicação para linhas de transmissão de energia utilizando redes mesh. Essa solução está instalada em uma linha de transmissão que conecta a Usina Hidrelétrica de Machadinho (RS) à Subestação de Campos Novos (SC). A rede possui 41 nós mesh instalados ao longo da linha que possui aproximadamente 40km de extensão.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "16", "room_id": "5", "hour": "11", "candidate": "938", "title": "Inclusão digital em software livre através de Lan Houses.", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "12", "room_id": "701", "hour": "09", "candidate": "912", "title": "Forense digital utilizando distribuições Linux", "date": "2011-06-30", "abstract": "Forense digital é uma área da segurança da informação que procura verificar a ocorrência de incidentes e, se possível, descobrir o(s) responsável(is), através de indícios e evidências. A ideia neste trabalho é mostrar conceitos, metodologias, técnicas e ferramentas (software livre) aplicados a forense digital.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "12", "room_id": "7", "hour": "14", "candidate": "75", "title": "Análise de malware com Software Livre", "date": "2011-06-30", "abstract": "Não adianta fugir: cedo ou tarde você vai encontrar um binário desconhecido no seu sistema. Apagá-lo pode não resolver tudo. É preciso identificar o que ele faz, para saber, caso tenha ocorrido, o que ele fez. Essa palestra convida os programadores, administradores e analistas de segurança a se familiarizarem com as ferramentas de análise livres existentes para Linux. Nela, veremos como analisar por completo um pequeno malware.", "level": "advanced", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "702", "hour": "15", "candidate": "698", "title": "rrdtool tutorial", "date": "2011-07-02", "abstract": "Learn how to use RRDtool as a storage backend for\r\n  your data collection scripts and how to use its charting\r\n  functionality to produce beautiful graphs of your network traffic\r\n  and other time series data.\r\n", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "17", "room_id": "4", "hour": "11", "candidate": "49", "title": "GridComputing - resolvendo problemas em escala global", "date": "2011-06-29", "abstract": "Atividades propostas:\r\n\r\n1. Uma palestra que fornecerá aos participantes do evento os conceitos necessários para compreensão do conceito de Grid Computing, suas aplicações, os problemas que se propõe a resolver, e projetos de grande porte que ocorrem no Brasil, através do GridUNESP.\r\n\r\n2. Experimentos de cunho prático, a ocorrer em nosso estande, na seção de grupo de usuários. Que permitirão aos usuários exercitar na prática, os conceitos apresentados durante a palestra.", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "4", "room_id": "7", "hour": "12", "candidate": "657", "title": "Peça seu código em casamento: TDD do jeito certo.", "date": "2011-06-30", "abstract": "Todo desenvolvedor de software deveria ter um relacionamento de intimidade com seu código, cuidar muito bem dele e declarar votos para selar este relacionamento. Será apresentada a mais nova suite de testes da linguagem Python que permite qualquer desenvolvedor pedir seu código em casamento fazer ele jurar que está fazendo o que deveria fazer e do jeito certo.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "4", "room_id": "4", "hour": "10", "candidate": "589", "title": "Morra QTP, morra! (Um comparativo entre ferramentas proprietárias e opensource)", "date": "2011-06-29", "abstract": "Um comparativo entre as principais ferramentas para automação de testes disponíveis no mercado, proprietárias e opensource. Mostraremos os motivos pelo qual as ferramentas proprietárias pararam no tempo e já não podem lidar com as necessidades atuais do desenvolvimento de software.", "level": "advanced", "minute": "00", "zone_id": "2"}, {"area_id": "11", "room_id": "7", "hour": "13", "candidate": "520", "title": "Alerta: Exaustão do IPv4 vamos de IPv6", "date": "2011-06-30", "abstract": "Alertar a todos para a necessidade da implantação do IPv6 e mostrar o cenário atual de exaustão do IPv4. A preocupação é grande mais ainda dá tempo para pensar no futuro, a necessidade do IPv6 em um futuro muito próximo é muito grande, por isso as tecnologias e pessoas envolvidas precisam acordar para a sua implantação em suas Redes, Firewalls e etc.\r\n", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "14", "room_id": "7", "hour": "10", "candidate": "813", "title": "Monitoramento das acoes estrategicas do ministerio da saude com software livre", "date": "2011-06-30", "abstract": "Apresentação da experiência do Ministério da Saúde na utilização de software livre para o monitoramento de suas ações estratégicas.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "7", "hour": "16", "candidate": "809", "title": "Mostra de Vídeos Livres", "date": "2011-06-30", "abstract": "Mostra de Vídeos Livres", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "6", "hour": "09", "candidate": "857", "title": "Software Livre para a Área Médica", "date": "2011-06-29", "abstract": "Disponibilização de dados e a importância do ponto de vista de aplicações para a área de saúde e a indução ao desenvolvimento pela empresa nacional com redução de custos para o sistema nacional de saúde. ", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "7", "room_id": "702", "hour": "12", "candidate": "804", "title": "Oficina de Produção Gráfica - Gimp e associados", "date": "2011-07-01", "abstract": "Oficina de Produção Gráfica com Software Livre. Prática com Gimp e outros software associados. Leve seu notebook.\r\n\r\n                                                                                   \r\n                                                                                   \r\n                                                                                   \r\n                                                                                   \r\n                              ", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "15", "room_id": "5", "hour": "11", "candidate": "297", "title": "Pirataria e Anti-pirataria no Brasil: mitos, dados e fatos", "date": "2011-07-02", "abstract": "A partir da narrativa sobre o sistema de combate à pirataria, dos pontos de vista histórico, político, jurídico e midiático, o Instituto Overmundo, o Centro de Tecnologia e Sociedade da FGV e o Gpopai (Grupo de Pesquisa em Políticas Públicas para o Acesso à Informação) debaterão os custos sociais de projetos e políticas, como o Escola Legal, campanhas como “Quem compra produto pirata paga com a vida” e projetos de lei que intereferem direta ou indiretamente nesse sistema. ", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "7", "room_id": "702", "hour": "12", "candidate": "797", "title": "Oficina de Produção Gráfica Vetorial - Inkscape e associados", "date": "2011-07-02", "abstract": "Oficina de Produção Gráfica com Software Livre. Prática com Inkscape e outros softwares associados. Leve seu notebook.\r\n                                                                                   \r\n                                                                                   \r\n                                                                                   \r\n                                                    ", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "2", "room_id": "6", "hour": "13", "candidate": "463", "title": "Cloudooo: Compartilhe e Converta seus Documentos!", "date": "2011-07-01", "abstract": "O Cloudooo é um serviço web de conversão universal de documentos office, vídeos, áudios e imagens. Com o Cloudooo, é possivel criar uma nuvem de conversão em poucos minutos com a capacidade de converter mais de 100 mil documentos offices por dia. Já o cloudooo.com, é um web site (Opensource) que permite que as pessoas possam compartilhar, converter e visualizar documentos. Esta palestra visa demonstrar a arquitetura do cloudooo, como utilizar o serviço (API), como montar sua própria nuvem e o r", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "4", "hour": "12", "candidate": "505", "title": "Javascript levado a sério", "date": "2011-07-01", "abstract": "Javascript é a linguagem de script mais popular da internet.\r\nPorém, mesmo com essa fama, o Javascript ainda é incompreendido.\r\nSegundo Douglas Crockford, um dos gurus da linguagem, essa incompreensão tem varias origens.\r\nA palestra conta um pouco da história do Javascript, focando muito no desenvolvimento de Javascript profissional, como sugere o nome.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "4", "room_id": "4", "hour": "09", "candidate": "91", "title": "Fazendo as pazes com o seu código legado", "date": "2011-06-30", "abstract": "Todos nós já lidamos, estamos lidando ou lidaremos com um código legado. Todos nós reclamos, amaldiçoamos os criadores e etc. Mas quantos de nós sabem tirar o melhor dessa situação?  E como tirar o melhor disso? Como transformar uma grande pilha de código legado num código extensível e bem feito? \r\nEsse é o objeto dessa palestra. Propiciar uma viagem por técnicas que vão desde testes, refactorings até design evolutivo.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "3", "hour": "13", "candidate": "633", "title": "JavaScript: agora é sério", "date": "2011-06-30", "abstract": "Na superfície, JavaScript parece um cruzamento de Java com Perl reunindo apenas os defeitos e quase nenhuma virtude de ambas. Mas há também influências positivas dessas linguagens e de outras, como Scheme e Self, que, quando bem exploradas, tornam possíveis maravilhas como JQuery, CoffeeScript e Node.js. Esta palestra é para programadores experientes (re)descobrirem o que há de empolgante no desenvolvimento profissional com JavaScript moderno.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "1", "room_id": "4", "hour": "12", "candidate": "576", "title": "HTTP: A Base do Desenvolvimento Web", "date": "2011-06-30", "abstract": "O protocolo HTTP está há mais de 10 anos nos bastidores de quase todas as aplicações web, incluindo a explosão de uso do AJAX e a nova onda de APIs em REST. Está diretamente relacionado com a performance, ecalabilidade e SEO.\r\n\r\nSaber como ele funciona e como o PHP interage com ele é conhecimento obrigatório para qualquer programador web.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "17", "room_id": "4", "hour": "14", "candidate": "182", "title": "Webapp, já posso investir nisso ?", "date": "2011-07-01", "abstract": "Vamos botar para fritar o Geolocation, Local Storage, Tag Aúdio/Vídeo, CSS3(Media-Queries) em exemplos práticos e ver se isso realmente funciona em dispositivos móveis ou é bla bla bla da onda \"HTML5\". E bater um papo sobre como está o mercado para mobile web", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "13", "room_id": "5", "hour": "12", "candidate": "599", "title": "Migração colaborativa para PostgreSQL", "date": "2011-07-01", "abstract": "O processo de migração de plataforma de administração de dados dentro da esfera pública, deve ser coordenado e colaborativo, de maneira que todos os artefatos utilizados no fluxo de migração devem ser adaptados colaborativamente – em sinergia com os projetos base – a fim de manter a reutilização destes componentes em outras fases e/ou processos de migração, além de favorecer a continuidade e evolução do software livre. \r\nNesta palestra, iremos demonstrar algumas fases do processo de migração para", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "14", "room_id": "4", "hour": "10", "candidate": "915", "title": "Linux em Mainframe - Construindo uma cidade Inteligente", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "3", "room_id": "702", "hour": "12", "candidate": "704", "title": "Desenvolvendo aplicações Realtime com Node.JS", "date": "2011-06-30", "abstract": "   1. Entendendo aplicações Realtime (Conceitos e aplicação)\r\n   2. Node.JS básico\r\n   3. Desenvolvendo uma aplicação Realtime com Node.JS\r\n\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "1", "room_id": "5", "hour": "14", "candidate": "2", "title": "Webservices e Computação em Nuvem com PHP", "date": "2011-07-02", "abstract": "A palestra irá apresentar os recursos disponíveis na biblioteca do Zend Framework para criação e consumo de webservices utilizando os formatos XML-RPC, SOAP e REST, os componentes prontos para consumo de serviços de APIs de grandes fornecedores e o suporte para consumo de serviços de computação em nuvem.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "17", "room_id": "4", "hour": "12", "candidate": "365", "title": "D-Flash talks!!! - 5 minutos para tópicos emergentes no mercado de tecnologia", "date": "2011-06-29", "abstract": "Baseado na ideia do \"lightning talks\", ou Palestras relâmpago, a 4Linux disponibiliza o seu corpo técnico presente no FISL para uma palestra completamente diferente e descontraída, abordando os mais diversos tópicos emergentes da tecnologia livre. Tópicos que muitas vezes são explorados somente por poucos especialistas, costumam ser polêmicos e incentivando a inovação na maneira de pensamento do publico.", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "4", "room_id": "3", "hour": "15", "candidate": "574", "title": "Comunidade de Testes Expresso - Agilidade Colaborativa", "date": "2011-06-29", "abstract": "A Comunidade de Testes Expresso baseia-se em princípios ágeis para a elaboração de um processo de testes voltado ao SL, interagindo com a comunidade de desenvolvimento de forma a garantir a qualidade do projeto expressolivre.org\r\nCriada em 2010, implementa a proposta apresentada no FISL11 na palestra \"O Caminho Ágil entre Requisitos e Testes\". Na palestra, abordaremos a estrutura da comunidade, metodologias, ferramentas livre de gestão de testes, defeitos, automação e integração contínua.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "1", "room_id": "4", "hour": "09", "candidate": "238", "title": "PHP vs Java: Duelo de Titãs", "date": "2011-07-02", "abstract": "PHP ou Java? Qual é a melhor linguagem? Existe alguma, afinal? Nessa palestra divertida e descontraída, conheça as experiências de dois programadores fanboys e aqui-inimigos, um de PHP e outro de Java, argumentando até a morte para defender sua linguagem preferida.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "6", "room_id": "5", "hour": "13", "candidate": "412", "title": "Drupal 7 - Nova versão para novos desafios", "date": "2011-06-29", "abstract": "Neste ano o Drupal completou 10 anos com o lançamento de uma nova versão, a 7. Mais estável e incorporando diversos recursos que antes estavam fora do núcleo do sistema, ela é a resposta deste CMS para as novas necessidades de desenvolvimento da Web 2.0, seja para redes sociais, sites corporativos, portais e intranets, inclusive integrando com legados. Esta palestra mostra o que mudou nesta versão e suas facilidades para uso por desenvolvedores e designers de web.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "9", "room_id": "4", "hour": "09", "candidate": "724", "title": "Ferramentas Livres para Cloud Computing", "date": "2011-06-29", "abstract": "O objetivo desta palestra é elencar e discutir as principais ferramentas e sistemas livres participantes no processo de implantação, configuração e gerenciamento deste ambiente.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "14", "room_id": "4", "hour": "13", "candidate": "85", "title": "Software Livre na Infraestrutura de Segurança do Governo Brasileiro", "date": "2011-06-30", "abstract": "Esta palestra apresenta um caso de sucesso de uso de software livre no governo brasileiro, que consistiu na criação de um novo sistema para operar a emissão de certificados digitais, essenciais na infraestrutura de segurança das comunicações pela Internet e dos documentos eletrônicos, tanto para o governo quanto para a sociedade. Em vez de gastar milhões para atualizar o sistema antigo (proprietário) o governo decidiu investir em capacitação, e desenvolver o novo sistema no Brasil.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "2", "room_id": "3", "hour": "12", "candidate": "270", "title": "Programando em Python - por que se fala tanto? ", "date": "2011-07-02", "abstract": "A linguagem de programação Python se destaca por ser fácil de aprender, poderosa o bastante para todo o tipo de projeto ou tarefa, Software Livre, Multiplataforma, e propiciar códigos que facilitam a manutenção.\r\n\r\nDescubra na prática algumas destas virtudes com exemplos interativos de Python para criar imagens e desenhos e manipular dados extraídos diretamente da Internet.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "8", "room_id": "4", "hour": "13", "candidate": "108", "title": "Debian Squeeze: Dominação mundial continua", "date": "2011-07-02", "abstract": "Apresentar as novidades do lançamento da nova versão estável, conhecida como 6.0 ou Squeezy do Sistema Operacional Universal (Debian), como foi o ciclo de desenvolvimento, as mudanças de relação com os voluntários, os preparativos para o lançamento e o principal: Como está o andamento da dominação mundial!\r\n ", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "16", "room_id": "3", "hour": "09", "candidate": "810", "title": "Software Livre como política pública para inclusão digital", "date": "2011-06-29", "abstract": "A palestra tem como objetivo fazer um chamamento do publico para o desenvolvimento individual e coletivo de uma práxis tecnológica mostrando que a tecnologia, além de não ser neutra, infleuncia profundamente nossa cotidiano inclusive potencializando a inclusão sócio-digital ou maximizando a exclusão. Nesse sentido, faz-se um resgate do valor do conhecimento acadêmico construído a partir das práticas colaborativas fundadas na filosofia GNU.\r\n\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "6", "room_id": "4", "hour": "13", "candidate": "555", "title": "Joomla como plataforma de desenvolvimento de soluções próprias", "date": "2011-07-01", "abstract": "Esta palestra procura abrir sua mente para possibilidade de usar Joomla como plataforma de desenvolvimento de aplicações,\r\nque vão muito além de simples sites. Desde Intranets, ERPs, CRMs, Help Desks, a até mesmo migrar parcial ou totalmente o \r\nacesso a suas aplicações, mesmo as que ainda estejam escrita em Delphi ou VB6. \r\n\r\nSerá focada em questões técnicas e mais abrangentes de interesse comum em programadores que querem programar algo novo, \r\nem detrimento de apenas usar o que já existe.", "level": "advanced", "minute": "00", "zone_id": "2"}, {"area_id": "17", "room_id": "4", "hour": "13", "candidate": "58", "title": "MySQL Cluster com NoSQL", "date": "2011-06-29", "abstract": "MySQL é o Banco de Dados de Software Livre Mais Popular do mundo, com 12 Milhões de Instalações ativas \r\n Essa palestra tem como objetivo orientar administradores de bancos de dados e desenvolvedores , em como implementar uma arquitetura de MySQL Cluster utilizando a API NDB NoSQL. ", "level": "advanced", "minute": "00", "zone_id": "6"}, {"area_id": "16", "room_id": "6", "hour": "10", "candidate": "822", "title": "Workshopp Ferramentas e Ambientes Livres para Educação", "date": "2011-06-30", "abstract": "reiner.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "16", "room_id": "5", "hour": "09", "candidate": "824", "title": "Universidade e Software Livre: a academia e o compartilhamento do conhecimento", "date": "2011-07-01", "abstract": "nelson.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "2", "room_id": "4", "hour": "11", "candidate": "790", "title": "Testando interfaces web", "date": "2011-07-01", "abstract": "Usar testes automatizados para desenvolver software é uma prática cada vez mais comum e essencial para a construção de código com qualidade. No desenvolvimento de interfaces não é diferente. Nessa palestra, Andrews e Francisco vão demonstrar como testar interfaces web de forma divertida e produtiva, utilizando ferramentas como Jasmine, QUnit e Splinter.\r\n", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "16", "room_id": "6", "hour": "15", "candidate": "825", "title": "Projeto UCA: avaliando trajetórias, pensando caminhos", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "1", "room_id": "4", "hour": "11", "candidate": "538", "title": "Refatoração de Código com Capitão Nascimento - Clean Code", "date": "2011-07-02", "abstract": "Mostrar códigos reais e incrivelmente nojentos, difíceis de ler e dar manutenção, quem nunca pegou um código legado? Quem nunca teve que correr para entregar algo? \r\nE depois? um monte de códigos ruins e \"mau cheirosos\".\r\nComo proceder em casos assim? TDD? o que poderia ajudar?", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "16", "room_id": "5", "hour": "09", "candidate": "826", "title": "Trocando experiências, construindo cultura  livre e educação", "date": "2011-07-02", "abstract": "clarisse.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "6", "hour": "11", "candidate": "816", "title": "Globo.com - Criando um dos maiores portais da internet com Software Livre", "date": "2011-07-02", "abstract": "A Globo.com possui um conglomerado de portais líderes no Brasil nas suas categorias - Notícias, Esportes, Entretenimento e Vídeos. Tudo isso está construído em cima de software livre. Nessa palestra, irei contar um pouco da nossa experiência, como temos contribuído de volta com a comunidade (inclusive estimulamos nossas pessoas a contribuir), como aplicamos o modelo de software livre nas contribuições para os projetos internos, closed-source.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "4", "hour": "16", "candidate": "725", "title": "Além do código: inclusão social através da linguagem universal do software livre", "date": "2011-07-02", "abstract": "O software livre não é feito só de códigos, mas principalmente de pessoas. Com o objetivo de despertar o interesse das mulheres para o software livre, público notoriamente menos numeroso na área de tecnologia, esta palestra aborda a necessidade de compartilhar com diversas áreas do conhecimento a responsabilidade sobre o desenvolvimento do software livre. ", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "4", "room_id": "6", "hour": "13", "candidate": "252", "title": "Implantando Continuous Deployment no seu projeto usando ferramentas open source", "date": "2011-06-30", "abstract": "Então você já faz integração contínua, já automatiza as suas builds e já\r\ntrabalha com iterações ágeis? Que tal automatizar também a implantação\r\nde novas versões da sua aplicação, criando um processo de continuous\r\ndeployment?\r\n \r\nEsta palestra irá mostrar como utilizar um processo de implantação\r\ncontínua de aplicações usando a ferramenta Hudson (ou o seu fork\r\nJenkins). Você irá aprender técnicas para implantar automaticamente uma\r\nnova versão, como tratar com mudanças no banco de dados, como fazer\r\n", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "5", "hour": "09", "candidate": "636", "title": "GP-Web", "date": "2011-06-29", "abstract": "Apresentar as funcionalidades do software GP-Web que se encontra disponível no Portal do Softare Público, para gerenciamento da gestão, projetos, tramitação de documentos e e-mails\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "3", "hour": "10", "candidate": "643", "title": "Projetos Maduros de Infraestrutura Baseados em Software Livre", "date": "2011-07-02", "abstract": "Palestra sobre \"cases\" do uso de tecnologias abertas em infraestrutura de produção de um grande portal de Software, líder no seu segmento no Brasil com mais de 8 milhões de acessos únicos por mês e 15 mil usuários conectados simultaneamente. A idéia é apresentar o projeto da VAGAS e como as tecnologias abertas foram aplicadas na empresa.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "17", "room_id": "6", "hour": "09", "candidate": "472", "title": "SQL, NoSQL ou NewSQL: Onde armazenar meus dados?", "date": "2011-06-30", "abstract": "Nos últimos 30 anos tem-se vivido a hegemonia dos bancos de dados relacionais, a grande bala de prata da TI. No entanto, em 2009 surgiu o movimento noSQL que além de trazer novas opções de ferramentas e modelos de dados, criou uma nova escola de pensamento. Esta nova escola tem exercido forte influência nos tradicionais bancos de dados relacionais, emergindo uma nova classe de ferramentas, chamada NewSQL.\r\nEsta palestra irá apresentar as diferenças e similaridades entre SQL, NoSQL e NewSQL.", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "15", "room_id": "3", "hour": "09", "candidate": "330", "title": "10 mitos.... 12 anos depois!", "date": "2011-06-30", "abstract": "Em 1999, Tim O'Really, dono da editora O'Really - uma das mais respeitadas editoras de livros técnicos do mundo - e criador da expressão 'web 2.0\"  deu uma palestra para Diretores de Empresas da \"Fortune 500\" e esta palestra deu origem ao artigo  \"Ten Myths about Open Source Software\". Em 1999 também nascia o FISL. Passados 12 anos,  esta palestra apresentará os 10 mitos e avaliará um a um o que aconteceu com cada um deles e se eles eram realmente mitos ou o tempo mostrou o contrário.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "3", "hour": "12", "candidate": "245", "title": "Transifex - Uma nova visão de como gerenciar traduções", "date": "2011-06-29", "abstract": "Aprenda como você pode utilizar o que há de mais atual na Web no que se diz respeito a gerenciamento de traduções. Se você é um desenvolvedor, gerente de tradução/localização ou tradutor, não importa. Aprenda tudo sobre o Transifex e saiba como desfrutar dos benefícios que ele trás para o processo de tradução do seu projeto e/ou empresa.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "1", "room_id": "3", "hour": "12", "candidate": "159", "title": "PHP Sob Ataque - Técnicas de Programação Defensiva", "date": "2011-07-01", "abstract": "É comum encontrar desenvolvedores desatentos deixando brechas que, por mais simples que sejam, podem gerar situações desagradáveis. Na palestra do ano passado (PHP à Prova de Balas) o intuito era mostrar maneiras de ataque variadas e como se defender de cada uma delas. O foco desse ano não é prevenção de ataques contra a aplicação e sim contra o seu usuário, modalidade de ataque que vem crescendo. Esta palestra tenta reunir cuidados que devem ser tomados na hora de desenvolver uma aplicação web.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "23", "room_id": "701", "hour": "09", "candidate": "693", "title": "Desenvolvendo aplicações para MeeGo com o Qt Creator", "date": "2011-06-29", "abstract": "Pré-requisito conhecimento em:\r\n-programação  (C, python ou outra linguagem)\r\n-Inglês\r\n-uso de APIS\r\n-uso de IDE de programação\r\n\r\nDesejável:\r\n-Empacotamento no Linux\r\n-Arquitetura do Linux\r\n\r\n\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "4", "room_id": "5", "hour": "12", "candidate": "458", "title": "Testando software: quando testar, o que testar, como testar", "date": "2011-07-02", "abstract": "No mundo do software livre já se adota boas práticas de programação como o uso ostensivo de testes, porém não é comum um desenvolvedor conhecer na prática o uso de testes, os diferentes tipos de testes, que parte do software testar, ou como se comportar quando um bug é identificado em seu software, pretendo abordar o uso de testes no dia-a-dia, os diferentes tipos deles, desenvolvimento guiado por testes (TDD), assim como o que não testar. ", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "3", "hour": "13", "candidate": "1", "title": "Pentaho: Inteligência de Negócios utilizando Software Livre", "date": "2011-07-02", "abstract": "Sua organização tem uma estratégia de inteligência de negócios (business intelligence - BI), sabe o que é isso? Pentaho é uma suíte de BI de código aberto, gratuita, completa, robusta e poderosa. Saiba mais como, usando o Pentaho você pode transformar, de forma livre, os dados de sua empresa em informação extremamente relevante para uma tomada de decisão acertada.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "9", "room_id": "5", "hour": "14", "candidate": "892", "title": "Além do convencional: O futuro de ARM em Linux", "date": "2011-07-01", "abstract": "A comunidade Linux foi construída em torno da plataforma x86, mas hoje, graças ao Android e a outras aplicações móveis, a grande maioria das pessoas usando software livre o faz usando um dispositivo ARM. Para desenvolvedores, ARM desperta interesse pelas suas peculiaridades arquiteturais e econômicas; nesta palestra apresento algumas destas características, e discuto os desafios tecnológicos e sociais que a plataforma introduz aos projetos e ecosistemas de software livre.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "6", "room_id": "6", "hour": "15", "candidate": "788", "title": "Dados abertos do wikipedia ao governo, www.paraondefoiomeudinheiro.com.br ?", "date": "2011-06-30", "abstract": "Uma conversa que pretende abordar software-livre, política e técnicas\r\nde manipulação e visualização de dados abertos. Uma abordagem sobre o\r\nque são dados abertos, e como eles podem ser explorados por todos, e\r\nque este tipo de padrão dentro do governo pode gerar participação\r\ncolaborativa da sociedade. Será abordado assuntos conceituais, mas\r\ntambém técnicas para construir um website com dados do governo já\r\ndisponibilizados, além de sugestões e previsões sobre como estes dados\r\nvão estar no futuro ", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "7", "room_id": "3", "hour": "11", "candidate": "211", "title": "Realidade Aumentada  na plataforma Linux. ", "date": "2011-06-30", "abstract": "Utilizando técnicas de visão computacional junto a computação gráfica, a Realidade Aumentada disponibiliza uma inovadora interação homem-máquina, onde os objetos virtuais introduzidos no ambiente real podem ser manipulados com as próprias mão, assim proporcionando ao usuário uma interação inédita e atrativa.", "level": "intermediate", "minute": "00", "zone_id": "4"}, {"area_id": "7", "room_id": "702", "hour": "09", "candidate": "941", "title": "Metadados em arquivos de imagens: porquê usá-los e como?", "date": "2011-06-29", "abstract": "Metadados são informações embutidas no arquivo de imagem, que\r\ndescrevem os dados em pixels, condições ambientais e da câmera\r\nfotógrafica. Eles podem servir a diversas finalidades, como organizar\r\nbancos de imagens, permitir buscas, registrar nomes dos fotógrafos e\r\nautores, inserir tags por assunto, e até mesmo serem lidas por\r\ngerenciadores de conteúdo web, como o Gallery. Na oficina serão dados\r\nexemplos concretos de uso de metadados em imagens, como visualização\r\nde metadados, edição e remoção, agilizando o dia a dia do fotógrafo e\r\ncriando um fluxo de trabalho onde metadados sejam manipulados de forma\r\navançada. A oficina baseia-se em exemplos concretos de comandos e\r\nprogramas a serem utilizados. No fim, será feita uma demonstração de\r\nuso de metadados em uma instalação de Gallery.\r\n\r\nRequisitos desejáveis: GNU/Linux nível básico\r\n\r\nPúblico-alvo: Fotógrafos, webmasters, designers e desenvolvedores web\r\n", "level": "", "minute": "00", "zone_id": "4"}, {"area_id": "15", "room_id": "7", "hour": "13", "candidate": "899", "title": "Mostra de Vídeos Livres", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "23", "room_id": "6", "hour": "14", "candidate": "730", "title": "Intel Academics", "date": "2011-06-29", "abstract": "A palestra visa dar uma visão do que é necessário para se iniciar uma start up de base tecnologica (ou não). Dicas de postura, relacionamentos e maneiras de refinar o trabalho serão tratadas, inclusive mostrando como um desenvolvedor de Meego pode se tornar um empresário de sucesso.", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "16", "room_id": "7", "hour": "15", "candidate": "930", "title": "A Pedagogia Libertadora do Software Livre", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "7", "hour": "13", "candidate": "805", "title": "Mostra de Vídeos Livres", "date": "2011-07-02", "abstract": "Mostra de Vídeos Livres", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "2", "room_id": "5", "hour": "09", "candidate": "760", "title": "Python e Lego Mindstorms - programando robôs", "date": "2011-06-30", "abstract": "Nesta palestra será apresentado o kit de robótica Lego Mindstorms NXT\r\ne como ele pode ser programado utilizando Python.\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "7", "room_id": "3", "hour": "10", "candidate": "174", "title": "Jogos sociais e software livre - como se planejar para 80 milhões de jogadores", "date": "2011-06-30", "abstract": "A indústria de jogos é um dos últimos bastiões do software proprietário: o uso de software livre nesta área é considerado uma exceção à regra. Isso, no entanto, está mudando. Empresas que atuam no segmento de jogos sociais precisam de soluções que dêem conta de mais de 80 milhões de usuários por mês, conectados a milhares de servidores. A invasão do código livre na área de jogos está começando por onde ninguém enxerga: adivinha que plataforma está por trás da sua colheita de milho virtual?", "level": "intermediate", "minute": "00", "zone_id": "4"}, {"area_id": "11", "room_id": "701", "hour": "12", "candidate": "691", "title": "Debian GNU/Linux Essentials for women - 2", "date": "2011-06-30", "abstract": "Este treinamento é uma adaptação para intensivo do curso Linux Essentials, da Formação 4Linux, que introduz o aluno ao universo GNU/Linux, apresenta a filosofia do Software Livre e habilita a interagir de forma adequada com o sistema. Para usuários iniciantes e iniciados.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "702", "hour": "15", "candidate": "563", "title": "Minicurso SNEP Livre PBX IP", "date": "2011-06-30", "abstract": "O minicurso SNEP Livre pretende demonstrar como é possível configurar uma central telefônica PBX IP com as ferramentas intuitivas do software SNEP, PBX híbrido baseado em Asterisk e GNU/Linux licenciado sob a LGPL. Neste minicurso, os participantes verão de forma prática como o software funciona e se integra com os sistemas que lhe servem de sustentáculo para oferecer às empresas que o utilizam flexibilidade de gestão, administração facilitada e qualidade em tecnologia.", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "3", "room_id": "3", "hour": "14", "candidate": "213", "title": "Android: Conhecendo a plataforma.", "date": "2011-07-01", "abstract": "Nesta palestra veremos procedimentos de instalação do SDK e NDK Android, como também a Apresentação dos principais métodos para captura de imagens na plataforma Android para posterior processamento. Exemplos com código fonte de aplicativos de realidade aumentada em celulares Android. ", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "10", "room_id": "701", "hour": "15", "candidate": "690", "title": "Construindo redes de sensores sem fio com o EPOS", "date": "2011-07-01", "abstract": "Redes de sensores sem-fio e outros sistemas pervasivos são cada vez mais comuns em nosso dia a dia. Esta tecnologia traz, junto das novas possibilidades de aplicações, um grande conjunto de desafios, o que deu margem ao surgimento de novas soluções de integração de componentes de processamento (CPU) e rádio, novos mecanismos de comunicação... http://epos.lisha.ufsc.br/EPOSMote+Tutorial+on+FISL+2011", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "701", "hour": "12", "candidate": "683", "title": "Debian GNU/Linux Essentials for women - 3", "date": "2011-07-01", "abstract": "Este treinamento é uma adaptação para intensivo do curso Linux Essentials, da Formação 4Linux, que introduz o aluno ao universo GNU/Linux, apresenta a filosofia do Software Livre e habilita a interagir de forma adequada com o sistema. Para usuários iniciantes e iniciados.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "702", "hour": "09", "candidate": "745", "title": "IPv6 básico - ênfase em infraestrutura e administração de sistemas 1", "date": "2011-07-01", "abstract": "Parte 1 (manhã, 9h - 12h):\r\n- O que é IPv6 e qual sua importância\r\n- Funcionamento básico do IPv6\r\n- Endereçamento IPv6\r\n\r\nRequisitos para participação:\r\n- Formação em Ciência da Computação, Engenharia ou curso similar\r\n- Experiência com administração de redes e sistemas\r\n- Estudar o e-learning: http://curso.ipv6.br (são aproximadamente 4h de\r\ncurso)\r\n- Trazer notebook com rede wireless para a oficina ", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "3", "room_id": "701", "hour": "09", "candidate": "688", "title": "IPv6 básico - ênfase em software e desenvolvimento", "date": "2011-07-02", "abstract": "Parte 1 (manhã, 9h - 12h):\r\n- O que é IPv6 e qual sua importância\r\n- Funcionamento básico do IPv6\r\n- Endereçamento IPv6\r\n- IPv6 e DNS \r\nRequisitos para participação:\r\n- Formação em Ciência da Computação, Engenharia ou curso similar\r\n- Experiência com programação C ou Java\r\n- Estudar o e-learning: http://curso.ipv6.br (são aproximadamente 4h de\r\ncurso)\r\n- Trazer notebook com rede wireless para a oficina\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "701", "hour": "15", "candidate": "747", "title": "IPv6 básico - ênfase em software e desenvolvimento 2", "date": "2011-07-02", "abstract": "Parte 2 (tarde, 15h - 18h):\r\n- Túneis e outras técnicas de transição\r\n- Configuração do IPv6 nos sistemas operacionais e roteadores\r\n- IPv6 e DNS\r\n- IPv6 e outros serviços\r\n\r\nRequisitos para participação:\r\n- Formação em Ciência da Computação, Engenharia ou curso similar\r\n- Experiência com administração de redes e sistemas\r\n- Estudar o e-learning: http://curso.ipv6.br (são aproximadamente 4h de\r\ncurso)\r\n- Trazer notebook com rede wireless para a oficina ", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "6", "hour": "12", "candidate": "50", "title": "O HMTL5 e suas novas API's", "date": "2011-07-02", "abstract": "A palestra mostrará o que muda na semântica com o HTML5, farei uma comparação entre a antiga e a nova forma de codificar, usando as novas tags. Depois disso falarei sobre as novas API's como por exemplo, Novos Campos de Formulário, Geolocalização, Áudio, Vídeo, Canvas, localStorage, offline aplication, Cross Domain Message, Web Workers, Web Sockets, entre outras...", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "17", "room_id": "4", "hour": "15", "candidate": "862", "title": "ePub: Padrão Aberto para Livros Eletrônicos (ebooks) ", "date": "2011-06-29", "abstract": "Livros eletrônicos estão se popularizando com extrema rapidez no mercado, impulsionados pelas vendas crescentes de tablets (como o Galaxy Tab, iPad e Xoom), além dos tradicionais leitores de e-book como o Kindle da Amazon ou o Nook da Barnes & Noble. Tal como os formatos de documentos proprietários aprisionaram informações e usuários no mundo dos desktops nas últimas décadas, no mundo dos eBooks o aprisionamento já acontece.A escolha do formato adequado de livros eletrônicos é primordial. ", "level": "", "minute": "00", "zone_id": "6"}, {"area_id": "1", "room_id": "5", "hour": "16", "candidate": "874", "title": "Comece agora com Cloud Computing e Projete seu Estilo de Vida", "date": "2011-06-29", "abstract": "Ao juntar a flexibilidade do software, a possibilidade de trabalhar com pessoas de qualquer lugar e o gigantesco conhecimento contido no mundo do software livre, o desenvolvedor de software tem a liberdade de criar o seu próprio estilo de vida. Essa palestra irá mostrar como tirar proveito dos ambientes de computação na nuvem, e irá mostrar como software livre é a melhor opção nesse importante momento da computação.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "702", "hour": "12", "candidate": "919", "title": "Android: Workshop para Iniciantes", "date": "2011-06-29", "abstract": "Neste workshop, a equipe Android guiará você pelos passos necessários para escrever seu primeiro aplicativo Android, começando com o básico: configuração do ambiente, layouts, views, manipulação de eventos, Activities e Intents. No final deste laboratório, você terá um aplicativo Android funcional que exibe uma interface, lê entrada do usuário, persiste os dados por múltiplas execuções e interage com outras aplicações através de Intents.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "11", "room_id": "701", "hour": "12", "candidate": "692", "title": "Debian GNU/Linux Essentials for women - 1", "date": "2011-06-29", "abstract": "Este treinamento é uma adaptação para intensivo do curso Linux Essentials, da Formação 4Linux, que introduz o aluno ao universo GNU/Linux, apresenta a filosofia do Software Livre e habilita a interagir de forma adequada com o sistema. Para usuários iniciantes e iniciados. ", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "17", "room_id": "5", "hour": "12", "candidate": "318", "title": "Criando aplicações com autenticação centralizada usando OpenLDAP e PHP", "date": "2011-06-29", "abstract": "Com o OpenLDAP, podemos centralizar e simplificar o acesso a diversos aplicativos da sua infraestrutura. E com nossos aplicativos PHP, não podia ser diferente. Nesta palestra iremos ver o que é o OpenLDAP, como ele funciona e como podemos criar aplicações que interagem com ele usando o PHP.", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "12", "room_id": "4", "hour": "16", "candidate": "548", "title": "F13-CN: Gestão Segura de Conexões SSH", "date": "2011-06-29", "abstract": "Imagine uma empresa de prestação de serviços em linux, ou mesmo um setor de TI onde vários funcionários precisam ter acesso a diversos servidores. E quando um funcionário sai da empresa? Automaticamente são iniciados procedimentos de auditoria e troca de senhas que geram grandes transtornos e sensação de insegurança para o administrador da rede. O F13-CN atua como um \"proxy\" SSH, implementando diversos tipos de controle sobre os acessos que os técnicos podem fazer nos servidores de sua empresa.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "12", "room_id": "701", "hour": "09", "candidate": "910", "title": "Conhecendo e Dominando o IPTables", "date": "2011-07-01", "abstract": "Os autores irão abordar conhecimentos básicos de protocolos e modelo de referência OSI/ISO (e/ou TCP/IP) para construção do raciocínio lógico ao IPTables. Conceito de portas. \r\nO que é IPTables, tabelas, chains, nat e redirecionamento.\r\nExemplos práticos de composição de um firewall básico para proteção contra os ataques mais comuns: Syn-flood, ping-da-morte, brute-force.\r\nBloqueio e liberação de portas, hosts, palavras e outros.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "14", "room_id": "3", "hour": "10", "candidate": "828", "title": "A Estratégia Nacional da Ciência, Tecnologia e Inovação: Desafios e Perspectivas", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "10", "room_id": "702", "hour": "09", "candidate": "699", "title": "Android: Não faça um bom aplicativo, faça um ótimo aplicativo!", "date": "2011-07-02", "abstract": "O que faz a diferença entre um bom aplicativo e um ótimo aplicativo Android? Agora que você já sabe escrever o código, este workshop lhe mostrará as Melhores Práticas que você deve adotar para assegurar-se de que seu aplicativo fornece uma experiência agradável para o usuário, o que inclui: ser ágil, ter uma aparência profissional e funcionar bem tanto em modo retrato como paisagem, e em diferentes tamanhos de tela.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "4", "room_id": "701", "hour": "15", "candidate": "947", "title": "Oficina YAD - Yet Another Display", "date": "2011-06-30", "abstract": "Oficina YAD - Yet Another Display", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "4", "room_id": "6", "hour": "13", "candidate": "264", "title": "Desenvolvimento aberto e métodos ágeis num ambiente coporativo: o caso Noosfero.", "date": "2011-06-29", "abstract": "Desenvolvimento aberto de software livre, usando métodos ágeis num ambiente corporativo? Sim, tinha tudo para dar errado, mas não deu... Esta apresentação tem o objetivo de discutir a aplicação prática de métodos ágeis juntamente com o método aberto (“bazar”) de desenvolvimento colaborativo de software livre, numa empresa de soluções web. Em especial, será apresentado o caso do projeto do software livre Noosfero (http://noosfero.org/), ligado à Colivre.  ", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "2", "hour": "12", "candidate": "512", "title": "Contribuir e coçar é só começar", "date": "2011-06-30", "abstract": "No Brasil existem muitos entusiastas e defensores de software livre, mas muito poucos contribuidores, especialmente quando falamos de desenvolvedores. A barreira de entrada para contribuir com software livre pode ser grande para quem não está acostumado com a cultura e a tecnologia dos projetos.\r\n\r\nA palestra visa mostrar o caminho e afastar o medo de contribuir com software, focando no projeto GNOME. Quem já contribui é bem vindo para discutir como facilitar a entrada de novos desenvolvedores.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "1", "room_id": "5", "hour": "11", "candidate": "859", "title": "Mais resultado com menos código: Aplicações Java com Demoiselle 2", "date": "2011-07-01", "abstract": "A palestra irá apresentar a versão 2 do framework Java open source Demoiselle, baseada em JEE6.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "7", "room_id": "2", "hour": "14", "candidate": "280", "title": "Desenvolvimento livre para o Kinect", "date": "2011-07-02", "abstract": "O Kinect chegou conheça as particularidades do desenvolvimento desse hardware que promete revolucionar o futuro dos games e ser a próxima febre entre usuários e desenvolvedores e veja como desenvolver aplicações para o Kinect com a libfreenect o módulo (driver) e também o uso do módulo SensorKinect os dois livres, e também conheça a API OpenNI o framework livre para você desenvolver aplicações com interação natural do usuário com reconhecimento de esqueleto, gestos de mãos e \"analisador de cena\"", "level": "intermediate", "minute": "00", "zone_id": "4"}, {"area_id": "14", "room_id": "6", "hour": "14", "candidate": "831", "title": "Compromisso com a liberdade dos dados na rede estadual de ensino do Rio Grande ", "date": "2011-07-02", "abstract": "Retrospectiva do uso de TI na rede Estadual de Educação prospectando escolhas para próximos anos.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "2", "hour": "09", "candidate": "428", "title": "Empreendedorismo ágil - Surge uma nova geração ", "date": "2011-07-02", "abstract": "A cada dia é mais nítido como a nova geração adquire conhecimento e põe em prática de uma forma mais acelerada que as gerações anteriores, empreender tornou-se parte do cotidiano dos jovens recém formados ou até antes de uma formação. Com a facilidade de absorver conhecimento e sem medo de colocar as ideias em prática, a cada dia a juventude acima da média conquista o mercado e tornam poderosos.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "1", "room_id": "2", "hour": "17", "candidate": "925", "title": "Java 7 - criado como software livre, suportando software livre", "date": "2011-07-02", "abstract": "A nova versão da plataforma Java que estará disponível em breve foi construída em um projeto de software livre(o OpenJDK) e traz suporte para diversas linguagens livres. Essa palestra irá mostrar o projeto Java 7, o OpenJDK, e discutir como a nova versão da Máquina Virtual Java poderá colaborar com as diversas comunidades software livre. A palestra irá também apresentar como o padrão Java está evoluindo no JCP", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "8", "room_id": "6", "hour": "17", "candidate": "438", "title": "Turbinando o LibreOffice com extensões", "date": "2011-07-01", "abstract": "Desde suas origens como OpenOffice.org, o LibreOffice apresenta um diferencial importante quanto à ampliação das suas funcionalidades. Através da instalação de extensões, podemos personalizar o LibreOffice com recursos adicionais, tornando-o ainda mais poderoso. Nesta apresentação, conheceremos os conceitos mais importantes sobre a criação e o gerenciamento de extensões no LibreOffice, contemplando informações essenciais tanto para projetos corporativos quanto para o uso individual.", "level": "intermediate", "minute": "00", "zone_id": "4"}, {"area_id": "15", "room_id": "2", "hour": "14", "candidate": "283", "title": "Hashtags não derrubam governos", "date": "2011-07-01", "abstract": "Esta palestra irá demonstrar a nova descoberta e análise da internet e das mídias sociais por governos e corporações. Acreditar que a internet por si só fortalece a democracia é uma ideia extremamente simplória. Governos começam a perceber que simplesmente censurar a internet nem sempre é uma boa idéia, e por esse motivo estão usando formas mais sutis para silenciar vozes dissidentes. Alterar a neutralidade da rede, é muito melhor do que tentar silencia-la.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "9", "room_id": "5", "hour": "17", "candidate": "380", "title": "Debian 6: Instalação e Hardening", "date": "2011-07-01", "abstract": "Nesta palestra será apresentado um passo-a-passo da instalação do Debian 6, incluindo a realização de particionamento. Também iremos visualizar quais os procedimentos necessários para fazer hardening no sistema, ou seja, deixá-lo menos vulnerável aos ataques mais comuns à sistemas Linux.", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "12", "room_id": "2", "hour": "09", "candidate": "21", "title": "Forense Computacional com Software Livre", "date": "2011-06-30", "abstract": "A palestra englobará os conceitos iniciais de forense computacional para a realização de análises tanto de memória secundária, quanto memória física e tráfego de rede. Os procedimentos necessários para a realização de uma investigação forense, também serão explicados.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "2", "hour": "10", "candidate": "860", "title": "Ensemble: o novo sistema de configuração e deployment do Ubuntu", "date": "2011-07-02", "abstract": "Ensemble é o novo sistema de configuração e deployment de software do Ubuntu, criado pela Canonical. O Ensemble permite que várias máquinas sejam inicializadas e configuradas com interação mínima por parte do usuário. Nessa palestra o lider técnico do projeto, Gustavo Niemeyer, apresentará porque ele foi criado e como funciona.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "3", "room_id": "6", "hour": "12", "candidate": "503", "title": "JRuby - Produtividade e Performance na JVM", "date": "2011-06-29", "abstract": "Curioso para experimentar Ruby? Preocupado com o deploy? Está preso à um container Java? Precisa fazer deploy em máquinas windows?\r\nEssa palestra tem por objetivo apresentar o projeto JRuby por dentro, e mostrar como é possível ter ganhos reais de produtividade misturando linguagens sobre a JVM.", "level": "advanced", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "8", "hour": "12", "candidate": "802", "title": "Wikipedia and the future of collaboration", "date": "2011-06-30", "abstract": "Jessie Wild, gestora de projetos especiais no departamento de Desenvolvimento Global da Wikimedia, falará sobre o futuro da colaboração na Wikipedia e em outros projeto da Wikimedia.\r\n\r\n\r\n                                                      \r\n                                                                                                                                                                                                          ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "16", "room_id": "5", "hour": "13", "candidate": "889", "title": "Desafios e Oportunidades para as Lanhouses - Pesquisa TIC Lanhouses 2010 ", "date": "2011-07-01", "abstract": "Os principais desafios e oportunidades para o futuro das Lanhouses no país, à luz da Pesquisa TIC Lanhouses 2010 do CGI.br.\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "9", "room_id": "5", "hour": "15", "candidate": "260", "title": "Real Time Linux: O que você precisa saber", "date": "2011-06-29", "abstract": "Sistemas de tempo real estão por toda parte e apesar do Linux não ser um sistema operacional de tempo real nativo é possível transformar o Linux em um sistema capaz de atender as requisitos temporais comuns em sistemas de tempo real. Esta apresentação tem como foco mostrar as features de tempo real do kernel do Linux, quais as opções de Linux em tempo real e quem precisa de Linux em tempo real, com foco tanto em desenvolvimento de aplicações/kernel quanto administradores de sistemas.", "level": "advanced", "minute": "00", "zone_id": "3"}, {"area_id": "14", "room_id": "8", "hour": "16", "candidate": "782", "title": "Project Cauã: Warp Factor Ten!", "date": "2011-06-30", "abstract": "Five years ago maddog conceived of an idea to create jobs,\r\nreduce the use of electricity, make computers easier to use, create a\r\ngratis wireless bubble across cities and provide low cost super-computer\r\npower.  Two years ago he was joined by Douglas Conrad of OpenS to\r\nformulate Project Cauã.  This year Project Cauã is launched, and at FISL\r\nyou will see its path and be able to participate in its future.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "10", "room_id": "3", "hour": "17", "candidate": "582", "title": "Automação residencial de baixo custo com open source hardware", "date": "2011-07-02", "abstract": "A popularização das tecnologias com hardware aberto(open source hardware) influenciou na criação de frameworks que tornam simples a prototipação de projetos microcontrolados. Paralelamente, a automação residencial vem ganhando importância, apesar de não ser uma área nova no mercado. Adicionalmente, os produtos para automação residencial possuem custo elevado. Este artigo mostra a utilização de plataformas de prototipagem para criação de projetos para automação residencial.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "15", "room_id": "8", "hour": "14", "candidate": "800", "title": "10 years of Wikipedia", "date": "2011-06-29", "abstract": "Barry Newsted, chefe do departamento Desenvolvimento Global da Wikimedia, falará sobre os 10 anos da Wikipedia.\r\n\r\n                                                      \r\n                                                                                                                                                                                                                                                                              ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "13", "room_id": "5", "hour": "13", "candidate": "504", "title": "Integrando Bases de Dados Com Software Livre", "date": "2011-07-02", "abstract": "A integração de dados é um aspecto vivenciado rotineiramente nos ambientes de TI. Seja em projetos de Data Warehousing ou migração de sistemas. Neste ponto podem ser utilizadas rotinas SQL direto nos bancos de dados como triggers e procedures ou a automatização do processo por intermedio de alguma ferramenta. Neste caso a proposta desta palestra concentra-se em uma explanação geral sobre o processo e arquiteturas de integração de dados e análise do uso das ferramentas livres Kettle e Talend.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "23", "room_id": "2", "hour": "09", "candidate": "732", "title": "Metasys MeeGo 1.2 - Nova geração de distribuição educacional Linux para Tablets", "date": "2011-06-29", "abstract": "In this session we will show the development process of a MeeGo based distribution, focusing on the development of Metasys MeeGo for tablets. Metasys MeeGo is an operating system created to support the Intel-powered classmate PC hardware architecture and didactic requirements for classroom educational process, but with the next generation of MeeGo products and User Experience being delivered, the requirements and challenges have changed.", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "11", "room_id": "2", "hour": "12", "candidate": "473", "title": "Automação e Gerenciamento de Servidores com puppet", "date": "2011-07-02", "abstract": "A palestra se propõe a apresentar séries de tarefas e configurações penosas na administração de servidores Linux que podem ser automatizadas e centralizadas com o objetivo de auxiliar os administradores de sistemas a terem um controle total de sua infraestrutura.", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "12", "room_id": "6", "hour": "17", "candidate": "189", "title": "Hardening Linux Servers", "date": "2011-06-30", "abstract": "A segurança continua no topo da lista de coisas que mais preocupam os administradores de redes e sistemas. No entanto, as ações mais comuns em termos de segurança ainda são apenas habilitar uma ferramenta de firewall. No mundo real isto não é suficiente. Esta apresentação vai mostrar como reforçar a estrutura do sistema operacional com as melhores práticas de segurança.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "13", "room_id": "4", "hour": "17", "candidate": "341", "title": "Backup com software livre", "date": "2011-07-01", "abstract": "De todas as tarefas de um administrador de redes o backup dos dados é, com certeza, a mais importante e a menos interessante. A saída é utilizar os processos mais automatizados e confiáveis que estiverem ao alcance da capacidade de investimento da empresa. O mercado Open Source oferece ferramentas excelentes para esta necessidade, como será mostrado nesta apresentação.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "7", "room_id": "3", "hour": "16", "candidate": "36", "title": "Blender 3D para quem nunca viu Blender 3D", "date": "2011-07-02", "abstract": "Para quem apenas ouviu falar, nunca usou ou achou estranho o bastante para não tentar se aventurar no mundo 3D, essa palestra mostrará as possibilidades desse extraordinário software de modelagem e animação 3D. A maior prova de sua potencialidade é o fato de que já é encarado pela indústria como um software profissional. Mas você pode comprovar se isso é verdade ou não!", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "13", "room_id": "2", "hour": "12", "candidate": "929", "title": "Redis e as facilidades de trabalhar com um banco de dados NoSQL", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "12", "room_id": "6", "hour": "16", "candidate": "522", "title": "Shellcodes. O que são, Pra que servem e Como fazer", "date": "2011-07-02", "abstract": "A palestra irá demostrar no contexto da segurança da informação, o que são os shellcodes de maneira conceitual. Em seguida irá demostrar de maneira prática a que se destinam, finalizando com a construção de um shellcode utilizando algumas ferramentas GNU.", "level": "advanced", "minute": "00", "zone_id": "3"}, {"area_id": "2", "room_id": "6", "hour": "13", "candidate": "272", "title": "Meta Python - magia negra na prática", "date": "2011-07-02", "abstract": "A linguagem de programação Python permite a modificação de vários comportamentos  durante a eceução de um programa.  Ao entender o que é disponibilizado para o programador, podemos modificar alguns comportamentos que pensamos cristalizados, mas se tratam apenas de senso comum. Dentre os exemplos abordados, com mecanismos suscintos temos: métodos e atributos privados, lazy execution, programação orientada a aspectos dentre outros.", "level": "advanced", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "3", "hour": "11", "candidate": "500", "title": "Javascript - Muito mais Orientado a Objetos do que você imagina", "date": "2011-07-02", "abstract": "Conhece Javascript? Será que conhece mesmo? Você sabia que Javascript é uma linguagem Orientada a Objetos, apesar de não ter classes, modificadores de acesso (public, protected, private)? Quer aprender um pouco de Orientação a Objetos caso não saiba? Então essa palestra é pra você.\r\n\r\nNessa palestra falarei sobre Orientação a Objetos e como Javascript consegue ser tão Orientada a Objeto quanto diversas linguagens famosas.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "9", "room_id": "8", "hour": "11", "candidate": "832", "title": "Canonical Keynote: Ubuntu Today and Tomorrow", "date": "2011-06-29", "abstract": "Jon Melamut, VP, Product and Operations, OEM Services for Canonical, leads the worldwide field engineering, business development and product management and marketing teams responsible for working with ODMs, OEMs, Operators and other commercial organizations that want to bring mobile computing devices, new computing platforms, and servers to the market pre-installed with Ubuntu, the world's leading Linux client OS and emerging leader in cloud computing.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "15", "room_id": "2", "hour": "13", "candidate": "382", "title": "Neutralidade de Rede, Inovação e Direitos do Consumidor em tempos do PNBL", "date": "2011-06-30", "abstract": "O objetivo dessa mesa será inicialmente traçar um panorama da atual discussão teórica, política e prática sobre o tema da neutralidade de rede e, em seguida, contextualizá-la com atuais políticas de Internet brasileiras. O princípio da neutralidade será então abordado sob os enfoques da inovação tecnológica, dos direitos do consumidor e da concorrência.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "20", "room_id": "8", "hour": "16", "candidate": "708", "title": "Abertura", "date": "2011-06-29", "abstract": "a", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "21", "room_id": "8", "hour": "16", "candidate": "741", "title": "The villagetelco / mesh-potato project", "date": "2011-07-01", "abstract": "The villagetelco / mesh-potato project - a DIY toolkit aimed at the developing world to build your own telcoBased on open hardware and open software, the villagetelco / mesh-potato project has developed a system which empowers people to set up their own telco, using the 2.4 GHz WiFi spectrum and based on multipoint-to-multipoint mesh networking. The Mesh-Potato is wheatherproofed, low-power WiFi mesh device, which features a telephone port and a Ethernet port. You can simply plug in a analog te\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "15", "room_id": "3", "hour": "17", "candidate": "315", "title": "Mesa redonda: Software livre sob o olhar das ciências humanas", "date": "2011-07-01", "abstract": "A mesa reunirá pesquisadores, do Brasil e do exterior, que apresentarão os tópicos principais e achados de suas pesquisas sobre o software livre e sua comunidade mundial. Desde a criação do Linux, no início da década de 1990, a comunidade software livre vem crescendo vigorosamente e as ciências humanas tem procurado acompanhar esse fenômeno que envolve, ao mesmo tempo, cultura, ciência, trabalho, política e produção de tecnologia", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "2", "hour": "16", "candidate": "372", "title": "O futuro do Marco Civil da Internet em debate", "date": "2011-07-01", "abstract": "O Marco Civil da Internet, proposta de legislação que visa estabelecer os direitos e deveres relativos ao uso da internet no Brasil, passou durante os anos de 2009 e 2010 por duas amplas fases de consulta pública online. Foram mais de 1900 contribuições. Esta mesa apresentará o atual estágio de tramitação do Marco Civil e discutirá as razões e desafios políticos para aprová-lo.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "8", "hour": "11", "candidate": "753", "title": "Firefox, Modern Browsers, and the Web:  Where things are going next.", "date": "2011-06-30", "abstract": "An update on the spread of Firefox 4, Adoption of HTML5 on the web,\r\nMozilla's new faster release cycles, and what new features are on the\r\nhorizon.\r\n I'll also talk about the how developers and other participants from\r\nacross\r\nBrasil  are getting invovled in Mozilla, and how you can too.\r\n\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "3", "hour": "09", "candidate": "580", "title": "As Certificações e sua importância na carreira e no mercado de trabalho.", "date": "2011-07-01", "abstract": "Iremos falar o que são as certificações e como elas afetam a carreira do profissional, mostrar como as empresas vêem o profissional certificado e como elas interagem com as graduações. Desde a escolha de como começar a como dar continuidade as certificações.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "5", "hour": "17", "candidate": "550", "title": "LibVirt, o canivete suíço da virtualização", "date": "2011-06-29", "abstract": "A palestra irá mostrar um apanhado geral da LibVirt, mostrando suas principais funcionalidades e possibilidades de funcionamento. Será mostrado também alguns exemplos de cógido fonte de interação com a LibVirt.\r\n\r\nTópicos:\r\nUm papo sobre virtualização\r\nLib...”o que”?\r\nComo funciona\r\nPorque devo usar?\r\nQuem usa?\r\nComo usar?\r\nExemplos de código...\r\nConclusãoUm papo sobre virtualização\r\nLib...”o que”?\r\nComo funciona\r\nPorque devo usar?\r\nQuem usa?\r\nComo usar?\r\nExemplos de código...\r\nConclusão", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "4", "room_id": "3", "hour": "14", "candidate": "501", "title": "TDD do meu jeito", "date": "2011-07-02", "abstract": "Desenvolver software de qualidade e fácil de manter é uma tarefa difícil. E é por este e outros motivos que o Desenvolvimento Guiado por Testes (TDD) vem sendo tão difundido nos últimos anos. Se você quer saber o que é, enteder o porquê de adotar e saber como funciona a prática do TDD, o conteúdo dessa palestra pode ajudá-lo.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "2", "hour": "13", "candidate": "842", "title": "Arte livre, scripts e outros 1001 algoritmos", "date": "2011-07-01", "abstract": "O Inkscape e a construção de extensões em Python; uma breve descrição\r\ndo formato SVG e a nova API Canvas do HTML5, com uma demonstração de\r\nferramenta de conversão entre os formatos. Além disso, códigos e\r\nprojetos malucos em Javascript, e outros 1001 algoritmos para\r\nimplementar antes de morrer. Participe!", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "16", "room_id": "6", "hour": "17", "candidate": "96", "title": "Poli-Libras, um tradutor de português para LIBRAS", "date": "2011-06-29", "abstract": "O projeto Poli-Libras pretende criar um sistema de tradução automática que converta um texto em português para uma sequência de sinais em LIBRAS, língua de sinais utilizada como forma de comunicação pelos surdos. A tradução considera sintaxe e semântica, utiliza uma ferramenta colaborativa para o cadastro de sinais e um avatar 3D animado para representá-los. Assim sendo, espera-se melhorar o acesso a informação por parte dos surdos e abrir novas possibilidades para o ensino de LIBRAS.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "16", "room_id": "6", "hour": "15", "candidate": "597", "title": "8º Debate Inclusão Digital e Software Livre", "date": "2011-06-29", "abstract": "Debate realizado no FISL desde 2004. Em 2011 será exposto/debatido as ações de ID coordenadas pelo Gov. Federal. A criação da nova Secretaria de ID, vinculada ao MC, e a execução do Programa Telecentros.BR. Equipamentos, conexão, formação e pagamento de bolsitas (monitores/gestores que atuam localmente nos telecentros). Será convidada a Secretária Lygia Puppato e representantes de outros órgãos. Sobre a Rede Nacional de Formação, contaremos com a participação dos Polos (nacional e regionais).", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "1", "room_id": "3", "hour": "15", "candidate": "434", "title": "Android x Java ME: Oque é possível com a nova plataforma?", "date": "2011-07-01", "abstract": "A programação para pequenos dispositivos iniciou-se com a plataforma Java ME, no tempo onde os telefones celulares reinavam absolutos. Porém, nos últimos anos grandes mudanças aconteceram. Uma delas foi o surgimento e consolidação dos smartphones. Como consequência, Java ME também perdeu espaço, principalmente para a tríade BlackBerry, iOS e Android. A principal delas, o Android, também usa a linguagem Java. Logo, oque podemos programar nesta plataforma que era impossível ou difícil, com JavaME?", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "5", "hour": "12", "candidate": "575", "title": "Gerenciando Projetos com dotProject: Finanças e Design", "date": "2011-06-30", "abstract": "O software livre de gerenciamento de projetos dotProject continua evoluindo. O propósito desta apresentação é fazer um resumo sobre o sistema e mostrar duas novas funcionalidades do sistema: Controle de Finança e Designer de Projetos. Para concluir, serão apresentados os resultados de uma pesquisa sobre a utilização do dotProject conduzida na comunidade brasileira da ferramenta.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "8", "hour": "10", "candidate": "757", "title": "Fedora Project: How Linux Distributions Help Upstream Communities", "date": "2011-06-30", "abstract": "Jared Smith will discuss Linux distributions, why they're important, and how they benefit upstream communities.  He'll also talk about the Fedora Project, and how it's model for pushing changes upstream is sustainable over the long term.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "17", "room_id": "6", "hour": "12", "candidate": "485", "title": "HTML5 e CSS3 com Javascript, reconquistando a web!", "date": "2011-06-30", "abstract": "O desenvolvimento web tem evoluido muito, muito rapidamente, tal qual a forma em que os desenvolvedores e as empresas veem a web.\r\nVeremos então, as nóvas técnicas, as novas possibilidades e formas de integração entre estras 3 linguagens abordando bastante código e exemplos de forma divertida.", "level": "starter", "minute": "00", "zone_id": "6"}, {"area_id": "9", "room_id": "4", "hour": "12", "candidate": "176", "title": "A crash course on crash - The Kernel crash analysis utility", "date": "2011-07-02", "abstract": "Guide the audience demonstrating, through slides and practical examples how to use the 'crash' utility in the post-mortem analysis of common kernel panics in Intel based systems. During the session it will be presented how to prepare and utilize a Fedora system to perform the proposed task.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "23", "room_id": "2", "hour": "13", "candidate": "734", "title": "vPro & Meego: Creating bridges from netbook to Cloud Administration", "date": "2011-06-29", "abstract": "vPro & Meego: Creating bridges from netbook to Cloud Administration\r\n\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "20", "room_id": "8", "hour": "18", "candidate": "841", "title": "Encerramento", "date": "2011-07-02", "abstract": ".", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "7", "room_id": "6", "hour": "14", "candidate": "533", "title": "Guitarra para Frets on Fire com Arduino: “Guitar Hero” 100% livre", "date": "2011-06-30", "abstract": "Apresentação de implementação de guitarra desenvolvida usando Arduino para jogar \"Frets on Fire\" (\"Guitar Hero\" livre), frequentemente jogado apenas com teclado do computador. O objetivo desta guitarra livre é tornar o jogo ainda mais divertido, oferecendo uma nova opção aos amantes deste tipo de jogo, que também gostam de eletrônica.", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "17", "room_id": "2", "hour": "16", "candidate": "112", "title": "Android: uma catedral de sucesso", "date": "2011-07-02", "abstract": "A palestra fará um histórico sobre os sistemas móveis baseados em Linux mais relevantes que já apareceram (incluindo o MeeGo e o abandono da Nokia) e irá contrastá-los com o único que conseguiu obter sucesso de público: o Android. Também será levantada a polêmica sobre a abertura do sistema, baseando-se no famoso texto \"A catedral e o bazar\" de Eric Raymond para tentar entender como funciona o modelo adotado pela Google.", "level": "starter", "minute": "00", "zone_id": "6"}, {"area_id": "11", "room_id": "2", "hour": "14", "candidate": "598", "title": "Além dos usuários e grupos: controle de acesso centralizado com OpenLDAP", "date": "2011-06-29", "abstract": "Serviços de diretório ainda podem provocar caretas quando diferentes administradores de redes e sistemas conversam sobre soluções para seus ambientes e não é surpresa para ninguém perceber a relação de amor e ódio que tais ferramentas despertam.\r\n\r\nO objetivo da palestra é mostrar que pode-se armazenar mais do que usuários e grupos num diretório OpenLDAP. É possível armazenar dados de controle de acesso a diferentes serviços como: wiki (MoinMoin), sudo (sudo-ldap), proxy e SSH.", "level": "advanced", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "8", "hour": "14", "candidate": "768", "title": "Oracle GlassFish Server, a flexible, lightweight and production-ready Java EE 6", "date": "2011-06-30", "abstract": "Oracle GlassFish Server, a flexible, lightweight and \r\n> production-ready Java EE 6 platform", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "17", "room_id": "2", "hour": "13", "candidate": "671", "title": "Um cenário das tecnologias \"touch\" com ênfase naquelas desenvolvidas no Brasil", "date": "2011-07-02", "abstract": "O objetivo desta apresentação é descrever um cenário acerca das\r\ntecnologias utilizadas em dispositivos com telas sensíveis ao toque.\r\nUm apanhado geral sobre todos os tipos de dispositivos será\r\nrelatado, com uma ênfase em dispositivos cujas patentes têm origem\r\nno Brasil", "level": "advanced", "minute": "00", "zone_id": "6"}, {"area_id": "18", "room_id": "714", "hour": "11", "candidate": "440", "title": "Encontro comunitário polo regional sul Telecentros.BR", "date": "2011-07-01", "abstract": "O Encontro Comunitário Polo Regional Sul dos Telecentros.BR destina-se a reunir os Monitores, Tutores e equipe de coordenação de todo o polo (Rio Grande do Sul, Paraná e Santa Catarina) bem como a equipe do Polo Nacional (a coordenação nacional do Telecentros.BR).", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "11", "room_id": "8", "hour": "11", "candidate": "783", "title": "Zabbix API and related tools", "date": "2011-07-02", "abstract": "From Zabbix 1.8 onward, Zabbix API is supported. Zabbix API enables you to get information, create and/or delete hosts, items, graphs, users and so on. In this presentation, I explain the API inside-out, introducing related libraries and tools. I explain how to use the API with hands-on examples, and describe the future of the API based on the Zabbix roadmap.\r\n", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "3", "room_id": "2", "hour": "17", "candidate": "395", "title": "Desenvolvendo extensões para Mozilla Firefox", "date": "2011-06-29", "abstract": "Palestra introdutória sobre desenvolvimento extensões no navegador de internet Mozilla Firefox. Serão abordados os seguintes tópicos: História, motivação, arquitetura do kit de desevolvimento, ambiente de desenvolvimento, exemplos práticos e o futuro.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "8", "hour": "14", "candidate": "794", "title": "Freeing Fonts For Fun and Profit", "date": "2011-07-02", "abstract": "Libre Fonts are a \"missing piece\" of libre software. Dave\r\nCrossland has been working for 5 years to understand how to design\r\nhigh quality typefaces - and how to earn money with libre fonts! Today\r\nhe is providing consultancy for Google on their Web Fonts project,\r\nwhich is publishing hundreds of libre fonts for use on the web. Dave\r\nalso runs collaborative workshops on typeface design.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "1", "room_id": "2", "hour": "11", "candidate": "175", "title": "Introdução ao desenvolvimento web com Java utilizando frameworks", "date": "2011-07-02", "abstract": "Palestra expositiva sobre as tecnologias java disponíveis para desenvolvimento web. Últimas novidades, como Servlet 3 e JSF 2.0, e utilização de frameworks diversos, com exposição de código, comparação entre tecnologias e testes de desempenho, bem como técnicas de programação web e padrões de projeto para este tipo de desenvolvimento.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "23", "room_id": "2", "hour": "15", "candidate": "731", "title": "Qt Quick 2.0", "date": "2011-06-29", "abstract": "QML is a great piece of technology and will play even a more central role as part of the future of Qt [1].\r\nQML2 is baking with some new cool features, focusing on improving hardware integration, as part of SceneGraph, the new canvas optimized for rendering through OpenGL (ES). The major objective of SceneGraph, which is also targeted at Qt5, is to get the maximum performance out of the hardware accelerated platforms, like games do.\r\n\r\nAltough the majority of the QML language in this next major re", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "4", "room_id": "2", "hour": "15", "candidate": "897", "title": "A experiência da Dataprev no monitoramento com Zabbix", "date": "2011-06-30", "abstract": "Na Dataprev, Empresa de Tecnologia e Informações da Previdência Social, são usados vários softwares para monitoramento de ativos e serviços, tanto proprietários quanto livres. No último ano consolidou a tendência na aplicação do Zabbix como software livre para monitoramento na empresa. Esta palestra apresenta a experiência da Dataprev no monitoramento usando o Zabbix.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "4", "hour": "15", "candidate": "811", "title": "App Circus Show", "date": "2011-07-01", "abstract": "App Circus", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "18", "room_id": "714", "hour": "11", "candidate": "352", "title": "As Mulheres, a TI e o SL", "date": "2011-06-29", "abstract": "Atualmente a Mulher vem conquistando o seu espaço nas mais diversas áreas do mercado de Trabalho. Com a Computação e a Tecnologia da Informação não é diferente. As GarotasCPBr é uma comunidade que reúne Mulheres que trabalham de forma direta ou indireta com a TI. Devido a isto, em todo evento que participamos, desenvolvemos uma Mesa Redonda que discute com os presentes sobre o papel e a contribuição da Mulher na área de TI e desta vez no FISL, discutiremos também sobre isto na área do SL.", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "13", "room_id": "11", "hour": "17", "candidate": "478", "title": "Backup 101: Planejamento & Ferramentas", "date": "2011-07-02", "abstract": "Esta palestra visa abordar as diversas ferramentas livres existentes para implementação de estratégias de backup, abordando os seguintes tópicos: - Backup em mídias - Clonagem de sistemas - Estratégias gerais para backup - Ferramentas básicas para backup - RAID no Linux - Recuperação de dados - Sistemas de arquivos - Sistemas de backup avançados - Sistemas de backup para desktop", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "16", "room_id": "11", "hour": "12", "candidate": "661", "title": "Softwares livres para educação", "date": "2011-06-30", "abstract": "Hoje o computador é uma das principais formas de aquisição de conhecimento e as escolas/universidades o estão adotando desde a educação infantil até nos cursos de pós-graduação. Para tal tarefa de ensino, são necessários programas bastante específicos (por exemplo software para ensino de frações). Nessa palestra será apresentado alguns softwares para estes propósitos e como interagir com comunidades para propor novas ideias/soluções.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "21", "room_id": "11", "hour": "09", "candidate": "686", "title": "Abertura Encontro Redes Livres", "date": "2011-07-01", "abstract": "REdes", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "14", "room_id": "11", "hour": "10", "candidate": "299", "title": "Dá pra ganhar dinheiro com Software Livre? Sim", "date": "2011-07-02", "abstract": "Esta palestra têm por objetivo reunir profissionais, empresários e interessados para debater modelos de negócios com Software Livre. Serão apresentados conceitos sobre o tema e então os componentes da mesa irão expor suas experiências na área, enfim, será debatido como ganhar dinheiro sobre o modelo e sistemas OpenSource.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "16", "room_id": "11", "hour": "14", "candidate": "298", "title": "Akcio CIPS: innovating learning through participation", "date": "2011-06-29", "abstract": "A Community Information and Participation System (CIPS) is a computer-mediated communication system that allows members of a community -for example, citizens of a certain region or state- to interact with information that affect them in a way that is creative, respectful of their privacy and without intermediaries. As such it has potential applications in the fields of on-line collaborative learning, web collaboration (COPs - communities of practice) and e-government.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "12", "room_id": "11", "hour": "13", "candidate": "927", "title": "Buffer Overflow", "date": "2011-06-29", "abstract": "A palestra tem o intuito de mostrar a platéia como ocorre o buffer overflow, como se chega ao ponto de troca de fluxo de memória e o que ocorre nos registratores dos porcessadores e no software que está funcionando, como é injetado o payload em uma aplicação sucetível à buffer overflow", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "21", "room_id": "11", "hour": "10", "candidate": "134", "title": "10 años armando una Red Libre en Buenos Aires.", "date": "2011-07-01", "abstract": "Es posible hacer una red libre civil autogestionanda? Sí, tenemos casi 10 años intentándolo y nos ha dejado mucha experiencia, éxitos y fracasos. Nuestro wiki es un ejemplo de construcción colectiva que ha inspirado la creación de nuevas redes. Actualmente estamos trabajando en conjunto con otras redes de Latinoamérica.", "level": "starter", "minute": "00", "zone_id": "1"}, {"area_id": "14", "room_id": "11", "hour": "10", "candidate": "854", "title": "Correio Livre CAIXA", "date": "2011-06-30", "abstract": "Processo de migração de ferramenta de correio eletrônico proprietária MS para Expresso Livre.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "11", "hour": "16", "candidate": "939", "title": "Visão panorâmica do Software Livre no Banrisul", "date": "2011-06-29", "abstract": " Esta palestra aborda a trajetória do Software Livre no Banrisul e  propõe-se a responder as seguintes questões: onze anos após os  primeiros ensaios sobre a utilização do SL em ATMs, qual é a situação  do SL no Banrisul? Quais projetos envolvendo SL devem ser implementados nos próximos meses no Banrisul?", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "16", "room_id": "11", "hour": "12", "candidate": "116", "title": "Inclusão Digital e Social na Amazônia - Superando desafios com Software Livre", "date": "2011-07-02", "abstract": "A Amazônia é um território grande, bonito e complexo. Sua grandeza e beleza encantam qualquer visitante, mas dificultam e muito a prestação de serviços e a implantação de políticas públicas no território.\r\nPara superar este desafio e encurtar as distâncias entre a sociedade e o governo e suas políticas o Governo lançou 2007 o Programa de Inclusão Sócio-Digital NAVEGAPARÁ, composto por 3 ações estruturantes e 1 projeto de Cidadania para Inclusão Digital baseado em Software Livre.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "3", "room_id": "11", "hour": "16", "candidate": "237", "title": "Desenvolvendo aplicações Mobile com HTML, CSS e JavaScript", "date": "2011-07-02", "abstract": "Apresentar frameworks open source e técnicas que possibilitam o desenvolvimento de aplicações para celulares e tables rodando Symbian, Android ou iOS.\r\nComo fazer as aplicações parecerem nativas, e quais recursos estão disponíveis para aplicações escritas com HTML, CSS e Javascript em dispositivos móveis.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "21", "room_id": "11", "hour": "11", "candidate": "265", "title": "Redes Libres en Uruguay", "date": "2011-07-01", "abstract": "Nivelación de conceptos.\r\nIntroducción a Redes Libres. ¿Qué son?\r\nPresentación del proyecto MontevideoLibre.\r\nRecorrida histórica del proyecto.\r\nOtras Redes Libres en Uruguay\r\nComparación Redes Libres y Software Libre\r\nConclusiones.\r\nInvitación a participar en la creación, uso y extensión de las redes libres.", "level": "starter", "minute": "00", "zone_id": "1"}, {"area_id": "14", "room_id": "11", "hour": "09", "candidate": "895", "title": "Experiência da Univates na utilização do Ubuntu Server e do Landscape Dedicated", "date": "2011-07-02", "abstract": "Apresentação da experiência da Univates na utilização do Ubuntu Server e do Landscape Dedicated Server. Será mostrado o processo de escolha, implementação e atualização/manutenção do parque de servidores instalados na Instituição.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "11", "hour": "15", "candidate": "916", "title": " O Papel do software livre na nova solução de extrato Banrisul. ", "date": "2011-07-02", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "2", "room_id": "11", "hour": "11", "candidate": "668", "title": "Python para cursos de Ciência da Computação", "date": "2011-06-30", "abstract": "Python é uma linguagem livre, que se caracteriza pela sintaxe simples, legibilidade do código e grande quantidade de módulos para os mais diversos fins. Um dos pontos fortes da linguagem é a extensa coleção de bibliotecas disponíveis para os mais diversos fins. Apresentaremos um conjunto de ferramentas e bibliotecas que podem ser utilizadas em um curso de Ciência da Computação como forma de apoio e aplicação dos conceitos das disciplinas.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "11", "hour": "17", "candidate": "531", "title": "Automação residencial com Android e Arduino", "date": "2011-06-30", "abstract": "Que tal utilizar toda tecnologia disponivel em seu Android como GPS, sensores e até mesmo SMS e telefonia para participar da interação que temos com nossos aparelhos eletrodomésticos? O que acha de ter sua cafeteira fazendo seu café assim que você entrar na sua garagem? Ou então ter o seu ar condicionado ligado, para que a sua casa já esteja em uma temperatura agradável antes mesmo de você abrir a porta?", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "7", "hour": "16", "candidate": "808", "title": "Mostra de Vídeos Livres", "date": "2011-06-29", "abstract": "Mostra de Vídeos Livres", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "21", "room_id": "11", "hour": "12", "candidate": "740", "title": "BogotaMesh", "date": "2011-07-01", "abstract": "Proceso de creación de una red inalambrica comunitaria y libre en la ciudad de de Bogotá, Colombia y el surgimiento de la comunidad BogotaMesh\r\nPor que trabajar con nightwing y no otro firmware libre?", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "3", "room_id": "11", "hour": "14", "candidate": "392", "title": "Comparação de Utilização do Java com Outras Linguagens e o Futuro", "date": "2011-07-02", "abstract": "Através de pesquisas em alguns sites que oferecem empregos de programadores, ou que verificam a quantidade de buscas relacionadas à uma palavra, podemos verficar como está sendo a utilização de nossa linguagem preferida, bem como estarmos preparados para o futuro.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "11", "hour": "16", "candidate": "865", "title": "O Futuro da Web: HTML5, CSS3, Web Semântica", "date": "2011-06-30", "abstract": "As linguagens base de publicação e desenvolvimento na Web entram em nova fase. Agora em maio/2011 o HTML5 teve sua Last Call e iniciou um novo estágio para implementação na indústria, conforme já aparecem nas últimas versões de todos os browsers. A palestra abordará as novas funcionalidades das novas versões do HTML5, CSS3 e Web Semântica tal como veem sendo debatidas pelo W3C.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "11", "hour": "17", "candidate": "405", "title": "O cerco à Internet - ACTA e ataques técnicos", "date": "2011-07-01", "abstract": "O ACTA é o grande projeto do G8 para perpetuar sua dominação do terceiro mundo,é um acordo que pretende sobrepujar a legislação dos países e dilacerar os direitos individuais, tudo em troca da propriedade intelectual e autoral. Para atingir seus objetivos, o \"establishment\" tem lançado mão de novas estratégias. ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "11", "hour": "13", "candidate": "917", "title": "O Software Livre e a transparência na construção do Gabinete Digital do RS", "date": "2011-07-02", "abstract": "A palestra versará sobre as decisões conceituais e tecnológicas aplicadas na construção do Gabinete Digital do Rio Grande Sul. Abordaremos a receptividade do público, as contribuições recebidas e a concepção geral que norteia o desenvolvimento colaborativo das ferramentas em software livre.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "21", "room_id": "11", "hour": "13", "candidate": "742", "title": "Caso de implementação de Redes Livres - ASL e Rede Marista", "date": "2011-07-01", "abstract": "Demontrar os passostomados para a implementação de uma rede livres em parceria entre um grupo de estudos fomentado pela ASL e dois centros sociais da Rede Marista", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "12", "room_id": "11", "hour": "16", "candidate": "581", "title": "Ataque a servidores através de cenários turn-key.", "date": "2011-07-01", "abstract": "Esta palestra vai mostrar como utilizar cenários turn-key para aprender os ataques mais comuns aos servidores de rede. Será visto como utilizar o metasploit para a invasão ao linux Pwnos, bem como diversas outras ferramentas de apoio, como o wireshark, tcpdump e nmap.", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "2", "room_id": "11", "hour": "17", "candidate": "877", "title": "O Estado do Plone", "date": "2011-06-29", "abstract": "Plone é um dos mais celebrados sistemas de gestão de conteúdo e completa em 2011 10 anos de seu primeiro release chegando a versão 4.1 e se mostra em constante evolução. Com roadmap discutido pela comunidade e traçado em direção a versão 5.0, o Plone passa, neste momento, pela sua maior transformação com a inclusão de novas tecnologias como Diazo, Dexterity e Deco.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "21", "room_id": "11", "hour": "14", "candidate": "70", "title": "Redes Libres y Educación", "date": "2011-07-01", "abstract": "Contar la experiencia que hay en nuestra ciudad sobre el uso de las redes libres en educación.- \r\nComo asi mostrar la parte técnica y filosófica de las Redes Libres llamada CasaresLibre.-\r\nParticipacion de alumnos, ex alumnos, profesores y entidades de la comunidad.-", "level": "starter", "minute": "00", "zone_id": "1"}, {"area_id": "12", "room_id": "11", "hour": "13", "candidate": "497", "title": "UltraSurf - Entendendo e bloqueando", "date": "2011-06-30", "abstract": "Mostrarei em detalhes o funcionamento da ferramenta de tunelamento mais popular da atualidade e como bloqueá-la efetivamente na sua estrutura.\r\n\r\nVeremos porque alguns administradores temem a ferramenta e porque os usuários conseguem burlar a segurança da empresa e acessar a Internet livremente sem levantar maiores suspeitas aos administradores.\r\n\r\nTambém mostrarei em detalhes como criar o seu próprio túnel de forma fácil, segura e discreta usando ferramentas nativas do Linux.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "10", "room_id": "11", "hour": "11", "candidate": "266", "title": "Robótica e Computação nas Nuvens: Unindo os dois mundos.", "date": "2011-07-02", "abstract": "Robótica e Computação na Nuvem são os dois temas cada vez mais recorrentes no mundo do desenvolvimento de soluções. Agora podem ser usados juntos para simplificar a vida das pessoas. Nessa palestra mostrarei como é possível, e viável, a qualquer desenvolvedor criar soluções completas e produtos para robótica, automação, domótica e  internet com custos baixos, usando recursos de software e hardware open-source disponíveis para todos, mas que nem sempre são usados juntos como solução.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "2", "room_id": "11", "hour": "15", "candidate": "901", "title": "Desenvolvimento de aplicações mobile com Python e Android", "date": "2011-06-29", "abstract": "Desenvolver aplicações para smartphones é muito divertido. Principalmente\r\nquando o sistema operacional é livre, como é o caso do Android. Quando\r\ndesenvolve-se para o Android, o único limite é a criatividade do\r\nprogramador. Tendo-se em mãos GPS, câmera fotográfica, acelerômetro,\r\nmicrofone, acesso a internet... tudo em um único dispositivo, é possível\r\nfazer inúmeros sistemas, como por exemplo de rastreamento, implementar jogos\r\nou até mesmo controlar outros dispositivos via bluetooth.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "16", "room_id": "11", "hour": "09", "candidate": "821", "title": "O livre na Cultura e o livre na educação", "date": "2011-06-29", "abstract": "Compreendo a música não apenas como entretenimento mas como uma forma da liberdade de expressão de ideias e sentimentos humanos. A falta de transparência na distribuição de recursos advindos da produção e o acesso intermediado por monopólios não contribuem para a diversidade musical brasileira tampouco para uma maior geração de renda dos artífices envolvidos na cadeia produtiva da música.\r\n\r\nVivemos um momento de definições do que é acesso e produção de música. ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "21", "room_id": "11", "hour": "15", "candidate": "739", "title": "Video-Transito Anillosur", "date": "2011-07-01", "abstract": "Presentación del proyecto de federación de servidores libres lorea.org y su primer nodo en América anillosur.cc Experiencia de trabajo colectivo con el canal de televisión comunitaria canal3lavictoria y otras asociaciones de la población La Victoria. https://riseup.net/video-transito-local", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "6", "room_id": "11", "hour": "15", "candidate": "918", "title": "Wiki - Base de Conhecimentos BB", "date": "2011-06-30", "abstract": "O Banco do Brasil definiu a ferramenta MediaWiki para a criação da base de seus conhecimentos. E foi além. Através do uso de extensões, o WikiBB passou a buscar informações pré-formatadas, ou seja, além de conhecimentos gerais, podemos buscar os conhecimentos necessários e estruturantes de forma direcionada. O que você quer saber da sua empresa pelos seus funcionários? O MediaWiki responde.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "7", "room_id": "702", "hour": "15", "candidate": "799", "title": "Oficina de Edição de Áudio com Software Livre", "date": "2011-06-29", "abstract": "Oficina de edição de áudio com Software Livre.\r\n\r\n\r\n\r\n                                                      \r\n                                                                                                                                                                                                                                                                              \r\n\r\n\r\n\r\n                                                      \r\n                                                   ", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "7", "room_id": "702", "hour": "09", "candidate": "803", "title": "Oficina de Edição de Áudio com Software Livre (Avançada)", "date": "2011-06-30", "abstract": "Oficina avançada de edição de áudio com software livre.\r\n\r\n\r\n\r\n                                                      \r\n                                                                                                                                                                                                                                                                              \r\n\r\n\r\n\r\n                                                      \r\n                       ", "level": "advanced", "minute": "00", "zone_id": "4"}, {"area_id": "15", "room_id": "11", "hour": "14", "candidate": "726", "title": "[Feminino Livre] Mesa Redonda : Mulheres de TI: perspectivas de futuro", "date": "2011-06-30", "abstract": "Discutir aspectos comportamentais e políticos para analisar os cenários que as mulheres contribuem no mercado de trabalho e tecnológico.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "11", "hour": "09", "candidate": "558", "title": "Snep PBX: Telefonia IP do Jeito Certo", "date": "2011-06-30", "abstract": "O Asterisk é uma excelente plataforma para soluções de telefonia porém não é a solução em si. O Snep é uma implementação de PBX baseado inteiramente em software livre com Asterisk e Linux que se propoe a fazer telefonia ip e analógica do jeito correto, sem amarras. Há 4 anos a ferramenta vem evoluindo e já está presente em grandes projetos do governo e da iniciativa privada. Recentemente foi aceito no portal do software público.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "11", "hour": "12", "candidate": "873", "title": "CFengine - Automatizando as Tarefas do Pinguim", "date": "2011-06-29", "abstract": "Já há algum tempo, o Linux vem demonstrando que não é um sistema operacional \r\npara uso exclusivo em servidores. E quando uma empresa do porte da Caixa resolve \r\ncustomizar e implementar uma distribuição Linux para os quase 130.000 desktops \r\nde seus empregados, surge uma enorme demanda no que diz respeito a automatização \r\nde tarefas executadas remotamente. Nesse contexto o CFengine se mostra uma \r\nferramenta excepcional para os administradores de TI.\r\n", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "23", "room_id": "11", "hour": "11", "candidate": "729", "title": "Intel Learning Education - environment and possibilities", "date": "2011-06-29", "abstract": "O novos caminhos da Educação e suas oportunidades.\r\nO mundo em que fomos educados esta mudando rapidamente e as escolas estão cada vez mais distantes do ambiente onde os novos cidadãos estão se desenvolvendo. Os novos ambientes de trabalho demandam habilidades pouco estimuladas e desenvolvidas nas escolas.", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "23", "room_id": "701", "hour": "15", "candidate": "694", "title": "Desenvolvimento de aplicações para MeeGo com SDK", "date": "2011-06-29", "abstract": "Pré-requisito conhecimento em:\r\n-programação  (C, python ou outra linguagem)\r\n-Inglês\r\n-uso de APIS\r\n-uso de IDE de programação\r\n\r\ndesejável:\r\n-Empacotamento no Linux\r\n-Arquitetura do Linux\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "10", "room_id": "701", "hour": "12", "candidate": "697", "title": "Redes Livres - do firmware ao protocolo", "date": "2011-07-02", "abstract": " Oficina com o objetivo de executar a instalação e troca dos firmwares de roteadores para uso em batalha mesh que acontecerá no final da tarde.\r\n\r\n", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "15", "room_id": "5", "hour": "10", "candidate": "848", "title": "Quebrando Mitos do Software Livre na CAIXA ", "date": "2011-06-29", "abstract": "Na utilização de software livre em ambiente corporativo, muitos mitos foram criados visando desacelerar ou impedir seu uso em ambiente corporativo. A CAIXA quebrou todos estes mitos e hoje mantem um ecossistema sustentável para utilizar software livre em ambiente corporativo. A implantação de soluções baseadas em Software Livre no ambiente corporativo, tem ocorrido de forma gradativa, visando consolidar o conhecimento e o uso deste modelo tecnológico nas organizações. ", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "4", "hour": "11", "candidate": "806", "title": "Projeto ScienceLeaks – O “Wikileaks da Ciência”", "date": "2011-06-30", "abstract": "http://www.thescienceleaks.org/\r\nO ScienceLeaks é uma organização sem fins lucrativos cujo objetivo é levar notícias científicas e informações importantes ao público. O projeto provê um meio inovativo, seguro e anônimo para fontes divulgarem informações confidenciais aos nossos jornalistas e cientistas (através de nossa caixa postal física e nossa caixa postal eletrônica).", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "19", "room_id": "7", "hour": "09", "candidate": "709", "title": "Abertura do XII Workshop de Software Livre. ", "date": "2011-07-01", "abstract": "Abertura do XII Workshop de Software Livre.\r\nPalestra de Abertura: Espaços Virtuais de Trabalho para uso em Aplicações Científicas.\r\nProf. Bruno Schulze (LNCC)\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "2", "room_id": "7", "hour": "13", "candidate": "665", "title": "Python e o futuro da telefonia", "date": "2011-06-29", "abstract": "Como a linguagem de programacao python tem influenciado e fortalecido o mercado de desenvolvimento de softwares para telefonia ip. Como utilizar python na apliacao de b2bua e proxy sip para gerenciar infra-estuturas de telefonia sip com qualidade e versatilidade.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "3", "hour": "14", "candidate": "886", "title": "Competencias empreeendedoras - ampliando oportunidades profissionais", "date": "2011-06-30", "abstract": "Já não basta uma boa formação técnica. Empresas dinâmicas estão em busca de colaboradores que também possuam competências empreendedoras.  E quais são estas competências? Segundo Jacques Delors, educador francês, oempreendedor, seja ele empregado ou empresário, se faz com CHA- Conhecimento, Habilidades e Atitudes empreendedoras.\r\nA presente palestra aborda os fundamentos do CHA Empreendedor, de modo que os participantes identifiquem Conhecimentos, Habilidades e Atitudes a serem desenvolvidas para ampliação das oportunidades profissionais.\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "19", "room_id": "7", "hour": "11", "candidate": "710", "title": "Sessão Técnica I: Casos de Sucesso de Pesquisa na Universidade, Empresa e Governo.", "date": "2011-07-01", "abstract": "Sessão Técnica I: Casos de Sucesso de Pesquisa na Universidade, Empresa e\r\nGoverno.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "1", "room_id": "3", "hour": "11", "candidate": "608", "title": "Construindo frameworks inteligentes com PHP", "date": "2011-06-29", "abstract": "Uma discussão sobre como desenvolver frameworks de desenvolvimento ágil baseados em PHP. Estas ferramentas ajudam equipes de desenvolvimento no mundo todo a trabalhar mais e melhor, mantendo o foco da aplicação sempre claro e auxiliando na portabilidade e crescimento de sistemas.", "level": "advanced", "minute": "00", "zone_id": "2"}, {"area_id": "11", "room_id": "4", "hour": "14", "candidate": "499", "title": "Kanban: administração ágil para sysadmins/devops", "date": "2011-06-30", "abstract": "Kanban é uma palavra japonesa que literalmente significa \"registro\" ou \"placa visível\" ou ainda \"painel\". O conceito está ligado à administração da produção e é uma ferramenta para controlar fluxos de produção. A ideia é usar o Kanban para agilizar a entrega de serviços, permitindo que um sysadmin ou uma equipe de infraestrutura conheça quais são as frentes de trabalho em andamento, quais as tarefas a serem vencidas e com isso possa determinar onde investir mais ou menos esforços.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "16", "room_id": "3", "hour": "10", "candidate": "827", "title": "A liberdade na informação: novos paradigmas na educação.", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "4", "hour": "16", "candidate": "560", "title": "Uma análise crítica da adoção de Software Livre no Governo Federal", "date": "2011-06-30", "abstract": "A apresentação vai propor um debate sobre como está funcionando de verdade a adoção de software livre no Governo Federal, mostrando os acertos e os problemas encontrados. \r\nSerão apresentados dados novos e importantes sobre a adoção de SL nos órgãos do Governo Federal.\r\nEsta apresentação se baseia em trabalhos apresentados pelo autor no Workshop de Governo Eletrônico (WCGE) e no trabalho de conclusão de Administração de Redes Linux  na UFLA.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "19", "room_id": "7", "hour": "14", "candidate": "711", "title": "Sessão Técnica II: Software Básico e Sistemas Operacionais.", "date": "2011-07-01", "abstract": "Sessão Técnica II: Software Básico e Sistemas Operacionais.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "9", "room_id": "5", "hour": "14", "candidate": "295", "title": "systemd - acelerando e padronizando o processo de boot.", "date": "2011-06-29", "abstract": "Essa palestra visa apresentar o systemd, suas novas funcionalidades e vantagens sobre outros sistemas de gerenciamento de boot. Além disso, apresentar um sistema usando systemd ao vivo, e como obter informações e gerenciar os serviços rodando na máquina através das ferramentas que o systemd oferece.", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "16", "room_id": "7", "hour": "09", "candidate": "383", "title": "Software Livre e Educação: Uma experiência na Rede ­Municipal de Porto Alegre", "date": "2011-06-29", "abstract": "A proposta visa apresentar experiências de uso do software livre na educação. Apresentará as aproximações teórico-metodológicas que compreendem o movimento do software livre e uma epistemologia re-significada para a escola contemporânea. Escola que acolhe a construção de um conhecimento significativo para o aluno, que é construído de forma colaborativa e compartilhamento dos saberes. A palestra apresentará, além de recortes de teoria, a vivência do projeto ALEMREDE.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "8", "room_id": "6", "hour": "16", "candidate": "861", "title": "Estação Livre - Uma realidade em expansão", "date": "2011-06-29", "abstract": "Arquitetura e implantação de estação de trabalho livre em ambiente corporativo e os desafios de migração com manutenção de níveis de serviço e interoperabilidade com o ambiente legado.", "level": "", "minute": "00", "zone_id": "4"}, {"area_id": "4", "room_id": "7", "hour": "11", "candidate": "846", "title": "FormSUS", "date": "2011-06-30", "abstract": "Um serviço para criação de formulários via Internet, desenvolvido em PHP e utilizando bando MySQL", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "19", "room_id": "7", "hour": "16", "candidate": "712", "title": "Sessão Técnica III: Gerência de Projetos.", "date": "2011-07-01", "abstract": "Sessão Técnica III: Gerência de Projetos.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "17", "room_id": "6", "hour": "10", "candidate": "172", "title": "Apresentando as Redes de Sensores Sem Fio, Aplicações e Desafios em Segurança", "date": "2011-06-29", "abstract": "As Redes de Sensores Sem Fio (RSSFs) têm despontado como tópico emergente sendo cada vez mais usadas tanto pela indústria quanto pela academia, porém ainda desconhecidas por muitos usuários. Atualmente, a construção de aplicações de sensores tem sido viabilizada graças ao uso de tecnologias de código aberto como o SO TinyOS. Esta palestra tem por objetivo apresentar as RSSFs, discutir cenários de uso e mostrar na prática um ambiente destinado à construção de aplicações para essas redes.", "level": "starter", "minute": "00", "zone_id": "6"}, {"area_id": "17", "room_id": "7", "hour": "12", "candidate": "521", "title": "Análise de redes sociais e sistemas dinâmicos com software livre", "date": "2011-06-29", "abstract": "A análise de redes sociais é um campo emergente em desenvolvimento no Brasil, envolvendo novos métodos, algoritmos e ferramentas para análise de ambientes de redes sociais online. O objetivo da apresentação é avaliar que tipos de ferramentas e escolhas de algoritmos estão disponíveis em software livre para o desenvolvimento de projetos e pesquisas na área. ", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "4", "room_id": "7", "hour": "15", "candidate": "872", "title": "Teste automaticamente seus websites com o ASA. ", "date": "2011-06-30", "abstract": "O ASA analisa automaticamente os websites cadastrados, informando a aderência a padrões abertos, como HTML e padrões de acessibilidade, aderência ao IPv6, tipo de servidor, links quebrados, geolocalização, sincronização do relógio do servidor, entre outras características. O ASA é um serviço gratuito do NIC.br, disponível para websites com domínios \".br\" e baseado nas ferramentas de software livre: WIRE e AnáliseInternet.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "2", "room_id": "7", "hour": "10", "candidate": "876", "title": "O Canivete Suiço do Python", "date": "2011-06-29", "abstract": "Muitas vezes perdemos tempo procurando por bibliotecas, módulos, snippets; quando o que precisamos está mais perto que imaginamos. Uma re-leitura da biblioteca padrão de Python para mostrar módulos desconhecidos que costumam salvar vidas =)", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "19", "room_id": "7", "hour": "17", "candidate": "713", "title": "Sessão Técnica IV: Banco de Dados", "date": "2011-07-01", "abstract": "Sessão Técnica IV: Banco de Dados\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "11", "room_id": "5", "hour": "16", "candidate": "137", "title": "VoIP e mitos: por que a voz picota, atrasa... QoS e seus desafios", "date": "2011-06-30", "abstract": "A palestra irá mostrar os desafios de se trafegar voz sobre redes de\r\npacotes como a Internet. O espectador irá entender por que muitas vezes\r\nhá uma degradação na qualidade de voz sobre a rede, como picotes,\r\natrasos, etc, e verá exemplos de implementações de tecnologias como CoS,\r\nToS e DiffServ.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "14", "room_id": "7", "hour": "11", "candidate": "905", "title": "Rede RS - Soluções de Comunicação Unificada ", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "19", "room_id": "7", "hour": "09", "candidate": "714", "title": "Sessão Técnica V: Informática na Educação", "date": "2011-07-02", "abstract": "Sessão Técnica V: Informática na Educação\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "11", "room_id": "7", "hour": "14", "candidate": "931", "title": "Conteúdo Realtime do Terra: desafios e soluções", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "19", "room_id": "7", "hour": "11", "candidate": "715", "title": "Sessão Técnica VI: Sistemas Baseados em Componentes.", "date": "2011-07-02", "abstract": "Sessão Técnica VI: Sistemas Baseados em Componentes.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "19", "room_id": "7", "hour": "14", "candidate": "716", "title": "Sessão Técnica VII: Engenharia de Software.", "date": "2011-07-02", "abstract": "Sessão Técnica VII: Engenharia de Software.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "19", "room_id": "7", "hour": "16", "candidate": "717", "title": "Sessão Técnica VIII: Redes e Sistemas Distribuídos", "date": "2011-07-02", "abstract": "Sessão Técnica VIII: Redes e Sistemas Distribuídos\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "19", "room_id": "7", "hour": "17", "candidate": "718", "title": "O Papel do Hardware Livre no Cenário Atual de TIC. ", "date": "2011-07-02", "abstract": "O Papel do Hardware Livre no Cenário Atual de TIC.\r\nProf. Antônio Augusto Fröhlich (UFSC)\r\nEncerramento do XII Workshop de Software Livre.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "4", "room_id": "3", "hour": "16", "candidate": "250", "title": "Orquestração de serviços web", "date": "2011-06-29", "abstract": "Devido as suas características de interoperabilidade, serviços web simples comumente são combinados para criar serviços mais complexos. Em uma composição por orquestração um serviço central, o orquestrador, coordena o fluxo de informações entre os serviços participantes da composição. Geralmente este serviço orquestrador é escrito em BPEL. Nesta palestra, serão demonstrados padrões e exemplos práticos de orquestrações, desenvolvidos utilizando-se ferramentas Open Source com BPEL.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "17", "room_id": "3", "hour": "14", "candidate": "289", "title": "Cloud Computing - Por Dentro da Nuvem", "date": "2011-06-29", "abstract": "Escalabilidade e disponibilidade sempre foram encarados como grandes desafios no mundo da computação. Com o alcance cada vez maior da internet e o barateamento da banda, existe um crescimento exponencial de usuários que estão demandando sistemas mais ricos e interativos.\r\n\r\nNessa apresentação será explicado sobre o surgimento e as características da arquitetura do Cloud Computing, suas motivações, bem como descrever a sua utilização nos principais cases da industria.\r\n", "level": "starter", "minute": "00", "zone_id": "6"}, {"area_id": "4", "room_id": "6", "hour": "11", "candidate": "509", "title": "Sistemas de controle de versão distribuídos para desenvolvimento colaborativo", "date": "2011-06-29", "abstract": "A palestra propõe expor os conceitos de sistemas de controle de versão distribuídos, como são apresentados pelos diversos sistemas de hosting de projetos, e como é possível definir padrões de desenvolvimento utilizando essas funcionalidades. Como exemplos serão apresentadas as ferramentas e sites mais populares e as diferenças entre eles.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "8", "room_id": "4", "hour": "14", "candidate": "5", "title": "Gosta do GNOME em português? Ajude-o a continuar assim.", "date": "2011-06-29", "abstract": "Esta palestra tem como foco principal mostrar que não é necessário ser um especialista em desenvolvimento, administração de sistemas ou algo extremamente complexo para contribuir com o Software Livre.\r\nBasta ser um usuário de alguma distribuição que utiliza o GNOME e ajudar a traduzir sua interface.", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "16", "room_id": "7", "hour": "09", "candidate": "285", "title": "Labdebug, experiências femininas na produção de cultura digital. ", "date": "2011-06-30", "abstract": "Propomos apresentar algumas experiências do laboratório de Software livre voltado para o público feminino, o Labdebug (www.labdebug.net). Tendo em vista a falta de projetos de capacitação digital voltados para o público feminino e uma grande demanda deste tipo de projeto prático, criamos o LabDebug, um laboratório de práticas e estudos teóricos sobre a mulher na cultura digital. ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "702", "hour": "15", "candidate": "746", "title": "IPv6 básico - ênfase em infraestrutura e administração de sistemas 2", "date": "2011-07-01", "abstract": "Parte 2 (tarde, 15h - 18h):\r\n- Túneis e outras técnicas de transição\r\n- Configuração do IPv6 nos sistemas operacionais e roteadores\r\n- IPv6 e DNS\r\n- IPv6 e outros serviços\r\n\r\nRequisitos para participação:\r\n- Formação em Ciência da Computação, Engenharia ou curso similar\r\n- Experiência com administração de redes e sistemas\r\n- Estudar o e-learning: http://curso.ipv6.br (são aproximadamente 4h de\r\ncurso)\r\n- Trazer notebook com rede wireless para a oficina\r\n", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "18", "room_id": "714", "hour": "14", "candidate": "435", "title": "Transparência Hacker: Agregando e Visualizando Dados de Interesse Público", "date": "2011-07-02", "abstract": "Apresentação do trabalho da Comunidade Transparência Hacker e das ferramentas utilizadas na construção de scrapers (agregadores de dados) e visualizações. Coisas como Ruby e Nokogiri, Python e BeautifulSoup, Rails, Drupal...\r\nMuitos exemplos que vão servir de inspiração para suas futuras contribuições como SACSP, ChequeURL, Alagamentos SP, e muito mais.", "level": "starter", "minute": "00", "zone_id": "7"}, {"area_id": "14", "room_id": "6", "hour": "12", "candidate": "386", "title": "ERP5 Br: Implantando um ERP Livre de uma maneira mais simples", "date": "2011-07-01", "abstract": "O ERP5 Br é o primeiro ERP Livre (Enterprise Resource Planning) a aderir ao Portal do Software Público Brasileiro. O ERP5 Br é capaz de se adaptar facilmente a pequenas, médias ou grandes organizações, de diferentes segmentos econômicos, além de governos, com agilidade e confiabilidade. Apresentação visa introduzir o ERP5 Br, a comunidade no Portal do Software Público Brasileiro e como as empresas podem adotar esse ERP Livre.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "3", "hour": "15", "candidate": "885", "title": "INOVA Show Case - Apresentação de Projetos em Software Livre", "date": "2011-06-30", "abstract": "O Gabinete de Inovação e Tecnologia da Prefeitura de Porto Alegre juntamente com o fisl 12 promove uma mostra de projetos inovadores em Software Livre. Cada profissional ou empresa, através de um representante, apresentará um único projeto a sua escolha. Tempo de apresentação máximo de 5 min. Inscrições para apresentação dos projetos até 27/6/2011 às 23h pelo e-mail leticia.inovapoa@gmail.com. Informações (51) 32897307 com Letícia.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "8", "room_id": "6", "hour": "10", "candidate": "552", "title": "Debian: inovações e revoluções", "date": "2011-07-01", "abstract": "O Projeto Debian está em constante evolução, há várias frentes de trabalho para melhorar seus componentes internos (infraestrutura do projeto) e as ferramentas usadas por seus usuários. Muitas dessas inovações/revoluções/melhorias não recebem atenção nas suas fases iniciais ou acabam não sendo conhecidas (mesmo que seja usadas diariamente). A ideia é apresentar alguns destes tópicos como: MultiArch, CUT/Rolling, MultiKernel (Hurd/FreeBSD), DebDelta, jigdo, dak, britney, EDOS, BTS e PTS.", "level": "starter", "minute": "00", "zone_id": "4"}, {"area_id": "14", "room_id": "3", "hour": "17", "candidate": "893", "title": "Apresentação do programa ALI (Agentes Locais de Inovação)", "date": "2011-06-30", "abstract": "Apresentação do Programa Agentes Locais de Inovação – ALI, resultado da parceria entre SEBRAE e FAPERGS, que visa promover o crescimento das micro e pequenas empresas gaúchas dos setores metalmecânico, couro e calçados e tecnologia da informação e comunicação, através da disponibilização de assessoria especializada e gratuita para o desenvolvimento de inovações tecnológicas em seus produtos e processos.Apoio sem custo para micro e pequenas empresas de Informática e Comunicações.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "5", "room_id": "5", "hour": "13", "candidate": "335", "title": "Introdução ao jQuery UI", "date": "2011-06-30", "abstract": "O jQuery é um framework javascript amplamente utilizado no desenvolvimento de páginas web profissionais de alta qualidade. O jQuery UI é um framework criado em cima do jQuery para possibilitar a criação de interfaces gráficas de alta qualidade, de forma simples, fácil e rápida. Esta palestra tem como objetivo demonstrar como utilizar o jQuery UI para criar interfaces web ricas de conteúdo de forma simples, fácil e rápida.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "6", "hour": "09", "candidate": "542", "title": "O Empreendedorismo e o  Software Livre", "date": "2011-07-01", "abstract": "\"Conheço muito a área de TI e vou abrir uma consultoria\".\r\nEsta é uma frase que ouvi muito durante a minha carreira e logo depois, muitas vezes, ouvia da mesma pessoa:\r\n\"Estou fechando a minha empresa para trabalhar em uma oportunidade que apareceu\".\r\nTrago nesta palestra uma reflexão do porquê uma pessoa que estava tão empolgada na abertura da empresa desistiu do seu proprio negocio para voltar ao mercado de trabalho.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "4", "room_id": "6", "hour": "09", "candidate": "206", "title": "Framework Open-Source para testes de servicos  com criação dinâmica de clientes", "date": "2011-07-02", "abstract": "Apesar das vantagens de aplicações SOA (Service Oriented Architecture),  algumas características inerentes aos serviços web, tais como dinamismo, regras de terceiros e problemas de governança, dificultam o teste automatizado desses serviços. Nesta palestra será apresentado um framework Open-Source para auxiliar na escrita e automatização de testes de serviços web. O framework será demonstrado em uma sessão de Test-Driven Development (TDD), onde serão testados serviços de maneira automatizada.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "4", "hour": "10", "candidate": "586", "title": "Software Livre, passado, presente e futuro", "date": "2011-07-02", "abstract": "O que foi e para onde caminha o Software Livre, o que podemos esperar das tecnologias atuais e futuras.\r\nTecnologias com os novos processadores, inteligência artificial, comunidades, redes sociais, interatividade e interoperabilidade, computação em nuvem, grids computacionais e quântica.\r\nO que será o futuro?\r\n", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "13", "room_id": "6", "hour": "11", "candidate": "840", "title": "Automação de Processos com Bonita Open Solution", "date": "2011-07-01", "abstract": "Gestão de Processos (BPM - Business Process Management) tem atualmente uma alta \r\ndemanda no mercado, mas os clientes precisam de soluções completas que podem ser \r\nimplementadas com o menor custo possível. O universo open source tem várias \r\nsoluções de BPM que podem ser implementadas, mas raramente são soluções \r\ncompletas. Bonita, por outro lado oferece esta possibilidade de ser uma suite  \r\nBPM  com studio para desenhar processos, //execução de fluxo de trabalho, e \r\nconsole de gerenciamento...", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "16", "room_id": "5", "hour": "14", "candidate": "834", "title": "  “ O Software Livre nas Tecnologias Sociais”. -        ", "date": "2011-06-30", "abstract": "“Aplicação do Software Livre na realização do processo de Inclusão Social e Digital da Rede Marista.”  \r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "17", "room_id": "5", "hour": "10", "candidate": "305", "title": "¿ Alcanza con el Software Libre para cambiar el mundo ?", "date": "2011-06-30", "abstract": "Muchas veces se asocia el Software Libre con movimientos anti-hegemónicos que luchan para cambiar el sistema capitalista. \r\nEn esta charla muestro y defino distintas \"visiones\" sobre el softare: Libre, Open Source, privativo, público, comunitario, etc.\r\nHablo de la expansión de la filosofía del Software Libre hacia la música, el hardware, diseño, textos, campesinos (semillas).\r\nPretendo plantear este debate:\r\n¿Qué desafíos tenemos por delante? ¿Alcanza con el Software Libre para cambiar el mundo?", "level": "intermediate", "minute": "00", "zone_id": "6"}, {"area_id": "12", "room_id": "5", "hour": "11", "candidate": "882", "title": "CriptoCAIXA - Baseado no TrueCript", "date": "2011-06-30", "abstract": "CriptoCAIXA - Baseado no TRUECRIPT - Uma solução customizada para garantir o sigilo da informação corporativa e permitir a recuperação da senha através de autenticação do usuário via certificado digital. Apresentamos a arquitetura utilizada que inclui um HSM como elemento de segurança principal", "level": "starter", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "3", "hour": "16", "candidate": "845", "title": "Servidor Voip rápido", "date": "2011-07-01", "abstract": "Instalação e configuração básica de ramais.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "4", "room_id": "6", "hour": "14", "candidate": "864", "title": "Tutorial de Formulários e Tabelas Acessíveis ", "date": "2011-07-01", "abstract": "Tutorial sobre como construir tabelas e formulários acessíveis utilizando as técnicas do WCAG 2.0. Serão apresentados os benefícios e beneficiados utilizando as recomendações de acessibilidade do W3C e o futuro dos elementos de tabelas e formulários em HTML5.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "6", "hour": "16", "candidate": "275", "title": "Bogosort e Técnicas de Programação Realmente Avançadas", "date": "2011-06-30", "abstract": "Um simples algoritmo que pode render boas risadas e horas de reflexão profunda sobre os mais diversos assuntos. Variando de matemática até teorias de muito universos. Essa palestra tem o intuito de divertir o público e ao mesmo tempo alertar sobre o perigo da falta de profissionais capacitados.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "12", "room_id": "4", "hour": "10", "candidate": "868", "title": "Boas Práticas de Segurança", "date": "2011-06-30", "abstract": "A apresentação abordará quais são as práticas mais efetivas que devem ser adotadas para prevenir e se recuperar dos problemas de segurança que mais têm ocorrido nas redes brasileiras, bem como informações de como interagir com CSIRTs e profissionais de segurança de outras redes.", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "13", "room_id": "4", "hour": "15", "candidate": "611", "title": "Desenvolvendo sistemas de Análise de dados Utilizando Hadoop+Hive+PHP", "date": "2011-06-30", "abstract": "Hadoop é um projeto iniciado no Yahoo, que visa o processamento distribuido de dados e a aplicação do algoritmo Map Reduce, criado pelos fundadores do googlee, para o processamento de quantidades massivas de dados.\r\nApós o overview do Hadoop, apresentaremos o Hive o sistema de Data warehousing  do projeto Hadoop e a integração com o PHP. Para a geração de um sistema de estatística para websites como exemplo de aplicação", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "15", "room_id": "5", "hour": "15", "candidate": "807", "title": "Desconferência dos Pontos de Cultura", "date": "2011-07-01", "abstract": "Encontro em formato de desconferência para discutir a cultura digital dos Pontos de Cultura.\r\n\r\n\r\n\r\n                                                      \r\n                                                                                                                                                                                                                                                                              \r\n\r\n\r\n\r\n                                          ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "4", "room_id": "3", "hour": "11", "candidate": "898", "title": "Utilização de Softwares Livres no Processo de Desenvolvimento da Dataprev", "date": "2011-07-01", "abstract": "A palestra visa apresentar um ambiente integrado baseado em ferramentas livre que a Unidade de Desenvolvimento Software Livre da DATAPREV,utiliza para controlar a produção de software de forma colaborativa e distribuída geograficamente.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "2", "hour": "12", "candidate": "313", "title": "Tech Talks: construindo uma ponte entre desenvolvedores e a sociedade civil", "date": "2011-06-29", "abstract": "As Tech Talks são encontros organizados pela comunidade Transparência Hacker e pela ESFERA que têm por objetivo apresentar tecnologias livres para ongs e movimentos sociais, visando melhorar seu escopo de atuação, dando-lhes autonomia e apresentando-lhes a cultura de software livre. O encontro visa ainda criar uma ponte entre desenvolvedores e a sociedade civil organizada, suprindo a demanda das instituições por profissionais especializados em tecnologias livres.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "2", "hour": "14", "candidate": "120", "title": "Construindo uma publicação com Software Livre - O case da Revista Espírito Livre", "date": "2011-06-30", "abstract": "A palestra \"Construindo uma publicação utilizando software livre: O case da Revista Espírito Livre\" tem como proposta desmistificar uma grande questão: É possível construir uma revista utilizando apenas software livre e formatos abertos? Será que o Scribus, Gimp, Inkscape e outras ferramentas gráficas conseguem assumir a posição de um softwares proprietários? A apresentação visa esclarecer estas e outras indagações que sempre permeiam a mente de diversos leitores.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "2", "hour": "17", "candidate": "14", "title": "Etica hacker e o desenvolvimento da ciência e tecnologia", "date": "2011-06-30", "abstract": "A proposta desta mesa é a de discutir a ética hacker e suas potencialidade, enfocando 4 aspectos prioritários: a construção de uma política de informação científica de acesso livre, a governança da internet, os novos desafios para a cultura e para a educação. Consideramos a cultura hacker como um novo campo de luta pela socialização dos bens culturais, artísticos, educacionais, científicos e tecnológicos e por conta disso pensamo ser importante ampliar este debate no FISL12.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "2", "room_id": "2", "hour": "11", "candidate": "856", "title": "Intranet CAIXA - Construindo uma Intranet Corporativa utilizando Plone", "date": "2011-06-30", "abstract": "Desafios, problemas e estratégias para construir uma Intranet dimensionada para atender mais de 100.000 usuários.\r\nVeja como a utilização do Nginx, Varnish, Pound e Memcached foi crucial para o nosso sucesso.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "4", "room_id": "5", "hour": "17", "candidate": "858", "title": "Projeto FAROL", "date": "2011-06-30", "abstract": "O projeto FAROL objetiva monitorar a produção e entrega dos serviços. Para tanto integra processos e tecnologias pela adoção de uma arquitetura de monitoração integrada e interoperável de serviços. Sua principal premissa é o uso de soluções livres, modelos de referências e padrões abertos.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "6", "room_id": "2", "hour": "10", "candidate": "792", "title": "MySQL 5.5 and 5.6, the latest updates on the World's Most Popular FLOSS Database", "date": "2011-06-30", "abstract": "MySQL 5.5 and 5.6, the latest updates on the World's Most Popular FLOSS Database", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "2", "room_id": "6", "hour": "17", "candidate": "875", "title": "Associação Python Brasil convida: Palestras-relâmpago", "date": "2011-07-02", "abstract": "O ponto alto de qualquer conferência de Python, palestras-relâmpago duram 5 minutos, e o tempo é rigorosamente controlado. O tema é livre, e o resultado final é uma salada de idéias intrigantes, projetos novíssimos, curiosidades e humor geek.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "23", "room_id": "8", "hour": "10", "candidate": "728", "title": "AppUp Center - opportunities to sell around the world", "date": "2011-06-29", "abstract": "AppUp Center - opportunities to sell around the world", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "4", "room_id": "4", "hour": "17", "candidate": "904", "title": "Geplanes: Planejamento Estratégico utilizando software livre.", "date": "2011-06-29", "abstract": "Apresentação do case da Secretaria de Logística e Tecnologia da Informação (SLTI) do Ministério do Planejamento, Orçamento e Gestão (MP) de aplicação do software livre Geplanes no Planejamento Estratégico.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "23", "room_id": "2", "hour": "16", "candidate": "733", "title": "MeeGo Applications using QtCreator and SDK", "date": "2011-06-29", "abstract": "MeeGo Applications using QtCreator and SDK", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "15", "room_id": "2", "hour": "10", "candidate": "894", "title": "Zappiens.br - e sua plataforma de código livre para vídeos.", "date": "2011-06-29", "abstract": "O Zappiens.br é um site de vídeos em língua portuguesa, com conteúdo de\r\ncunho cultural ou educacional, baseado na agregação de conteúdos via\r\nOAI-PMH e sitemaps de vídeo, e também na hospedagem local dos mesmos. A\r\nplataforma, baseada principalmente em Java, e desenvolvida com a\r\nparticipação da RNP, do LARC/USP, da FCCN-PT e do CGI.br e NIC.br tem o\r\ncódigo livre e pode ser utilizada por todos como base para seus próprios\r\nsites de vídeo\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "16", "room_id": "5", "hour": "16", "candidate": "887", "title": "Dados abertos: impactos sobre os conceitos e práticas de cidadania no Brasil ", "date": "2011-07-01", "abstract": "As novas tecnologias que permitiem facilmente publicar dados na web em formato aberto tornaram possível o manuseio, filtrar ou cruzar base de dados, construindo novas aplicações e conhecimentos pela sociedade. A ampliação do uso dos dados abertos também permite também levar o \"governo eletrônico\" a um novo patamar, no qual a sociedade pode assumir o papel relevante na definição dos serviços e aplicações segundo seus interesses e conveniências. A sociedade pode construir suas próprias aplicações a partir de dados públicos. Esse painel vai debater o impacto dos dados abertos, suas limitações e desafios para a sociedade e governo na definição de uma política de acesso aos dados públicos.\r\n", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "2", "hour": "17", "candidate": "906", "title": "Dados Abertos - a evolução do Governo Eletrônico ", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "2", "hour": "10", "candidate": "944", "title": "Medindo a qualidade da Internet entre Sistemas Autônomos Brasileiros", "date": "2011-07-01", "abstract": "A Internet hoje é formada por diversos Sistemas Autônomos que se\r\ncomunicam entre sí . Muitas vezes, a comunicação entre estes sistemas\r\npode apresentar problemas que necessitam ser analisados para a melhor\r\ncorreção destes problemas. O NIC.br está apresentando um projeto que\r\nprovê a medição da qualidade da malha Internet brasileira, permitindo\r\nque cada Sistema Autônomo participante tenha acesso aos dados das\r\n>>>> medições entre seu coletor os demais localizados nas cinco r", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "11", "room_id": "2", "hour": "11", "candidate": "327", "title": "Espelhamento de HDs local e remoto (RAID1) no GNU/Linux com mdamd e DRBD", "date": "2011-07-01", "abstract": "Já pensou se o HD, em casa ou no trabalho, queimar? Você faz backup todos os dias? Não? Então, certamente, parte da sua vida será perdida. Mas o preço dos HDs está cada dia mais baixo. É possível adquirir um HD de boa marca e com 1 TB de espaço por poucos reais. Então, que tal se prevenir? Mas... E quanto aos seus servidores de rede? Esta palestra mostrará como realizar o RAID1 em dois HDs locais e, também, em dois HDs remotos. Esta última possibilidade é ótima para servidores de rede.", "level": "advanced", "minute": "00", "zone_id": "3"}, {"area_id": "16", "room_id": "5", "hour": "15", "candidate": "815", "title": "Computação em nuvens e democracia", "date": "2011-06-30", "abstract": "Debater sobre a computação em nuvens e a democracia na web: conceitos, as ações presentes e futuras, cenários, perspectivas, casos, técnica e possibilidades.\r\nEsta palestra tem como público alvo interessados em geral na área, políticos, sociólogos, informatas e integrantes de movimentos sociais.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "8", "room_id": "2", "hour": "16", "candidate": "785", "title": "O Ubuntu como desktop no Exército Brasileiro", "date": "2011-06-30", "abstract": "A palestra tem por finalidade mostrar como o uso da distribuição Ubuntu auxilia no processo de migração e fazer um breve relato sobre a customização para torná-la ainda mais amigável, assim diminuindo as \"resistências à mudanças\" durante o porcesso de migração.", "level": "intermediate", "minute": "00", "zone_id": "4"}, {"area_id": "4", "room_id": "4", "hour": "17", "candidate": "495", "title": "De Onde Vem os Bugs?", "date": "2011-07-02", "abstract": "Que diabos é uma tela azul? É um bug no software, ok, mas o que é um Bug? É uma falha? um erro? um defeito? Certo é que em sua etimologia, bugs derivam de sua irritante característica de atrapalhar a vida do usuário. Seja na compra de ingresso ou no saque de milhas para passagens aéreas. Funcionar não pode ser um conceito relativo, mas absoluto. Contudo, se os bugs são tão indesejáveis, por que eles teimam em aparecer? De onde eles vem? ", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "16", "room_id": "4", "hour": "17", "candidate": "823", "title": "Inclusão digital como política pública: conceitos, benefícios e desafios", "date": "2011-06-30", "abstract": "Debater sobre a inclusão digital: conceitos, as ações presentes e futuras, vantagens, perspectivas, políticas públicas, financiamento e possibilidades.\r\nEsta palestra tem como público alvo interessados em geral na área, gestores públicos, especialistas em informática na educação e pedagogos.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "1", "room_id": "2", "hour": "09", "candidate": "208", "title": "Programação para Android com bancos de dados e Publicação no Market", "date": "2011-07-01", "abstract": "Nessa palestra será feita uma introdução de como programar para o Android, iniciando pela instalação do ambiente, criação de alguns exemplos com listas, botões, e várias outros elementos que compõem a interface de usuário em um programa para Android. Será apresentado também exemplo de acesso a banco de dados e por fim, como publicar sua aplicação no Android Market.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "3", "hour": "17", "candidate": "329", "title": "Zabbix no varejo: 160 unidades monitoradas", "date": "2011-06-29", "abstract": "Atualmente a TI está voltada a conhecer um problema antes mesmo que ele ocorra, para que seja possível tomar ações corretivas e tentar evitá-lo. Quando a rede é distribuída em várias unidades, esta tarefa sem o uso de uma ferramenta de apoio é dificultada. Neste trabalho será apresentado o projeto de monitoramento das Lojas Benoit, que monitora hardware, serviços e processos, em mais de 160 unidades distantes geograficamente utilizando o Zabbix.", "level": "intermediate", "minute": "00", "zone_id": "5"}, {"area_id": "6", "room_id": "2", "hour": "15", "candidate": "787", "title": "Contra números não há argumentos.", "date": "2011-07-01", "abstract": "O Banco do Brasil se consolidou como um dos maiores cases no \r\nuso de soluções livres do mundo, mostrando que é possível e viável sim. Buscamos \r\nexpandir o uso destas soluções ao mesmo tempo em que contribuímos com a \r\ncomunidade. Quer saber o que usar baseando-se em uma das empresas nacionais mais \r\nsólidas do mercado? Assista a palestra e conheça o que deu certo conosco, porque \r\ncom certeza também dará certo com você.\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "12", "room_id": "5", "hour": "17", "candidate": "378", "title": "Metasploit Framework: a lightsaber for pentesters!", "date": "2011-07-02", "abstract": "O objetivo da apresentação é demonstrar todo o poder deste framework no auxílio a atividades de auditorias do tipo testes de invasão. A ferramenta é capaz de auxiliar pentesters em todas as etapas da auditoria. A ferramenta impressiona pela versatilidade e eficiência tornando meros auditores em verdadeiros Jedis.\r\nMuita responsabilidade ao utilizá-la você deve ter pequeno padawan ;)", "level": "intermediate", "minute": "00", "zone_id": "3"}, {"area_id": "4", "room_id": "2", "hour": "15", "candidate": "744", "title": "10 razões para usar o Launchpad (e não o GitHub)", "date": "2011-07-02", "abstract": "Launchpad é um conjunto de ferramentas de código aberto patrocinado pela Canonical que ajuda pessoas e equipes a trabalharem juntos em projetos de software. Essa palestra tem como objetivo expor as principais razões pelas quais projetos de código aberto devem usar o Launchpad para gerenciar os seus projetos.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "1", "hour": "10", "candidate": "836", "title": "Users at the Center of Design", "date": "2011-06-30", "abstract": "At Canonical, we involve end users throughout our design process. In my presentation, I will describe our methodologies, and will give examples of how we work with our end users to understand them and to use these insights to create features and functionalities they will embrace.  ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "20", "room_id": "714", "hour": "10", "candidate": "684", "title": "LPI prova 1", "date": "2011-06-30", "abstract": "LPI", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "16", "room_id": "1", "hour": "14", "candidate": "833", "title": "Cultura digital, Democracia e Governos no século XXI", "date": "2011-06-29", "abstract": "O Governador Tarso Genro convida especialistas para falar de software livre e ajudar na elaboração de políticas relacionadas a participação, transparência e tecnologia.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "3", "room_id": "8", "hour": "17", "candidate": "754", "title": "qooxdoo and javascript", "date": "2011-06-30", "abstract": "Ever thought about writing a complete application in JavaScript? I have done it many times and I love it.\r\n In todays browsers, JavaScript has matured to a solid, high performance language. In connection with the powerful components provided by the qooxdoo javascript framework, even large projects\r\n become a breeze to implement. In this talk I share some of my enthusiasm and introduce you to writing applications in javascript.\r\n\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "8", "hour": "13", "candidate": "838", "title": "OW2 and open source trends: community presentation", "date": "2011-06-30", "abstract": " Founded in January 2007, OW2 is an independent industry community dedicated to developing open source code infrastructure (middleware and generic applications) and to fostering a vibrant community and business ecosystem. \r\n\r\nIn this presentation we highlights the strengths and pitfalls of commercial open source as perceived from the standpoint of the OW2 community , we analyse the role of open source organizations in providing a structure to the open source software industry and we position OW2 in this context. \r\n\r\nWe introduce the five key components of OW2: its code base, its community, its activities, its governance and its financial model. We also describe two main endeavors of the community, the OW2 Open Source Cloudware Initiative (OSCi) and the Software Quality Assurance and Trustworthiness (SQuAT) program. We demonstrate how OW2, more than  just a community is an open source business ecosystem platform. ", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "8", "hour": "16", "candidate": "936", "title": "Escalabilidade para servicos online: por que o google quase sempre me responde?", "date": "2011-07-02", "abstract": "Estratégias de escalabilidade para servicos online ", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "9", "room_id": "1", "hour": "10", "candidate": "750", "title": "The State of Samba", "date": "2011-06-29", "abstract": "The Samba project is nearly 20 years old. How did it get started,\r\nwhat have we achieved and where are we going with the code ?\r\n\r\nCome listen to one of the creators of Samba give his thoughts\r\non the SMB and SMB2 and NFS protocols, Samba, Open Source/Free\r\nSoftware, the relationship with Microsoft, Samba4, and why file\r\nsharing on a local area network might just not be the future\r\nanymore.", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "1", "room_id": "1", "hour": "09", "candidate": "795", "title": "NetBeans on the Java Bleeding Edge", "date": "2011-06-30", "abstract": "NetBeans on the Java Bleeding Edge", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "8", "hour": "10", "candidate": "924", "title": "Developing Android Games", "date": "2011-07-02", "abstract": "Android users love games, and if you aren't developing yours, this is a great time to start! This session will give you an overview of game-development features of Android: from simple canvas to Surfaces, to using OpenGL ES for 2D and 3D graphics; also, audio, video and how to read user input via touch and sensors; performance tips for games.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "10", "room_id": "1", "hour": "13", "candidate": "937", "title": "Making Copyleft Hardware", "date": "2011-06-30", "abstract": "The spirit of the Free Software revolution has also reached\r\nthe more traditional world of hardware, but many challenges\r\nremain.\r\nThis presentation will review the objectives and constraints\r\nof copyleft hardware, examine their practical implications on\r\ndesign, tools, and the general workflow, and illustrate how\r\nthis works in real life with examples from the Qi-Hardware\r\nproject (Ben NanoNote, Ben-WPAN, Milkymist One, and others).", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "2", "room_id": "8", "hour": "17", "candidate": "748", "title": "Lessons learned from FLOSSing Weekly", "date": "2011-07-01", "abstract": "Randal Schwartz has been producing and hosting the \"FLOSS (Free Libre\r\nOpen Source Software) Weekly\" hour-long podcast since nearly its\r\nbeginning in 2007.  Each week, Randal and a co-host interview one or\r\nmore key guests about a specific open source project, community, or\r\nconference.  Past interviews have included Linus Torvalds, Jono Bacon,\r\nMiguel de Icaza, and even FISL's own Fernanda Weiden.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "16", "room_id": "1", "hour": "16", "candidate": "756", "title": "Google Summer of Code", "date": "2011-06-29", "abstract": "Google Summer of Code is now in its seventh year of introducing new\r\nstudent developers to open source software. Carol Smith will be\r\ndiscussing the program generally and providing some interesting\r\ninformation about how the program is proceeding this year.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "15", "room_id": "1", "hour": "15", "candidate": "798", "title": "Debate: Recursos Educacionais Abertos - REA", "date": "2011-06-30", "abstract": "Recursos educacionais abertos (REA) são bens educacionais oferecidos livremente para qualquer pessoa usar e, sob algumas licenças, adaptar, melhorar e distribuir. Recursos educacionais abertos incluem: conteúdo e ferramentas de aprendizagem,  além dos recursos para sua implementação.  A comunidade brasileira de REA tem hoje 110 membros interessados na construção de uma educação mais democrática, inclusiva e mais próxima da cultura colaborativa da Internet e do software livre.\r\n                   ", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "8", "hour": "11", "candidate": "751", "title": "Software Freedom Means Business Value", "date": "2011-07-01", "abstract": "As we move into a new era of software on the Internet, it's good to realise that software freedom is more than just a philosophy; it is also at the heart of everything today's businesses seek from computers and software. Hear about how the four freedoms translate directly to business values, and consider how the software freedom movement should respond to new developments like cloud computing.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "20", "room_id": "714", "hour": "12", "candidate": "685", "title": "LPI prova 2", "date": "2011-06-30", "abstract": "LPI", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "12", "room_id": "1", "hour": "11", "candidate": "844", "title": "Tor, current trends in censorship and building a better future", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "23", "room_id": "8", "hour": "12", "candidate": "727", "title": "Compute Continuum - technologies that bring value", "date": "2011-06-29", "abstract": "James has over 16 years of sales and marketing experience and has been with Intel for 10years, were he has held several roles including Global Director, Linux OSV / Open Source and APAC Regional MNC Manager based in Singapore. James holds an MBA from the University of California, and studied at Jochi Daigaku in Tokyo, Japan and Universiteit Maastricht in the Netherlands during his undergraduate and graduate studies.\r\n", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "1", "room_id": "8", "hour": "09", "candidate": "648", "title": "The Java EE 7 Platform: Developing for the Cloud", "date": "2011-07-02", "abstract": "This talk introduces the Java EE 7 platform, the latest revision of the Java platform for the enterprise. The focus of Java EE 7 is on the cloud, and specifically it aims to bring Platform-as-a-Service providers and application developers together so that portable applications can be deployed on any cloud infrastructure and reap all its benefits in terms of scalability, elasticity, multitenancy, etc.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "1", "hour": "10", "candidate": "205", "title": "Using Social Awards To Build Better Free Software & Free Culture Projects", "date": "2011-07-01", "abstract": "Because most participants aren't paid, many free software and free culture projects use non-monetary awards and incentives to attract participation. We present findings from three studies we have recently completed on Wikipedia, the Scratch online community, and Amazon Mechanical Turk that show the potential benefits, limitations, and pitfalls of social incentives as a way to elicit contributions.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "23", "room_id": "1", "hour": "17", "candidate": "735", "title": "Evangelist for Linux Community MeeGo", "date": "2011-06-29", "abstract": "Evangelist for Linux Community MeeGo", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "18", "room_id": "714", "hour": "14", "candidate": "837", "title": "Educación y Software Libre en América Latina: situación actual y perspectivas ", "date": "2011-06-30", "abstract": "Este  encuentro presentado por Solar, Gleducar y Software Livre Educacional  propone un taller de intercambio de experiencias de incorporación de  Software Libre a la Educación con la participación de distintos países  latinoamericanos como Argentina, Brasil y Uruguay. La programación  constará de una apertura a cargo de las tres organizaciones convocantes  seguida de la presentación de experiencias y del debate en torno de las  mismas con el público presente.", "level": "", "minute": "00", "zone_id": "7"}, {"area_id": "6", "room_id": "1", "hour": "17", "candidate": "738", "title": "MVCC Unmasked", "date": "2011-07-01", "abstract": "Multi-Version Concurrency Control (MVCC) allows Postgres to offer high concurrency even during significant database read/write activity. MVCC specifically offers behavior where \"readers never block writers, and writers never block readers\". This talk explains how MVCC is implemented in Postgres and highlights optimizations which minimize the downsides of MVCC. ", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "1", "hour": "09", "candidate": "150", "title": "Google and Open Source", "date": "2011-07-01", "abstract": "Michael Hanselmann will give an introduction into Google's history and then talk about the Summer of Code program. He'll highlight the many Open Source projects driven by Google, such as Chrome or Android, and which other projects Google engineers have been contributing to over recent years.", "level": "starter", "minute": "00", "zone_id": "5"}, {"area_id": "3", "room_id": "1", "hour": "11", "candidate": "921", "title": "Android: Visão Geral do SDK e Últimas Novidades", "date": "2011-06-30", "abstract": "O crescimento do Android ao redor do mundo não é nada menos que incrível, e uma parte fundamental desse sucesso se deve a um ótimo ecosistema de desenvolvedores. Nesta sessão, apresentaremos uma visão geral da plataforma de desenvolvimento Android, incluindo a motivação para escrever aplicativos móveis, um pouco da história do Android e o que há de novidades nas versões mais recentes, bem como uma visão geral do SDK.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "20", "room_id": "8", "hour": "15", "candidate": "902", "title": "Reservado Organização", "date": "2011-06-29", "abstract": ".", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "20", "room_id": "714", "hour": "15", "candidate": "812", "title": "Prova Latinux", "date": "2011-07-01", "abstract": "Latinux", "level": "", "minute": "00", "zone_id": "1"}, {"area_id": "4", "room_id": "1", "hour": "14", "candidate": "294", "title": "Breaking the [Amdahl's] law!  Effective Use of the JavaSE 7 Fork-Join Framework", "date": "2011-07-01", "abstract": "The fork-join framework is a significant new feature in Java SE 7.  Getting the most from this requires an understanding of how to design applications to identify areas where work can usefully be carried out in parallel.  This session will help you to understand the ways to use the fork-join framework effectively and also help to understand where the framework is not appropriate for greater efficiency.", "level": "intermediate", "minute": "00", "zone_id": "2"}, {"area_id": "17", "room_id": "1", "hour": "09", "candidate": "839", "title": "OW2 SlapOS, the CompatibleOne project billing platform", "date": "2011-06-29", "abstract": "With the increasing adoption of IPv6, 100 Mbps or 1000 Mbps fiber to the home and Solid State Disks all over the world, the days of centralized data centers and expensive storage area networks are most likely counted. Instead, a new form of Cloud - massively distributed cloud - can be implemented today to provide Platform as a Service (PaaS), Software as a Service (SaaS) and Infrastructure as a Service (IaaS) with new levels of cost efficiency, drastically reduced environmental impact and high protection of Freedom.\r\n\r\n\"SlapOS\":http://www.slapos.org/ – an OW2 project – is probably the first open source Distributed Cloud Operating system of this kind. It is based on a ERP model and provides a simple API which anyone can learn in less than one hour and instantiate any type of software: SQL database, distributed NoSQL storage, ERP, CRM, e-commerce, wiki, http cache, application server, load balancer, virtual machine. Thanks to process allocation optimization and the billing system, any software publisher can become a multi-tenant  SaaS or PaaS provider in less than a week, without having to consider huge investments in research and development, and start to charge for your services.\r\n\r\nSlapOS is based on a grid computing daemon called slapgrid which is capable of installing any software on a PC and instantiate any number of processes of potentially inﬁnite duration of any installed software. Slapgrid daemon receives requests from a central scheduler the SlapOS Master which\r\ncollects back accounting information from each process. SlapOS Master follows an Enterprise Resource Planning (ERP) model to handle at the same time process allocation optimization and billing.\r\n\r\nThe CompatibleOne is a collaborative project, funded and supported by French institutions, that identifies, aggregates and integrates leading open source technologies into a rich and comprehensive 'cloudware' stack. CompatibleOne is developing a meta-model-based framework for the abstraction of the configuration, management and integration of these technologies. its outputs will be offered under an OSI compliant open source license and the code distributed via the OW2 Consortium software forge as part of the OW2 Open Source Cloudware Initiative.\r\n\r\nThis presentation aims to introduce SlapOS Project, the architecture and components involved. I will also introduce early sucessfull cases on BraZil, and the already supported softwares (apache, ERP5, Cloudooo, Wordpress..), some application cases (testbed, continuos integration, distributed cloud setups ...) and the project roadmap.", "level": "", "minute": "00", "zone_id": "6"}, {"area_id": "14", "room_id": "1", "hour": "14", "candidate": "762", "title": "SUMO — How Mozilla supports 400 Million users with 6 employees", "date": "2011-06-30", "abstract": "That talk is about how we support 400 Million users with 6 employees, by including our community contributors and giving them the right tools on hand. It will give a high level overview of how support is handled by one big open source project, featuring our own tailormade software Kitsune, and covering the four pillars, written docs, public questions&answers, personal problem solving, and outreach.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "14", "room_id": "8", "hour": "15", "candidate": "847", "title": "Ubuntu Server and Cloud", "date": "2011-07-01", "abstract": "This presentation will show how people are using Ubuntu Server for different\r\ntypes of workloads ranging from traditional LAMP (Linux Apache MySQL & PHP) web\r\napplication through to next generation cloud deployments. With data about the\r\nextent of Ubuntu adoption in each area, David Duffey will explain why strategy\r\nof creating a freely available, stable yet rapidly developing server platform is\r\nnow starting to drive adoption as users look towards a cost effective means of\r\nmoving towards the cloud.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "1", "hour": "15", "candidate": "791", "title": "Updates on Oracle Linux and Oracle VM", "date": "2011-07-01", "abstract": "Updates on Oracle Linux and Oracle VM, Oracle's complete Desktop-to-Datacenter virtualization portfolio\"", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "1", "room_id": "1", "hour": "12", "candidate": "141", "title": "Project COIN: Small Language Change for the JDK", "date": "2011-06-29", "abstract": "Project Coin is about making things programmers do everyday easier. \r\n\r\nThe Java SE 7 changes include binary literals and underscores in literals, strings in switch statements, VarArg warnings, diamond operator, multi-catch and a more precise rethrow, all of which can be used today in Netbeans 7.0. \r\n\r\nThis session will go into detail about the Java language changes in Java SE 7 and look at the possible changes planned for Java SE 8. \r\n", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "8", "hour": "10", "candidate": "796", "title": "Complete, Open, and Integrated ----Oracle's investment in open source and stands", "date": "2011-07-01", "abstract": "Complete, Open, and Integrated ----Oracle's investment in open source and stands", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "4", "room_id": "8", "hour": "09", "candidate": "835", "title": "rrdtool", "date": "2011-07-01", "abstract": "RRDtool is a \"one trick pony\" open source database,\r\n  with the sole purpose of storing time series data. In this talk you\r\n  will learn how you could use RRDtool how you could use it in your own\r\n  scripts. And where you may already be using RRDtool today without\r\n  knowing it.\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "3", "room_id": "1", "hour": "16", "candidate": "922", "title": "Android: Effective UI Best Practices", "date": "2011-06-30", "abstract": "Good user interfaces and optimized user experiences are important on any device, but are even more important on mobile devices that have limited screen real estate and are being used by people in a hurry.\r\nWe'll talk about UI and UX design patterns on Android and how to use them to greatest effect, both in phones and in tablets.", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "15", "room_id": "1", "hour": "11", "candidate": "755", "title": "You and me, keeping the web open together", "date": "2011-06-29", "abstract": "The web is an integral part of modern day life from education to communication to business. It's important that the web stay open in order to be accessible to everyone, to foster innovation and further development. It's also important that individuals and businesses have control of their data and their lives on the web. In order for that to happen, web developers need to use open technologies that respect individuals' ability to shape their own experience on their internet.", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "11", "room_id": "1", "hour": "16", "candidate": "736", "title": "Zabbix — an important part of your IT infrastructure", "date": "2011-07-02", "abstract": "Zabbix software may help your company in a number of various ways, starting from low-level monitoring of your equipment to business level SLA statistics.\r\nThe talk will cover principles and philosophy behind Zabbix, some of the most interesting features along with an overview of new functionality of the upcoming v2.0 release. Come and get a nice overview how Zabbix may help you to assure that all your servers and services are up and running!", "level": "", "minute": "00", "zone_id": "3"}, {"area_id": "1", "room_id": "1", "hour": "15", "candidate": "646", "title": "Running your Java EE applications in the Cloud", "date": "2011-07-02", "abstract": "GlassFish can easily run on multiple cloud infrastructures. This talk will provide a brief introduction to Java EE 6 and GlassFish. The attendees will learn how to create a simple Java EE 6 sample application and deploy them on GlassFish running locally and then deploy it using Amazon, RightScale, Joyent, and Azure cloud infrastructures. The talk will also provide insight into future directions for the Java EE 7 platform that will make it more friendly to cloud deployments.", "level": "starter", "minute": "00", "zone_id": "2"}, {"area_id": "14", "room_id": "8", "hour": "09", "candidate": "923", "title": "Developing for Android Market: Publishing, License Management and In-App Billing", "date": "2011-06-30", "abstract": "Android Market is a great way to distribute your work. This session will give you an overview of the main features of Android Market and how to publish your application. We will also cover how to perform License verification and how to sell individual items from within your application (In-App Billing)", "level": "", "minute": "00", "zone_id": "5"}, {"area_id": "4", "room_id": "1", "hour": "17", "candidate": "761", "title": "Building RPMS: How Fedora's Koji Works and how you can use it to build software", "date": "2011-06-30", "abstract": "Ever wanted to build Software in a controlled and reproducible manner? Ever wondered how a distro is built? Need to build software internally? Are you a existing Fedora Contributor and want to know how the tools you use work?\r\nThis talk is going to cover what koji is, how it works, how you can use koji to build your own software in a consistent and reproducible manner.\r\n\r\n", "level": "", "minute": "00", "zone_id": "2"}, {"area_id": "12", "room_id": "8", "hour": "14", "candidate": "928", "title": "OpenLeaks and the future of blowing the whistle on the internet", "date": "2011-07-01", "abstract": ".", "level": "", "minute": "00", "zone_id": "3"}], "zones": [{"zone_id": "3", "name": "Administração"}, {"zone_id": "2", "name": "Desenvolvimento"}, {"zone_id": "4", "name": "Desktop"}, {"zone_id": "5", "name": "Ecossistema"}, {"zone_id": "7", "name": "Encontros Comunitários"}, {"zone_id": "1", "name": "Principal"}, {"zone_id": "6", "name": "Tópicos Emergentes"}], "areas": [{"area_id": "11", "name": "Administração de Sistemas e VoIP", "description": "Palestras t&amp;#233;cnicas sobre administra&amp;#231;&amp;#227;o de sistemas livres em geral. Servi&amp;#231;os de rede como MTA's, gerenciamento de usu&amp;#225;rios e grupos, autentica&amp;#231;&amp;#227;o, monitora&amp;#231;&amp;#227;o, servidores web, infra-estrutura, gerenciamento de sistemas operacionais, ger&amp;#234;ncia de pacotes, gerenciamento de servi&amp;#231;os do sistema, Palestras sobre softwares e protocolos de voz sobre IP, etc."}, {"area_id": "20", "name": "ASL", "description": "<descr/>"}, {"area_id": "8", "name": "Desktop e Distribuições", "description": "Palestras t&amp;#233;cnicas sobre uso de software livre em desktop, voltadas &amp;#224; realiza&amp;#231;&amp;#227;o de tarefas cotidianas, sejam em ambiente profissional ou dom&amp;#233;stico. Plataformas Desktop, Aplica&amp;#231;&amp;#245;es voltadas a usu&amp;#225;rio final, automa&amp;#231;&amp;#227;o de escrit&amp;#243;rio, utilit&amp;#225;rios para internet, gerenciadores de janela, ferramentas de produtividade. Plataformas espaciais de hardware para desktop baseadas em software livre; customiza&amp;#231;&amp;#227;o de distribui&amp;#231;&amp;#245;es; distribui&amp;#231;&amp;#245;es para fins espec&amp;#237;ficos. Palestras com foco voltado a comunidade das distribui&amp;#231;&amp;#245;es ou ambientes desktop N&amp;#195;O devem estar nessa trilha."}, {"area_id": "15", "name": "Ecossistema / Cultura", "description": "Comunidade, Filosofia, Legisla&amp;#231;&amp;#227;o e Cultura Livre. Palestras que discutam aspectos relativos &amp;#224; sustentabilidade econ&amp;#244;mica do software livre, forma&amp;#231;&amp;#227;o de ecossistema sustent&amp;#225;vel de produ&amp;#231;&amp;#227;o e consumo dentro da l&amp;#243;gica do compartilhamento. Aspectos pol&amp;#237;ticos e jur&amp;#237;dicos que influenciam na ado&amp;#231;&amp;#227;o e no desenvolvimento de software livre. Pol&amp;#237;ticas p&amp;#250;blicas relacionadas a software livre: licenciamento, trademarks, direitos autorais, legisla&amp;#231;&amp;#227;o, incentivos, programas. Software Livre e Economia Popular Solid&amp;#225;ria. Modelos de neg&amp;#243;cios para empreendimentos baseados em software livre. Projetos sociais relacionados &amp;#224; comunidade de software livre desenvolvidos por ONGs, grupos de usu&amp;#225;rios, etc. Formas de organiza&amp;#231;&amp;#245;es de grupos dentro da comunidade do software livre. Relatos de experi&amp;#234;ncia de grupos de usu&amp;#225;rios e sua contribui&amp;#231;&amp;#227;o para o avan&amp;#231;o do software livre. Consequ&amp;#234;ncias sociais do modelo de produ&amp;#231;&amp;#227;o do software livre. Rela&amp;#231;&amp;#227;o da comunidade do software livre com outros movimentos sociais. Quest&amp;#245;es de g&amp;#234;nero e Software Livre. Influ&amp;#234;ncia da cultura do compartilhamento na sociedade."}, {"area_id": "16", "name": "Educação e Inclusão Digital", "description": "Palestras sobre o Software Livre e seus impactos sobre a forma&amp;#231;&amp;#227;o das pessoas. A influ&amp;#234;ncia da cultura da comunidade do software livre na educa&amp;#231;&amp;#227;o e em projetos de inclus&amp;#227;o social. Software livre e acessibilidade. Projetos de inclus&amp;#227;o digital baseados em software livre: planejamento, execu&amp;#231;&amp;#227;o e resultados. Apropria&amp;#231;&amp;#227;o do software livre pelas comunidades em projetos de inclus&amp;#227;o digital. Educando com o software livre e educando para o software livre: competi&amp;#231;&amp;#227;o versus coopera&amp;#231;&amp;#227;o."}, {"area_id": "18", "name": "Eventos Comunitários", "description": "\n\t\t\tPara esta trilha devem ser submetidas as propostas de eventos comunit&#225;rios. Os eventos comunit&#225;rios s&#227;o sub-eventos dentro do FISL onde as comunidades de Software Livre tem plena liberdade em decidir conte&#250;do, temas e palestrantes.\n\t\t"}, {"area_id": "4", "name": "Ferramentas, Metodologias e Padrões", "description": "O foco dessa trilha s&amp;#227;o palestras t&amp;#233;cnicas com temas ligados a desenvolvimento com software livre  e controle de vers&amp;#227;o, ferramentas de desenvolvimento, implementa&amp;#231;&amp;#245;es livres de padr&amp;#245;es da ind&amp;#250;stria e processos de desenvolvimento de software livre, al&amp;#233;m de integra&amp;#231;&amp;#227;o com aplica&amp;#231;&amp;#245;es, manuten&amp;#231;&amp;#227;o, comparativos e an&amp;#225;lises de desempenho nessas tecnologias. Est&amp;#225; no escopo dessa trilha tanto a utiliza&amp;#231;&amp;#227;o dessas ferramentas, metodologias e padr&amp;#245;es como o desenvolvimento delas. Paletras que tenham como tema central uma linguagem de programa&amp;#231;&amp;#227;o N&amp;#195;O devem estar nessa trilha."}, {"area_id": "6", "name": "Gerência de Conteúdo", "description": "O foco dessa trilha s&amp;#227;o palestras t&amp;#233;cnicas com temas ligados a sistemas da chamada web2.0; portais; blogs, microblogs; wikis e outros ambientes colaborativos; disponibiliza&amp;#231;&amp;#227;o de conte&amp;#250;do Peer to Peer, manuten&amp;#231;&amp;#227;o, comparativos e an&amp;#225;lises de desempenho nessas tecnologias. Est&amp;#225; no escopo dessa trilha tanto a utiliza&amp;#231;&amp;#227;o dessas tecnologias como o desenvolvimento delas. Paletras que tenham como tema central uma linguagem de programa&amp;#231;&amp;#227;o N&amp;#195;O devem estar nessa trilha."}, {"area_id": "13", "name": "Gerenciamento de Dados", "description": "Palestras t&amp;#233;cnicas sobre bancos de dados livres, bancos de dados distribu&amp;#237;dos, bancos de dados n&amp;#227;o convencionais (n&amp;#227;o relacionais), PostgreSQL, MySQL, Firebird, SQLite, entre outros; Armazenamento e recupera&amp;#231;&amp;#227;o de dados, tecnologias NAS, DAS, SAN, RAID, protocolos como FCiP, FCoE, iFCP, AoE, iSCSI, softwares como FreeNAS, OpenFiler, Naslite 1, protocolos em camadas mais altas como NFS, CIFS, FTP, RSYNC, entre outros; Sistemas de gerenciamento de Backups, boas pr&amp;#225;ticas, metodologias e t&amp;#233;cnicas de implementa&amp;#231;&amp;#227;o de solu&amp;#231;&amp;#245;es."}, {"area_id": "10", "name": "Hardware, Sistemas Embarcados e Robótica", "description": "Palestras sobre uso e desenvolvimento de software livre em hardware, sistemas embarcados e rob&amp;#243;tica. Plataformas livres para execu&amp;#231;&amp;#227;o em software embarcado. Adapta&amp;#231;&amp;#227;o de softwares livre para essas arquiteturas. Especifica&amp;#231;&amp;#245;es de Hardware Livre. Comparativos e an&amp;#225;lises de desempenho. Note que palestras sobre o ecossistema de Hardware, sistemas embarcados e Rob&amp;#243;tica livre N&amp;#195;O devem estar nessa trilha."}, {"area_id": "7", "name": "Jogos, Multimídia e Streaming", "description": "\n\t\t\tPalestras sobre t&amp;#233;cnicas e ferramentas para desenvolvimento de jogos com Software Livre. Inova&amp;#231;&amp;#245;es de jogos livres. Desafios da comunidade de jogos livres.&lt;br/&gt;\n\t\t\tPalestras t&amp;#233;cnicas sobre desenvolvimento e execu&amp;#231;&amp;#227;o de conte&amp;#250;do multim&amp;#237;dia com software livre. Arte Digital com software livre;&lt;br/&gt;\n\t\t\tGr&amp;#225;ficos 2d, 3d; Desenho t&amp;#233;cnico;&lt;br/&gt;\n\t\t\tAnima&amp;#231;&amp;#245;es; Ferramentas e aplicativos para autoria de conte&amp;#250;do multim&amp;#237;dia com software livre. Plataformas livres para execu&amp;#231;&amp;#227;o de conte&amp;#250;do multim&amp;#237;dia;\n\t\t"}, {"area_id": "21", "name": "JRRL3", "description": null}, {"area_id": "9", "name": "Kernel, Sistemas de Arquivos e Sistemas Operacionais", "description": "Palestras t&amp;#233;cnicas sobre kernel de sistemas operacionais livres. Desenvolvimento de m&amp;#243;dulos, diferentes arquiteturas, comparativos e casos de desenvolvimento de kernels livres para miss&amp;#245;es ou arquiteturas espec&amp;#237;ficas. Palestras t&amp;#233;cnicas sobre sistemas de arquivos livres, suas diversas implementa&amp;#231;&amp;#245;es, comparativos, desenvolvimento e outros t&amp;#243;picos relativos a sistemas operacionais livres. Note que t&amp;#243;picos sobre customiza&amp;#231;&amp;#227;o de distribui&amp;#231;&amp;#245;es N&amp;#195;O devem estar nessa trilha."}, {"area_id": "23", "name": "MeeGo Day", "description": "MeeGo Day"}, {"area_id": "14", "name": "Negócios, Implementações e Casos", "description": "Apresenta&amp;#231;&amp;#227;o de casos de sucesso (e insucesso) na ado&amp;#231;&amp;#227;o de software livre por institui&amp;#231;&amp;#245;es p&amp;#250;blicas e privadas. Casos de migra&amp;#231;&amp;#227;o (planejamento, execu&amp;#231;&amp;#227;o e resultados). Casos de institui&amp;#231;&amp;#245;es que ap&amp;#243;s adotarem software livre passaram a contribuir com a comunidade. Barreiras &amp;#224; migra&amp;#231;&amp;#227;o; mitos da migra&amp;#231;&amp;#227;o. Apresenta&amp;#231;&amp;#227;o de produtos e servi&amp;#231;os em software livre por institui&amp;#231;&amp;#245;es p&amp;#250;blicas e privadas."}, {"area_id": "3", "name": "Outras linguagens", "description": "O foco dessa trilha s&amp;#227;o palestras t&amp;#233;cnicas com temas ligados a desenvolvimento de implementa&amp;#231;&amp;#245;es livres de linguagens de programa&amp;#231;&amp;#227;o ou de desenvolvimento utilizando tais linguagens al&amp;#233;m de integra&amp;#231;&amp;#227;o com aplica&amp;#231;&amp;#245;es(ou servi&amp;#231;os), manuten&amp;#231;&amp;#227;o, comparativos e an&amp;#225;lises de desempenho nessas tecnologias. Est&amp;#225; no escopo dessa trilha palestras sobre quaisquer linguagens de programa&amp;#231;&amp;#227;o livre EXCETO: php,java,ruby,python,perl"}, {"area_id": "1", "name": "PHP e Java", "description": "O foco dessa trilha s&amp;#227;o palestras t&amp;#233;cnicas com temas ligados a desenvolvimento das linguagens de programa&amp;#231;&amp;#227;o Java e PHP ou de desenvolvimento utilizando essas linguagens al&amp;#233;m de integra&amp;#231;&amp;#227;o com aplica&amp;#231;&amp;#245;es(ou servi&amp;#231;os), manuten&amp;#231;&amp;#227;o, comparativos e an&amp;#225;lises de desempenho nessas tecnologias."}, {"area_id": "2", "name": "Python, Ruby e Perl", "description": "O foco dessa trilha s&amp;#227;o palestras t&amp;#233;cnicas com temas ligados a desenvolvimento das linguagens de programa&amp;#231;&amp;#227;o Python, Ruby e Perl ou de desenvolvimento utilizando essas linguagens al&amp;#233;m de integra&amp;#231;&amp;#227;o com aplica&amp;#231;&amp;#245;es(ou servi&amp;#231;os), manuten&amp;#231;&amp;#227;o, comparativos e an&amp;#225;lises de desempenho nessas tecnologias."}, {"area_id": "12", "name": "Segurança", "description": "Palestras sobre ferramentas de seguran&amp;#231;a, firewall, sistemas de detec&amp;#231;&amp;#227;o de intrus&amp;#227;o, pol&amp;#237;ticas de seguran&amp;#231;a e demais quest&amp;#245;es relacionadas."}, {"area_id": "17", "name": "Tópicos Emergentes", "description": "Apresenta&amp;#231;&amp;#227;o de aplica&amp;#231;&amp;#245;es implementadas usando buzzwords e novas tecnologias (que n&amp;#227;o s&amp;#227;o encaixadas nas trilhas acima)."}, {"area_id": "5", "name": "Visual/GUI", "description": "O foco dessa trilha s&amp;#227;o palestras t&amp;#233;cnicas com temas ligados a desenvolvimento visual com software livre tanto desktop, como web ou mobile.  Desenvolvimento de interfaces acess&amp;#237;veis; Frameworks t&amp;#233;cnicas e tecnologias para desenvolvimento de interfacer(ex.:  Qt, GTK, WXWidgets, css, ajax...), manuten&amp;#231;&amp;#227;o, comparativos e an&amp;#225;lises de desempenho nessas tecnologias. Est&amp;#225; no escopo dessa trilha tanto a utiliza&amp;#231;&amp;#227;o dessas tecnologias como o desenvolvimento delas. Paletras que tenham como tema central uma linguagem de programa&amp;#231;&amp;#227;o N&amp;#195;O devem estar nessa trilha."}, {"area_id": "19", "name": "WSL", "description": "<descr/>"}], "rooms": [{"capacity": "536", "translation": "True", "room_id": "8", "name": "40-T fisl 0", "position": "1"}, {"capacity": "351", "translation": "True", "room_id": "1", "name": "41-A fisl 1", "position": "2"}, {"capacity": "350", "translation": "False", "room_id": "2", "name": "41-B fisl 2", "position": "3"}, {"capacity": "250", "translation": "False", "room_id": "3", "name": "41-C fisl 3", "position": "4"}, {"capacity": "250", "translation": "False", "room_id": "4", "name": "41-D fisl 4", "position": "5"}, {"capacity": "250", "translation": "False", "room_id": "5", "name": "41-E fisl 5", "position": "6"}, {"capacity": "250", "translation": "False", "room_id": "6", "name": "41-F fisl 6", "position": "7"}, {"capacity": "110", "translation": "False", "room_id": "7", "name": "40-A fisl 7", "position": "8"}, {"capacity": "278", "translation": "False", "room_id": "11", "name": "Prédio 11 - Auditório", "position": "9"}, {"capacity": "70", "translation": "False", "room_id": "714", "name": "Prédio 40 - Sala 714", "position": "10"}, {"capacity": "50", "translation": "False", "room_id": "701", "name": "Prédio 40 - Sala 701 ", "position": "11"}, {"capacity": "50", "translation": "False", "room_id": "702", "name": "Prédio 40 - Sala 702 ", "position": "12"}], "authors": [{"author_id": "11", "name": "CAIO MORENO DE SOUZA", "candidate": "1"}, {"author_id": "15", "name": "Flávio Gomes da Silva Lisboa", "candidate": "2"}, {"author_id": "18", "name": "Flamarion Jorge", "candidate": "5"}, {"author_id": "12", "name": "Nelson De Luca Pretto", "candidate": "14"}, {"author_id": "29", "name": "Claudio Manoel Duarte de Souza", "candidate": "14"}, {"author_id": "27", "name": "Sergio Amadeu da Silveira", "candidate": "14"}, {"author_id": "28", "name": "Alexandre Oliva", "candidate": "14"}, {"author_id": "43", "name": "Cicero Monteiro", "candidate": "608"}, {"author_id": "9", "name": "Luiz Vieira", "candidate": "21"}, {"author_id": "50", "name": "Jonatã Bolzan", "candidate": "36"}, {"author_id": "109", "name": "Henrique Leandro", "candidate": "58"}, {"author_id": "39", "name": "Sergio Pohlmann", "candidate": "93"}, {"author_id": "60", "name": "Galeno Garbe", "candidate": "643"}, {"author_id": "75", "name": "Arun Gupta", "candidate": "646"}, {"author_id": "75", "name": "Arun Gupta", "candidate": "648"}, {"author_id": "5", "name": "Thiago Branco Meurer", "candidate": "520"}, {"author_id": "64", "name": "Gabriel von Winckler", "candidate": "49"}, {"author_id": "83", "name": "Carlos Eduardo Souza Moreira", "candidate": "49"}, {"author_id": "61", "name": "David William", "candidate": "50"}, {"author_id": "117", "name": "Leandro Nunes", "candidate": "583"}, {"author_id": "134", "name": "Alexandre dos Santos Andrade", "candidate": "611"}, {"author_id": "3", "name": "Thomas Soares", "candidate": "80"}, {"author_id": "153", "name": "Francisco Xavier de Figueiredo Jr.", "candidate": "208"}, {"author_id": "160", "name": "dalton martins", "candidate": "521"}, {"author_id": "16", "name": "Fabiano Castro Pereira", "candidate": "85"}, {"author_id": "176", "name": "Andre Fonseca", "candidate": "91"}, {"author_id": "179", "name": "", "candidate": "91"}, {"author_id": "14", "name": "Leonardo Alexandre Ferreira Leite", "candidate": "96"}, {"author_id": "101", "name": "Michael Hanselmann", "candidate": "150"}, {"author_id": "370", "name": "Marta Vuelma", "candidate": "189"}, {"author_id": "150", "name": "Izabel Valverde", "candidate": "103"}, {"author_id": "314", "name": "Juliano Fontoura Kazienko", "candidate": "172"}, {"author_id": "229", "name": "Domingos Teruel", "candidate": "103"}, {"author_id": "41", "name": "Fernando Ike de Oliveira", "candidate": "108"}, {"author_id": "274", "name": "Vagner Fonseca", "candidate": "580"}, {"author_id": "126", "name": "Rodrigo Carvalho Silva", "candidate": "112"}, {"author_id": "276", "name": "", "candidate": "580"}, {"author_id": "180", "name": "Marcelo Li Koga", "candidate": "96"}, {"author_id": "283", "name": "Tiago de Souza Cardoso", "candidate": "116"}, {"author_id": "284", "name": "", "candidate": "116"}, {"author_id": "356", "name": "Mauricio Piacentini", "candidate": "174"}, {"author_id": "46", "name": "Rafael Jaques", "candidate": "159"}, {"author_id": "68", "name": "Paulo Roberto Balmer", "candidate": "175"}, {"author_id": "304", "name": "OSiRiS Alejandro Gómez", "candidate": "134"}, {"author_id": "315", "name": "Marlon Dutra", "candidate": "137"}, {"author_id": "303", "name": "Rafael Aquini", "candidate": "176"}, {"author_id": "320", "name": "Roger Brinkley", "candidate": "141"}, {"author_id": "320", "name": "Roger Brinkley", "candidate": "146"}, {"author_id": "343", "name": "Gustavo Jordan Castro Brasil", "candidate": "280"}, {"author_id": "102", "name": "Marcelo Moreira de Mello", "candidate": "176"}, {"author_id": "312", "name": "Bruno PorKaria", "candidate": "182"}, {"author_id": "181", "name": "Guilherme", "candidate": "96"}, {"author_id": "154", "name": "Willian Paixao", "candidate": "582"}, {"author_id": "301", "name": "Alessandro de Oliveria Faria", "candidate": "211"}, {"author_id": "169", "name": "Aaron Shaw", "candidate": "205"}, {"author_id": "419", "name": "Benjamin Mako Hill", "candidate": "205"}, {"author_id": "365", "name": "Felipe Meneses Besson", "candidate": "206"}, {"author_id": "422", "name": "Guilherme de Maio Nogueira", "candidate": "206"}, {"author_id": "184", "name": "Daniel Bristot de Oliveira", "candidate": "261"}, {"author_id": "348", "name": "Tarsis Figueredo Azevedo", "candidate": "229"}, {"author_id": "512", "name": "Francisco Saito", "candidate": "262"}, {"author_id": "476", "name": "Luzitan Orso Zancan", "candidate": "231"}, {"author_id": "10", "name": "Cristiano Agosti", "candidate": "231"}, {"author_id": "516", "name": "Yuri Takhteyev", "candidate": "315"}, {"author_id": "275", "name": "Ricardo Pinheiro", "candidate": "580"}, {"author_id": "327", "name": "Dalibor Topic", "candidate": "148"}, {"author_id": "101", "name": "Michael Hanselmann", "candidate": "149"}, {"author_id": "265", "name": "Rodrigo Urubatan Ferreira Jardim", "candidate": "237"}, {"author_id": "25", "name": "Thiago Alvarenga Lechuga", "candidate": "238"}, {"author_id": "21", "name": "Klaus Silveira", "candidate": "238"}, {"author_id": "14", "name": "Leonardo Alexandre Ferreira Leite", "candidate": "206"}, {"author_id": "487", "name": "Rodrigo \"Sp0oKeR\" Montoro", "candidate": "244"}, {"author_id": "483", "name": "Diego Búrigo Zacarão", "candidate": "245"}, {"author_id": "499", "name": "Emilio Francesquini", "candidate": "250"}, {"author_id": "14", "name": "Leonardo Alexandre Ferreira Leite", "candidate": "250"}, {"author_id": "503", "name": "Fabiane Bizinella Nardon", "candidate": "252"}, {"author_id": "21", "name": "Klaus Silveira", "candidate": "318"}, {"author_id": "505", "name": "Fernando Babadopulos", "candidate": "252"}, {"author_id": "506", "name": "", "candidate": "318"}, {"author_id": "184", "name": "Daniel Bristot de Oliveira", "candidate": "260"}, {"author_id": "272", "name": "Marco Antonio de Azevedo Maciel", "candidate": "266"}, {"author_id": "524", "name": "Rafael Brito Gomes", "candidate": "267"}, {"author_id": "372", "name": "Stefano Barale", "candidate": "298"}, {"author_id": "365", "name": "Felipe Meneses Besson", "candidate": "250"}, {"author_id": "517", "name": "Luis Felipe Rosado Murillo", "candidate": "315"}, {"author_id": "529", "name": "João Sebastião de Oliveira Bueno", "candidate": "270"}, {"author_id": "529", "name": "João Sebastião de Oliveira Bueno", "candidate": "272"}, {"author_id": "541", "name": "Henrique G. G. Pereira", "candidate": "275"}, {"author_id": "173", "name": "Fulvio Longhi", "candidate": "289"}, {"author_id": "538", "name": "Oona Castro", "candidate": "297"}, {"author_id": "338", "name": "Karla Brunet", "candidate": "285"}, {"author_id": "550", "name": "Pedro Mizukami", "candidate": "297"}, {"author_id": "562", "name": "Simon Ritter", "candidate": "294"}, {"author_id": "544", "name": "João Paulo Rechi Vita", "candidate": "295"}, {"author_id": "515", "name": "Luiz Carlos Pinto", "candidate": "315"}, {"author_id": "559", "name": "Olívia Bandeira de Melo Carvalho", "candidate": "297"}, {"author_id": "307", "name": "Rainer Otto Wilhelm Krüger", "candidate": "299"}, {"author_id": "565", "name": "Luiz Fernando Marrey Moncau", "candidate": "297"}, {"author_id": "564", "name": "Pablo Ortellado", "candidate": "297"}, {"author_id": "177", "name": "Ismael Castagnet Lacuesta", "candidate": "305"}, {"author_id": "81", "name": "Elaine Cecília Gatto", "candidate": "352"}, {"author_id": "658", "name": "", "candidate": "383"}, {"author_id": "587", "name": "Diego Casaes", "candidate": "313"}, {"author_id": "575", "name": "André Gugliotti", "candidate": "299"}, {"author_id": "501", "name": "Rafael Evangelista", "candidate": "315"}, {"author_id": "571", "name": "João Eriberto Mota Filho", "candidate": "323"}, {"author_id": "571", "name": "João Eriberto Mota Filho", "candidate": "327"}, {"author_id": "350", "name": "Jones Luís Noll", "candidate": "329"}, {"author_id": "546", "name": "Alberto J. Azevedo", "candidate": "283"}, {"author_id": "598", "name": "Rodolfo José Martorano Gobbi", "candidate": "330"}, {"author_id": "523", "name": "barbanegra (Mauricio Sosa Giri)", "candidate": "265"}, {"author_id": "504", "name": "Pâmela Almeida", "candidate": "255"}, {"author_id": "337", "name": "Luiz Henrique Rauber Rodrigues", "candidate": "255"}, {"author_id": "308", "name": "Vicente Aguiar", "candidate": "264"}, {"author_id": "522", "name": "Rodrigo Nunes Souto", "candidate": "264"}, {"author_id": "337", "name": "Luiz Henrique Rauber Rodrigues", "candidate": "299"}, {"author_id": "478", "name": "Victor Williams Stafusa da Silva", "candidate": "335"}, {"author_id": "606", "name": "andré luiz pereira álvares", "candidate": "335"}, {"author_id": "370", "name": "Marta Vuelma", "candidate": "341"}, {"author_id": "308", "name": "Vicente Aguiar", "candidate": "315"}, {"author_id": "501", "name": "Rafael Evangelista", "candidate": "298"}, {"author_id": "366", "name": "Capi Etheriel", "candidate": "313"}, {"author_id": "565", "name": "Luiz Fernando Marrey Moncau", "candidate": "372"}, {"author_id": "188", "name": "Rafael Soares Ferreira", "candidate": "378"}, {"author_id": "584", "name": "Bruno Magrani", "candidate": "382"}, {"author_id": "513", "name": "Bruna Griebeler", "candidate": "380"}, {"author_id": "652", "name": "Jacqueline Gomes de Aguiar", "candidate": "383"}, {"author_id": "112", "name": "Lucio Camilo Oliva Pereira", "candidate": "289"}, {"author_id": "495", "name": "Rafael Manhaes Monnerat", "candidate": "386"}, {"author_id": "651", "name": "Veridiana Alimonti", "candidate": "382"}, {"author_id": "602", "name": "Niumar André Klein", "candidate": "329"}, {"author_id": "22", "name": "Bruno Gurgel Gomes de Oliveira", "candidate": "365"}, {"author_id": "637", "name": "Guilherme Alberto Almeida de Almeida", "candidate": "372"}, {"author_id": "655", "name": "Ricardo Poppi", "candidate": "372"}, {"author_id": "485", "name": "Wesley Seidel Carvalho", "candidate": "335"}, {"author_id": "659", "name": "Rafael Carício", "candidate": "657"}, {"author_id": "112", "name": "Lucio Camilo Oliva Pereira", "candidate": "392"}, {"author_id": "173", "name": "Fulvio Longhi", "candidate": "392"}, {"author_id": "669", "name": "João Carlos Caribé", "candidate": "405"}, {"author_id": "681", "name": "Paulino Michelazzo", "candidate": "412"}, {"author_id": "672", "name": "Fabricio Bortoluzzi", "candidate": "581"}, {"author_id": "366", "name": "Capi Etheriel", "candidate": "435"}, {"author_id": "540", "name": "Ramon Mota de Souza Farias", "candidate": "473"}, {"author_id": "585", "name": "Pedro Markun", "candidate": "435"}, {"author_id": "635", "name": "Gustavo Pacheco", "candidate": "448"}, {"author_id": "685", "name": "", "candidate": "435"}, {"author_id": "670", "name": "Liane Lira", "candidate": "313"}, {"author_id": "693", "name": "Mauricio de Amorim", "candidate": "428"}, {"author_id": "650", "name": "Danilo Doneda", "candidate": "382"}, {"author_id": "359", "name": "Ricardo da Silva Ogliari", "candidate": "434"}, {"author_id": "635", "name": "Gustavo Pacheco", "candidate": "438"}, {"author_id": "709", "name": "Mauricio Falavigna", "candidate": "440"}, {"author_id": "160", "name": "dalton martins", "candidate": "440"}, {"author_id": "714", "name": "Cesar Felipe Ferreira", "candidate": "440"}, {"author_id": "715", "name": "Edgard Costa", "candidate": "448"}, {"author_id": "712", "name": "Felipe Santos", "candidate": "440"}, {"author_id": "364", "name": "Danilo Faustinoni Cabello", "candidate": "458"}, {"author_id": "186", "name": "Pedro Batista de Carvalho Filho", "candidate": "473"}, {"author_id": "663", "name": "Armando Biagioni Neto", "candidate": "395"}, {"author_id": "500", "name": "Gabriel Manhaes Monnerat", "candidate": "463"}, {"author_id": "720", "name": "Alexandre Porcelli", "candidate": "472"}, {"author_id": "727", "name": "Jerônimo Medina Madruga", "candidate": "478"}, {"author_id": "170", "name": "Emerson Rocha Luiz (fititnt)", "candidate": "555"}, {"author_id": "357", "name": "Gustavo Maia Neto", "candidate": "495"}, {"author_id": "362", "name": "Felipe Nascimento de Moura", "candidate": "485"}, {"author_id": "19", "name": "Valter Douglas Lisbôa Jr.", "candidate": "495"}, {"author_id": "318", "name": "Douglas Campos", "candidate": "503"}, {"author_id": "57", "name": "Marcus Augustus Pereira Burghardt", "candidate": "497"}, {"author_id": "677", "name": "Felipe Augusto van de Wiel", "candidate": "499"}, {"author_id": "708", "name": "Emerson Macedo", "candidate": "500"}, {"author_id": "648", "name": "Mauricio Cesar Santos da Purificação", "candidate": "504"}, {"author_id": "347", "name": "Israel da Silva Teixeira", "candidate": "501"}, {"author_id": "749", "name": "Rodolfo Henrique Carvalho", "candidate": "501"}, {"author_id": "741", "name": "Rodrigo Damazio", "candidate": "509"}, {"author_id": "768", "name": "Paulo Henrique de Lima Santana", "candidate": "534"}, {"author_id": "738", "name": "Luciana Fujii Pontello", "candidate": "512"}, {"author_id": "677", "name": "Felipe Augusto van de Wiel", "candidate": "552"}, {"author_id": "703", "name": "Leandro Fernando de Oliveira", "candidate": "522"}, {"author_id": "748", "name": "Wagner de Melo Reck", "candidate": "661"}, {"author_id": "718", "name": "Carlos Eurico Pittas do Canto", "candidate": "448"}, {"author_id": "605", "name": "Fátima Conti", "candidate": "405"}, {"author_id": "346", "name": "Frederico Gonçalves Guimarães", "candidate": "526"}, {"author_id": "759", "name": "", "candidate": "526"}, {"author_id": "760", "name": "Pablo Lorenzzoni", "candidate": "529"}, {"author_id": "28", "name": "Alexandre Oliva", "candidate": "526"}, {"author_id": "122", "name": "Ana Cristina Fricke Matte", "candidate": "526"}, {"author_id": "763", "name": "Mario Augusto Mania", "candidate": "665"}, {"author_id": "631", "name": "Diego Moreira Guimaraes", "candidate": "531"}, {"author_id": "724", "name": "Álvaro Justen", "candidate": "531"}, {"author_id": "762", "name": "Rodrigo R. Silva", "candidate": "532"}, {"author_id": "28", "name": "Alexandre Oliva", "candidate": "532"}, {"author_id": "764", "name": "Tatiana Al-Chueyr", "candidate": "533"}, {"author_id": "724", "name": "Álvaro Justen", "candidate": "533"}, {"author_id": "776", "name": "Eduardo Bregaida", "candidate": "538"}, {"author_id": "784", "name": "Flavio Sousa Silva", "candidate": "542"}, {"author_id": "774", "name": "Rafael Valle", "candidate": "543"}, {"author_id": "152", "name": "Sergio Cioban Filho", "candidate": "550"}, {"author_id": "787", "name": "Douglas Conrad", "candidate": "563"}, {"author_id": "791", "name": "Adriana Cássia da Costa", "candidate": "534"}, {"author_id": "27", "name": "Sergio Amadeu da Silveira", "candidate": "405"}, {"author_id": "793", "name": "Henrique Grolli Bassotto", "candidate": "558"}, {"author_id": "797", "name": "Deivi Lopes Kuhn", "candidate": "560"}, {"author_id": "812", "name": "Marco André Lopes Mendes", "candidate": "668"}, {"author_id": "817", "name": "César Vianna", "candidate": "574"}, {"author_id": "825", "name": "Diego Viegas", "candidate": "575"}, {"author_id": "269", "name": "Alexandre Gomes Gaigalas", "candidate": "576"}, {"author_id": "831", "name": "Eustaquio Mendes Guimaraes", "candidate": "586"}, {"author_id": "830", "name": "Leonardo Ribeiro Oliveira", "candidate": "589"}, {"author_id": "549", "name": "Felipe Sanches", "candidate": "532"}, {"author_id": "775", "name": "André Gondim", "candidate": "537"}, {"author_id": "727", "name": "Jerônimo Medina Madruga", "candidate": "596"}, {"author_id": "677", "name": "Felipe Augusto van de Wiel", "candidate": "598"}, {"author_id": "837", "name": "Carlos Brandão Schwab", "candidate": "596"}, {"author_id": "826", "name": "Leonardo Cezar", "candidate": "599"}, {"author_id": "790", "name": "Luciano Ramalho", "candidate": "633"}, {"author_id": "838", "name": "Everton Vilhena Cardoso", "candidate": "596"}, {"author_id": "764", "name": "Tatiana Al-Chueyr", "candidate": "672"}, {"author_id": "724", "name": "Álvaro Justen", "candidate": "672"}, {"author_id": "725", "name": "Alissa Gottfried", "candidate": "676"}, {"author_id": "533", "name": "Elisa Gottfried", "candidate": "676"}, {"author_id": "183", "name": "Felipe F Nunes", "candidate": "676"}, {"author_id": "742", "name": "Diórgenes Yuri Leal da Rosa", "candidate": "478"}, {"author_id": "858", "name": "Sérgio Fernandes Reinert de Lima", "candidate": "636"}, {"author_id": "193", "name": "Verónica Xhardez", "candidate": "677"}, {"author_id": "745", "name": "Rafael Pinto Garcia", "candidate": "478"}, {"author_id": "840", "name": "Júlio César Medina Madruga", "candidate": "478"}, {"author_id": "781", "name": "Felipe Bischoff", "candidate": "676"}, {"author_id": "863", "name": "rafael gil medeiros", "candidate": "676"}, {"author_id": "852", "name": "Jacques Jefferson Leão Lima", "candidate": "534"}, {"author_id": "309", "name": "Rodrigo Padula de Oliveira", "candidate": "680"}, {"author_id": "141", "name": "Fernando Mercês", "candidate": "75"}, {"author_id": "839", "name": "", "candidate": "596"}, {"author_id": "870", "name": "Gustavo Luiz Fernandes de Morais", "candidate": "681"}, {"author_id": "18", "name": "Flamarion Jorge", "candidate": "680"}, {"author_id": "546", "name": "Alberto J. Azevedo", "candidate": "370"}, {"author_id": "301", "name": "Alessandro de Oliveria Faria", "candidate": "213"}, {"author_id": "726", "name": "Odilo Schwade Junior", "candidate": "581"}, {"author_id": "738", "name": "Luciana Fujii Pontello", "candidate": "680"}, {"author_id": "24", "name": "Organização", "candidate": "684"}, {"author_id": "24", "name": "Organização", "candidate": "685"}, {"author_id": "24", "name": "Organização", "candidate": "686"}, {"author_id": "859", "name": "Fernanda Weiden", "candidate": "683"}, {"author_id": "24", "name": "Organização", "candidate": "708"}, {"author_id": "24", "name": "Organização", "candidate": "709"}, {"author_id": "766", "name": "Andre Barros de Oliveira", "candidate": "531"}, {"author_id": "24", "name": "Organização", "candidate": "710"}, {"author_id": "24", "name": "Organização", "candidate": "711"}, {"author_id": "24", "name": "Organização", "candidate": "712"}, {"author_id": "24", "name": "Organização", "candidate": "713"}, {"author_id": "865", "name": "Eliane Domingos de Sousa", "candidate": "681"}, {"author_id": "819", "name": "Claudio Ballande Romanelli", "candidate": "671"}, {"author_id": "319", "name": "Erlon Sousa Pinheiro", "candidate": "548"}, {"author_id": "521", "name": "Daniela Soares Feitosa", "candidate": "264"}, {"author_id": "162", "name": "Cristina Kiomi Mori", "candidate": "597"}, {"author_id": "24", "name": "Organização", "candidate": "714"}, {"author_id": "24", "name": "Organização", "candidate": "715"}, {"author_id": "24", "name": "Organização", "candidate": "716"}, {"author_id": "24", "name": "Organização", "candidate": "717"}, {"author_id": "24", "name": "Organização", "candidate": "718"}, {"author_id": "875", "name": "Andreza Leite", "candidate": "724"}, {"author_id": "121", "name": "Rochele Prass", "candidate": "725"}, {"author_id": "782", "name": "Mônica Paz", "candidate": "285"}, {"author_id": "897", "name": "Omar Toral", "candidate": "728"}, {"author_id": "909", "name": "Noirin Plunkett", "candidate": "777"}, {"author_id": "898", "name": "Alan Markham", "candidate": "729"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "797"}, {"author_id": "899", "name": "  Rubem Saldanha", "candidate": "730"}, {"author_id": "876", "name": "Bruce Momjian", "candidate": "738"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "799"}, {"author_id": "881", "name": "Isabel Cristina Vieira Coimbra Diniz", "candidate": "526"}, {"author_id": "900", "name": "Lenz Grimmer", "candidate": "791"}, {"author_id": "764", "name": "Tatiana Al-Chueyr", "candidate": "760"}, {"author_id": "882", "name": "Chris Hoffman", "candidate": "753"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "803"}, {"author_id": "883", "name": "Jeremy Allison", "candidate": "750"}, {"author_id": "901", "name": "Leo Cunha", "candidate": "731"}, {"author_id": "757", "name": "Dennis Gilmore", "candidate": "761"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "805"}, {"author_id": "884", "name": "Jon \"MadDog\" Hall", "candidate": "752"}, {"author_id": "902", "name": "Anil S. Gaur", "candidate": "768"}, {"author_id": "884", "name": "Jon \"MadDog\" Hall", "candidate": "782"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "807"}, {"author_id": "885", "name": "Randal L. Schwartz", "candidate": "748"}, {"author_id": "903", "name": "Leonardo da Mata", "candidate": "732"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "808"}, {"author_id": "886", "name": "Takanori Suzuki", "candidate": "783"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "809"}, {"author_id": "904", "name": "Davi Arnaut", "candidate": "792"}, {"author_id": "894", "name": "Francisco Souza", "candidate": "790"}, {"author_id": "895", "name": "Andrews Patrick Rocha Medina", "candidate": "790"}, {"author_id": "896", "name": "Vilson Carlos Pastro", "candidate": "787"}, {"author_id": "756", "name": "Helio Chissini de Castro", "candidate": "733"}, {"author_id": "912", "name": "Vinicius Depizzol", "candidate": "680"}, {"author_id": "905", "name": "Rodrigo Vivi", "candidate": "735"}, {"author_id": "228", "name": "Esteban Baez", "candidate": "103"}, {"author_id": "913", "name": "Wilkens Lenon da Silva de Adrade", "candidate": "810"}, {"author_id": "906", "name": "David Crossland", "candidate": "794"}, {"author_id": "24", "name": "Organização", "candidate": "811"}, {"author_id": "24", "name": "Organização", "candidate": "812"}, {"author_id": "907", "name": "John Jullion-Ceccarelli", "candidate": "795"}, {"author_id": "486", "name": "Fernando Hamasaki de Amorim", "candidate": "428"}, {"author_id": "916", "name": "rafael freitas de morais", "candidate": "813"}, {"author_id": "908", "name": "Luke Kowalski", "candidate": "796"}, {"author_id": "918", "name": "Carlos A. K. Hoffmann", "candidate": "815"}, {"author_id": "919", "name": "Igor Macaúbas", "candidate": "816"}, {"author_id": "925", "name": "Rainer Krüger", "candidate": "822"}, {"author_id": "924", "name": "Richard Serraria", "candidate": "821"}, {"author_id": "918", "name": "Carlos A. K. Hoffmann", "candidate": "823"}, {"author_id": "926", "name": "Ana Beatriz Gomes de Carvalho", "candidate": "825"}, {"author_id": "927", "name": "Clarisse de Lima Abrahão", "candidate": "826"}, {"author_id": "928", "name": "Newton Braga Rosa", "candidate": "827"}, {"author_id": "915", "name": "Andre Abdala Noel", "candidate": "537"}, {"author_id": "887", "name": "Jared K. Smith", "candidate": "757"}, {"author_id": "165", "name": "Bárbara Geraldo de Castro", "candidate": "726"}, {"author_id": "876", "name": "Bruce Momjian", "candidate": "737"}, {"author_id": "951", "name": "Francisco Gonzalez", "candidate": "846"}, {"author_id": "933", "name": "Thiago Rondon", "candidate": "788"}, {"author_id": "930", "name": "Carol Smith", "candidate": "756"}, {"author_id": "859", "name": "Fernanda Weiden", "candidate": "692"}, {"author_id": "929", "name": "Ignacio Espinoza", "candidate": "739"}, {"author_id": "859", "name": "Fernanda Weiden", "candidate": "691"}, {"author_id": "946", "name": "Tobias Oetiker", "candidate": "754"}, {"author_id": "931", "name": "Bruno Oliveira", "candidate": "699"}, {"author_id": "24", "name": "Organização", "candidate": "841"}, {"author_id": "934", "name": "Ministro Aloizio Mercadante Oliva", "candidate": "828"}, {"author_id": "712", "name": "Felipe Santos", "candidate": "742"}, {"author_id": "2", "name": "Rodrigo Troian", "candidate": "742"}, {"author_id": "935", "name": "Jon Melamut", "candidate": "832"}, {"author_id": "889", "name": "Paulo Fernando Lamellas", "candidate": "785"}, {"author_id": "936", "name": "Alexei Vladishev ", "candidate": "736"}, {"author_id": "945", "name": "Jorge Franco", "candidate": "134"}, {"author_id": "937", "name": "Elektra", "candidate": "741"}, {"author_id": "947", "name": "Cédric Thomas", "candidate": "838"}, {"author_id": "890", "name": "Alexandre Porto da Silva", "candidate": "918"}, {"author_id": "939", "name": "Irmão Pedro Ost", "candidate": "834"}, {"author_id": "938", "name": "Ana Paula de Barcellos", "candidate": "918"}, {"author_id": "940", "name": "Charline Poirier", "candidate": "836"}, {"author_id": "946", "name": "Tobias Oetiker", "candidate": "698"}, {"author_id": "932", "name": "Jorge Enrique Rojas", "candidate": "740"}, {"author_id": "845", "name": "Pablo Javier Etcheverry", "candidate": "837"}, {"author_id": "744", "name": "Rodrigo Pizarro dos Santos", "candidate": "478"}, {"author_id": "495", "name": "Rafael Manhaes Monnerat", "candidate": "839"}, {"author_id": "946", "name": "Tobias Oetiker", "candidate": "835"}, {"author_id": "953", "name": "David Duffey", "candidate": "847"}, {"author_id": "949", "name": "Karlisson Bezerra", "candidate": "842"}, {"author_id": "948", "name": "Miguel Koren O'Brien", "candidate": "840"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "804"}, {"author_id": "950", "name": "Marcelo Neves", "candidate": "845"}, {"author_id": "952", "name": "Simon Phipps", "candidate": "751"}, {"author_id": "954", "name": "Luis Gonzalo Vega ", "candidate": "70"}, {"author_id": "955", "name": "Jonathan Gabriel Garcia ", "candidate": "70"}, {"author_id": "956", "name": "Paulo Maia", "candidate": "848"}, {"author_id": "963", "name": "Ronaldo P. Wanzeller", "candidate": "854"}, {"author_id": "845", "name": "Pablo Javier Etcheverry", "candidate": "853"}, {"author_id": "961", "name": "Diego Amor", "candidate": "853"}, {"author_id": "962", "name": "Renato Toshiyuki Murasaki", "candidate": "853"}, {"author_id": "965", "name": "MAURO LEMES DA SILVA", "candidate": "856"}, {"author_id": "966", "name": "Thiago Franco de Moraes", "candidate": "857"}, {"author_id": "967", "name": "Francisco Gentil Espildora", "candidate": "858"}, {"author_id": "968", "name": "Gustavo Niemeyer", "candidate": "860"}, {"author_id": "969", "name": "Antonio M. Moreiras", "candidate": "688"}, {"author_id": "970", "name": "Rodrigo R. dos Santos", "candidate": "688"}, {"author_id": "970", "name": "Rodrigo R. dos Santos", "candidate": "747"}, {"author_id": "969", "name": "Antonio M. Moreiras", "candidate": "747"}, {"author_id": "970", "name": "Rodrigo R. dos Santos", "candidate": "745"}, {"author_id": "969", "name": "Antonio M. Moreiras", "candidate": "745"}, {"author_id": "970", "name": "Rodrigo R. dos Santos", "candidate": "746"}, {"author_id": "969", "name": "Antonio M. Moreiras", "candidate": "746"}, {"author_id": "971", "name": "Gilson Lopes Costa", "candidate": "861"}, {"author_id": "851", "name": "Bianca Santana", "candidate": "798"}, {"author_id": "12", "name": "Nelson De Luca Pretto", "candidate": "824"}, {"author_id": "156", "name": "Paloma Brandão da Costa", "candidate": "726"}, {"author_id": "15", "name": "Flávio Gomes da Silva Lisboa", "candidate": "859"}, {"author_id": "880", "name": "Sidnei da Silva", "candidate": "744"}, {"author_id": "1029", "name": "Carlos Francisco Gomide ", "candidate": "915"}, {"author_id": "972", "name": "Barry Newsted", "candidate": "800"}, {"author_id": "973", "name": "Jessie Wild ", "candidate": "802"}, {"author_id": "974", "name": "Paulo Bastos", "candidate": "806"}, {"author_id": "1030", "name": "Eberli Cabistani Riella", "candidate": "915"}, {"author_id": "1031", "name": "Paulo Gilberto Thiesen", "candidate": "915"}, {"author_id": "1032", "name": "Ranieri Fernandes ", "candidate": "916"}, {"author_id": "976", "name": "Jomar Silva", "candidate": "862"}, {"author_id": "708", "name": "Emerson Macedo", "candidate": "704"}, {"author_id": "975", "name": "Anahuac de Paula Gil", "candidate": "548"}, {"author_id": "978", "name": "Reinaldo Ferraz", "candidate": "864"}, {"author_id": "979", "name": "Carlinhos Cecconi", "candidate": "865"}, {"author_id": "982", "name": "Luiz Eduardo Roncato Cordeiro", "candidate": "868"}, {"author_id": "978", "name": "Reinaldo Ferraz", "candidate": "865"}, {"author_id": "985", "name": "Heitor de Souza Ganzeli", "candidate": "872"}, {"author_id": "986", "name": "Rodrigo Patriota", "candidate": "873"}, {"author_id": "177", "name": "Ismael Castagnet Lacuesta", "candidate": "265"}, {"author_id": "979", "name": "Carlinhos Cecconi", "candidate": "864"}, {"author_id": "865", "name": "Eliane Domingos de Sousa", "candidate": "120"}, {"author_id": "989", "name": "Douglas Andrade", "candidate": "876"}, {"author_id": "988", "name": "Leonardo Santagada", "candidate": "875"}, {"author_id": "1046", "name": "Daniel Domscheit-Berg", "candidate": "928"}, {"author_id": "324", "name": "Érico Andrei", "candidate": "877"}, {"author_id": "993", "name": "James A. Beasley", "candidate": "727"}, {"author_id": "1067", "name": "Raphael Hamzagic", "candidate": "174"}, {"author_id": "1035", "name": "Fabricio Solagna", "candidate": "917"}, {"author_id": "1034", "name": "Everton Rodrigues ", "candidate": "917"}, {"author_id": "1017", "name": "Carlson Aquistapasse", "candidate": "917"}, {"author_id": "991", "name": "Stormy Peters", "candidate": "755"}, {"author_id": "1047", "name": "Jon Phillips", "candidate": "900"}, {"author_id": "1033", "name": "Vinicius Wu", "candidate": "917"}, {"author_id": "996", "name": "Mathias Kirschner", "candidate": "881"}, {"author_id": "360", "name": "Jaydson Gomes", "candidate": "505"}, {"author_id": "949", "name": "Karlisson Bezerra", "candidate": "797"}, {"author_id": "997", "name": "Cleilton Soares de Moura", "candidate": "882"}, {"author_id": "841", "name": "Lincoln de Sousa", "candidate": "917"}, {"author_id": "990", "name": "Mario Augusto Mania", "candidate": "876"}, {"author_id": "1000", "name": "INOVAPOA", "candidate": "885"}, {"author_id": "928", "name": "Newton Braga Rosa", "candidate": "886"}, {"author_id": "81", "name": "Elaine Cecília Gatto", "candidate": "726"}, {"author_id": "1002", "name": "Vagner Diniz", "candidate": "887"}, {"author_id": "1037", "name": "Cleverson Sacramento de Oliveira", "candidate": "859"}, {"author_id": "1003", "name": "Antonio Carlos Pina", "candidate": "888"}, {"author_id": "1036", "name": "Rudá Porto Filgueiras", "candidate": "875"}, {"author_id": "1004", "name": "Winston Oyadomari", "candidate": "889"}, {"author_id": "976", "name": "Jomar Silva", "candidate": "891"}, {"author_id": "1008", "name": "Claudia  Katherine  Rodrigues", "candidate": "893"}, {"author_id": "1006", "name": "Sérgio Rosa", "candidate": "891"}, {"author_id": "1007", "name": "Christian \"kiko\" Reis", "candidate": "892"}, {"author_id": "1009", "name": "Antonio M. Moreiras, Reinaldo Matsushima ", "candidate": "894"}, {"author_id": "1010", "name": "Tiago Giovanaz da Silva", "candidate": "895"}, {"author_id": "1011", "name": "Elemar Marius Berbigier", "candidate": "897"}, {"author_id": "1012", "name": "Erico Jose Ferreira e Marcelo Luis Machado Moura", "candidate": "898"}, {"author_id": "1048", "name": "Jacob Appelbaum", "candidate": "844"}, {"author_id": "509", "name": "Ana Rauber", "candidate": "255"}, {"author_id": "1039", "name": "Qt office", "candidate": "693"}, {"author_id": "1013", "name": "Claudio Dutra", "candidate": "831"}, {"author_id": "1014", "name": "Ana Claudia Figueroa", "candidate": "831"}, {"author_id": "910", "name": "GT-Cultura", "candidate": "899"}, {"author_id": "1040", "name": "Metasys", "candidate": "694"}, {"author_id": "764", "name": "Tatiana Al-Chueyr", "candidate": "901"}, {"author_id": "24", "name": "Organização", "candidate": "902"}, {"author_id": "24", "name": "Organização", "candidate": "903"}, {"author_id": "1016", "name": "Vinicius Eloy dos Reis", "candidate": "904"}, {"author_id": "1017", "name": "Carlson Aquistapasse", "candidate": "905"}, {"author_id": "1018", "name": "Claudio Dutra", "candidate": "906"}, {"author_id": "1019", "name": "Luiz Claudio Mesquita de Souza", "candidate": "597"}, {"author_id": "1024", "name": "Claudio Vidal", "candidate": "910"}, {"author_id": "952", "name": "Simon Phipps", "candidate": "911"}, {"author_id": "1041", "name": "Arliones Hoeller Jr", "candidate": "690"}, {"author_id": "1025", "name": "Governador Tarso Genro", "candidate": "833"}, {"author_id": "529", "name": "João Sebastião de Oliveira Bueno", "candidate": "804"}, {"author_id": "1027", "name": "Evandro Della Vecchia Pereira", "candidate": "912"}, {"author_id": "27", "name": "Sergio Amadeu da Silveira", "candidate": "824"}, {"author_id": "931", "name": "Bruno Oliveira", "candidate": "919"}, {"author_id": "1049", "name": "Slex Sandro Gomes ", "candidate": "824"}, {"author_id": "995", "name": "Michael Verdi", "candidate": "762"}, {"author_id": "931", "name": "Bruno Oliveira", "candidate": "921"}, {"author_id": "1050", "name": "Simão Pedro Marinho", "candidate": "825"}, {"author_id": "495", "name": "Rafael Manhaes Monnerat", "candidate": "940"}, {"author_id": "1042", "name": "Tim Bray ", "candidate": "922"}, {"author_id": "878", "name": "Hollman Enciso", "candidate": "740"}, {"author_id": "913", "name": "Wilkens Lenon da Silva de Adrade", "candidate": "930"}, {"author_id": "1044", "name": "Daniel Galpin ", "candidate": "924"}, {"author_id": "944", "name": "Elizabeth Sosa", "candidate": "134"}, {"author_id": "987", "name": "Bruno Ferreira de Souza", "candidate": "925"}, {"author_id": "947", "name": "Cédric Thomas", "candidate": "940"}, {"author_id": "1045", "name": "David Mirza", "candidate": "926"}, {"author_id": "889", "name": "Paulo Fernando Lamellas", "candidate": "927"}, {"author_id": "1054", "name": "Luiz Moncau", "candidate": "938"}, {"author_id": "643", "name": "Mario Brandao", "candidate": "938"}, {"author_id": "1046", "name": "Daniel Domscheit-Berg", "candidate": "934"}, {"author_id": "1047", "name": "Jon Phillips", "candidate": "935"}, {"author_id": "1055", "name": "Pamella Passos", "candidate": "938"}, {"author_id": "326", "name": "Bruno Buys", "candidate": "941"}, {"author_id": "859", "name": "Fernanda Weiden", "candidate": "936"}, {"author_id": "1053", "name": "Bruno Montenegro Santana", "candidate": "785"}, {"author_id": "987", "name": "Bruno Ferreira de Souza", "candidate": "874"}, {"author_id": "1052", "name": "Werner Almesberger", "candidate": "937"}, {"author_id": "952", "name": "Simon Phipps", "candidate": "933"}, {"author_id": "976", "name": "Jomar Silva", "candidate": "933"}, {"author_id": "1068", "name": "Ney de Lima Machado Junior", "candidate": "945"}, {"author_id": "1056", "name": "Vanderlei Pollon", "candidate": "939"}, {"author_id": "573", "name": "Cesar Brod", "candidate": "299"}, {"author_id": "1057", "name": "José Damico", "candidate": "734"}, {"author_id": "572", "name": "Corinto Meffe", "candidate": "299"}, {"author_id": "1058", "name": "Luiz Cordeiro", "candidate": "931"}, {"author_id": "1063", "name": "Marlon Silva Carvalho", "candidate": "859"}, {"author_id": "1059", "name": "Maxwell Dayvson", "candidate": "929"}, {"author_id": "1060", "name": "Olivia Bandeira", "candidate": "938"}, {"author_id": "1061", "name": "Jefferson Dousseau", "candidate": "938"}, {"author_id": "1062", "name": "Tony Wasserman", "candidate": "749"}, {"author_id": "156", "name": "Paloma Brandão da Costa", "candidate": "725"}, {"author_id": "884", "name": "Jon \"MadDog\" Hall", "candidate": "833"}, {"author_id": "27", "name": "Sergio Amadeu da Silveira", "candidate": "833"}, {"author_id": "28", "name": "Alexandre Oliva", "candidate": "833"}, {"author_id": "993", "name": "James A. Beasley", "candidate": "833"}, {"author_id": "1076", "name": "Fabrício Raupp Tamusiunas ", "candidate": "944"}, {"author_id": "1077", "name": "Rogério Maegaki", "candidate": "944"}, {"author_id": "1078", "name": "Murilo Lima", "candidate": "944"}, {"author_id": "719", "name": "Daniela B. Silva", "candidate": "798"}, {"author_id": "12", "name": "Nelson De Luca Pretto", "candidate": "798"}, {"author_id": "1079", "name": "Nelito Falcão da Silva", "candidate": "856"}, {"author_id": "918", "name": "Carlos A. K. Hoffmann", "candidate": "946"}, {"author_id": "1080", "name": "Santiago Ferreira", "candidate": "265"}, {"author_id": "1065", "name": "Ronald Emerson Scherolt da Costa", "candidate": "597"}, {"author_id": "1083", "name": "Luiz Fuzaro", "candidate": "891"}, {"author_id": "1084", "name": "Coletivo", "candidate": "697"}, {"author_id": "1086", "name": "Julio Neves", "candidate": "947"}, {"author_id": "85", "name": "Carlos Machado", "candidate": "947"}, {"author_id": "1087", "name": "Heliomar Medeiros", "candidate": "597"}, {"author_id": "1088", "name": "Diego Dorgam", "candidate": "597"}, {"author_id": "161", "name": "Soraia Silva de Mello ", "candidate": "597"}, {"author_id": "24", "name": "Organização", "candidate": "948"}]}